
# from 韵部检索 - 诗词吾爱网 www.52shici.com

# 平水韵
psy_1dong = '东中同童僮铜桐峒筒瞳潼衷忠盅虫冲终忡崇嵩菘戎绒弓躬宫穹融雄熊穷冯风枫疯丰充隆窿空公功工攻蒙蒙朦瞢笼胧栊咙懵聋珑砻泷蓬逢篷洪荭红虹鸿丛翁嗡匆葱聪骢通棕烘崆璁';
psy_2dong = '冬咚彤农秾侬宗淙锺钟供龙重从茏舂松淞冲纵容榕蓉溶庸佣慵封胸凶匈汹雍邕痈浓脓恭逢缝峰锋丰蜂烽葑踪茸蛩邛筇懵跫蚣喁悰熔';
psy_3jiang = '江缸窗邦双泷庞豇扛杠腔梆桩幢降撞';
psy_4zhi = '支枝肢移垂陂碑奇宜仪皮儿离施知思驰为池规危吹骑遗夷犁师姿迟龟眉悲之芝时诗棋旗辞词期祠基疑姬丝司葵医帷滋持随痴维卮麋螭麾墀弥醾慈肌脂雌披嬉尸狸炊湄篱兹差疲茨卑亏蕤歧岐谁斯澌私窥熙欺疵赀羁彝髭颐资糜饥衰锥姨夔祗涯伊追蓍缁萁箕椎罴篪萎匙脾坻嶷治骊綦怡尼漪牺饴而鸱推陲魑锤缡璃羸帔蘼芪畸羲曦欹猗崎崖筛狮蛳绥虽粢瓷嫠痍惟唯耆逵岿丕毗枇貔楣霉辎蚩嗤媸飔埘莳鲥鹚笞漓贻禧噫其琪祺麒栀鹂累踟琵祁骐訾咨睢馗胝鳍蛇陴淇丽厮氏僖嘻琦怩熹孜罹磁痿隋逶郦嵋椅縻迤';
psy_5wei = '微薇晖辉徽挥韦围帏违闱霏菲妃飞非扉肥威祈畿机衣几讥玑稀希依归饥矶欷诽绯晞葳巍沂圻颀';
psy_6yu = '鱼渔初书舒居裾琚车渠蕖余誉疏舆胥狙锄蔬予梳虚嘘墟徐猪闾庐驴诸储除滁蜍如畲淤妤苴菹沮徂龉茹榈於祛蘧疽蛆醵纾樗躇欤据';
psy_7yu = '虞愚娱隅无芜巫于衢癯瞿氍儒襦濡须需朱珠株诛朱铢蛛殊俞瑜榆愉逾渝窬谀腴区躯驱岖趋扶符凫芙雏敷麸夫肤纡输枢厨俱驹模谟摹蒲逋胡湖瑚乎壶狐弧孤辜姑觚菰徒途涂荼图屠奴吾梧吴租卢鲈炉芦颅垆蚨孥帑苏酥乌污枯粗都茱侏姝禺拘嵎蹰桴俘臾萸吁滹瓠糊醐呼沽酤泸舻轳鸬驽匍葡铺菟诬呜迂盂竽趺毋孺酴鸪骷刳蛄晡蒱葫呱蝴劬殂猢郛孚';
psy_8qi = '齐黎犁梨妻萋凄堤低题提蹄啼骊鸡稽兮倪霓西栖犀嘶撕梯鹂鼙赍迷泥溪蹊圭闺携畦嵇跻奚脐醯黧蠡醍鹈奎批砒睽荑篦齑藜猊蜺鲵羝笄';
psy_9jia = '佳街鞋牌柴钗差崖涯偕阶皆谐骸排乖怀淮豺侪埋楷霾斋槐睚崽秸揩挨俳娃';
psy_10hui = '灰恢魁隈回徊槐梅枚玫媒煤雷颓崔催摧堆陪杯醅嵬推诙裴培盔偎煨瑰茴追胚徘坯桅傀儡莓开哀埃台苔抬该才材财裁栽哉来莱灾猜孩徕骀胎唉垓陔挨皑呆腮';
psy_11zhen = '真因茵辛新薪晨辰臣人仁神亲申身宾滨槟缤邻鳞麟珍瞋尘陈春泯津秦频颦濒银垠筠谆巾民岷珉贫莼淳醇纯唇伦轮沦抡匀旬巡驯钧均榛莘遵循甄宸纶椿鹑屯呻粼嶙辚磷呻伸绅寅姻荀询洵峋氤恂嫔彬皴娠闽纫湮肫逡菌臻豳夤嗔';
psy_12wen = '文纹蚊云氛纷芬焚坟群裙君军勤斤筋勋薰曛醺芸耘芹欣氲荤汶闻汾殷雯分贲纭昕熏';
psy_13yuan = '元原源沅鼋园袁猿垣烦蕃樊喧萱暄冤怨言轩藩媛援辕番繁翻幡璠鸳鹓蜿湲爰掀燔谖魂浑温孙门尊存论敦墩炖暾蹲豚村屯囤盆奔昏痕根恩吞荪扪昆鲲坤仑婚阍髡馄喷狲饨臀跟瘟飧棔樽';
psy_14han = '寒韩丹单安冠看观难鞍漫翰餐檀坛滩弹残汗干肝竿阑栏澜兰刊丸完桓纨端湍酸团攒官鸾銮峦欢宽盘蟠叹邯郸摊玕拦珊狻鼾杆跚姗殚箪瘅谰獾倌棺剜潘盘般蹒瘢磐瞒谩馒鳗钻抟邗';
psy_15shan = '删潸关弯湾还环鬟寰班斑蛮患颜奸攀顽山闲艰间悭孱潺擐圜菅般颁鬘疝讪斓娴鹇鳏殷纶';

psy_1xian = '先前千阡笺天坚肩贤弦玄鲜烟莲怜连田填传研巅扇燕扁便鬈宣年颠牵妍眠渊涓捐娟边编悬泉迁仙钱煎然延筵毡旃蝉缠嬛廛联篇偏绵全镌穿川缘鸢旋船涎鞭专圆圈员乾虔愆权拳椽焉嫣鞯褰搴铅舷跹鹃筌痊诠悛邅禅婵躔颛燃涟琏翩骈癫阗钿沿蜒胭芊鳊胼滇佃畋咽湮狷蠲蔫骞膻棉拴荃籼砖挛儇璇卷单溅犍';
psy_2xiao = '萧箫挑貂刁凋雕迢条髫调蜩枭浇聊辽寥撩寮僚料尧宵消燎霄绡销超朝潮嚣骄娇蕉焦椒饶硝烧遥徭摇谣瑶韶昭招镳瓢苗猫腰桥乔娆妖飘逍潇鸮骁祧鹪鹩缭獠嘹夭幺邀要姚樵谯憔标飚嫖漂剽佻龆苕岧噍哓跷侥了魈峣描钊轺桡铫鹞翘枵侨窑礁';
psy_3yao = '肴巢交郊茅嘲钞包胶苞梢姣庖匏坳敲胞抛蛟崤鵁鞘稍抄蝥咆哮凹淆教跑艄捎爻咬铙茭炮泡鲛刨抓';
psy_4hao = '豪劳毫操髦绦刀萄猱褒桃糟旄袍挠蒿涛皋号陶鳌曹遭羔糕高搔毛艘滔骚韬缫膏牢醪逃濠壕饕洮淘叨啕篙熬遨翱嗷臊嗥尻鏖螯獒敖牦漕嘈槽掏唠涝捞痨芼';
psy_5ge = '歌多罗河戈阿和波科柯陀娥蛾鹅萝荷何过磨螺禾珂蓑婆坡呵哥轲沱鼍拖驼跎佗颇峨俄摩么娑那莎迦疴苛蹉嵯驮箩逻锣哪挪锅诃窠蝌髁倭涡窝讹陂鄱皤魔梭唆骡挼靴瘸搓哦瘥酡磋';
psy_6ma = '麻花霞家茶华沙车牙蛇瓜斜邪芽嘉瑕纱鸦遮叉奢涯巴耶嗟遐加笳赊槎差蟆骅虾葭袈裟砂衙呀琶咱耙芭杷笆疤爬葩些佘鲨查茬楂娃渣爹挝咤拿椰珈跏枷迦痂茄桠丫哑划哗夸胯抓洼呱';
psy_7yang = '阳杨扬香乡光昌堂章慷相张王房浪芳塘妆常嫦凉霜长创丧藏当量场将飏强央泱抢泱鸯秧嫱床方肓浆觞梁娘庄黄仓皇装殇襄骧湘箱缃忘望芒尝偿樯枪坊囊郎狼铓唐狂肠康冈苍匡荒遑行妨棠翔良航倡伥羌戕庆姜僵缰疆粮穰墙桑刚祥详洋徉佯粱羊伤汤鲂樟彰漳璋猖商防筐煌隍凰蝗惶璜廊裆珰沧岗纲亢吭潢钢盲簧忙茫傍汪臧琅庠裳昂障糖疡锵杭邙赃滂禳攘瓤螳踉眶炀阊彭蒋亡殃蔷镶孀搪旁彷胱磅膀螃徨';
psy_8geng = '庚更羹盲横觥彭亨英烹平丁枰京惊荆明盟鸣荣莹兵兄卿生甥笙牲擎鲸迎行衡耕萌甍宏闳茎罂莺樱泓橙争筝清情晴精睛菁晶旌盈楹瀛嬴赢营婴缨贞成盛城诚呈程酲声征正轻名令并倾萦琼峥嵘撑粳坑铿撄鹦黥蘅澎膨棚浜坪苹评钲伧檠嘤轰铮狰宁狞瞪绷怦璎砰氓鲭侦柽蛏茔赪茕赓嬛黉瞠';
psy_9qing = '青经泾形陉亭庭廷霆蜓停丁仃馨星腥醒惺俜灵龄呤玲铃伶零听冥溟铭瓶屏萍荧萤扃垧蜻硎苓聆瓴翎娉婷宁暝瞑螟猩钉疔叮厅町泠棂囹羚蛉咛型邢';
psy_10zheng = '蒸烝承丞惩澄陵凌绫菱冰膺鹰应蝇绳升缯凭乘胜兴仍兢矜征徴徵称登灯僧憎增曾矰层能弘朋鹏肱薨腾藤恒罾崩滕誊崚嶒姮塍冯症簦瞢凝棱楞';
psy_11you = '尤邮优忧尤流旒留骝榴刘由油游猷悠攸牛修羞馐秋周州洲舟酬雠柔俦畴筹稠丘邱抽瘳遒逑收鸠搜驺愁休呕囚求裘仇浮谋牟眸侔矛侯喉猴讴鸥楼陬偷头投钩沟幽纠啾楸蚯踌绸惆勾娄琉疣犹邹兜呦咻貅球蜉蝣辀帱阄瘤硫浏庥湫泅酋瓯啁飕鍪篌抠篝诌骰偻沤蝼髅搂欧彪掊虬揉蹂抔不瓿缪';
psy_12qin = '侵沉深寻浔临林霖针箴斟沈心琴禽擒衾钦吟今襟金音阴淫岑簪壬任歆森禁祲喑琛涔骎参忱淋妊掺参椹郴芩檎琳蟫愔喑黔嵚砧';
psy_13qing = '覃潭参骖南楠男谙庵含涵函岚蚕探贪耽眈龛堪谈甘三酣柑惭蓝担簪谭昙坛婪戡颔痰篮褴蚶憨泔聃邯蟫毵';
psy_14yan = '盐檐廉帘嫌严占髯谦奁纤恹签瞻蟾炎添兼缣沾尖潜阎镰黏淹钳甜恬拈砭詹蒹歼黔钤佥觇崦渐鹣腌襜阉';
psy_15xian = '咸缄岩谗衔帆函衫杉监凡馋芟搀喃嵌掺巉';

psy_s_1dong = '董懂动孔总笼拢桶捅蓊蠓汞懵';
psy_s_2zhong = '肿种踵宠垅拥冗冢捧勇甬踊涌俑蛹恐拱竦悚耸巩怂汹奉';
psy_s_3jiang = '讲港棒蚌项耩';
psy_s_4zhi = '纸只咫是靡彼毁委诡髓累技绮觜此泚蕊徙尔弭几己婢侈弛豕紫旨指视美否痞兕姊比水轨止徴徵市喜已纪跪妓蚁鄙晷子仔梓矢雉死履垒癸趾址以已似耜祀史驶耳使里理李起杞圯跂士仕俟始齿矣耻麂枳峙鲤迩氏玺巳滓苡倚匕迤逦旖旎舣蚍秕芷拟你企诔捶屣棰揣豸祉恃';
psy_s_5wei = '尾苇鬼岂卉伟斐菲匪篚娓悱榧韪炜虺玮虮几';
psy_s_6yu = '语圉圄吕侣旅杼伫与渚煮暑鼠汝茹黍杵处贮女许予拒炬距所楚础阻俎沮叙绪序屿墅巨去苣举讵溆浒钜醑咀诅苎抒楮';
psy_s_7yu = '麌雨宇舞府鼓虎古股贾估土吐圃庾户树煦诩努辅组乳弩补鲁橹睹腐数簿竖普侮斧聚午伍釜缕部柱矩武五苦取抚浦主杜坞祖愈堵扈父甫禹羽怒腑拊俯罟赌卤姥鹉拄莽栩窭脯妩庑否麈褛篓偻酤牡谱怙肚踽虏孥诂瞽羖祜沪雇仵缶母某亩蛊琥';
psy_s_8ji = '荠礼体米启陛洗邸底抵弟坻柢涕悌济澧醴诋眯娣棨递昵睨蠡';
psy_s_9xie = '蟹解洒拐矮摆买骇楷';
psy_s_10hui = '贿悔罪馁每块汇猥璀磊蕾傀儡腿海改采彩在宰醢铠恺待殆怠乃载凯闿倍蓓迨亥';
psy_s_11zhen = '轸敏允引尹尽忍准隼笋盾闵悯菌蚓牝殒紧蠢陨哂诊疹赈肾蜃膑黾窘吮泯缜';
psy_s_12wen = '吻粉蕴愤隐谨近忿抆刎揾槿瑾恽韫';
psy_s_13ruan = '阮远晚苑返反饭偃蹇琬沅宛圈婉畹菀蜿绻巘挽堰混棍阃悃捆衮滚鲧稳本畚笨损忖囤遁很沌恳垦龈';
psy_s_14han = '旱暖管琯满短馆缓盥碗懒伞伴卵散伴诞罕瀚断侃算款但坦袒纂缎拌懑谰莞';
psy_s_15shan = '潸眼简版板阪盏产限绾柬拣撰馔赧皖汕铲羼见楝栈';
psy_s_16xian = '铣善遣浅典转衍犬选冕辇免鲜扁展茧辨篆勉剪卷显饯践喘藓软蹇演兖件腆跣缅缱殄匾蚬岘畎燹隽键变泫癣阐颤膳鳝舛娩辗邅脔辫捻';
psy_s_17xiao = '筱小表鸟了晓少扰绕绍杪沼眇燎矫皎杳窈窕袅挑掉肇缥缈渺淼茑赵兆缴缭夭悄舀侥蓼娆硗剿晁藐秒殍了';
psy_s_18qiao = '巧饱卯狡爪鲍挠搅绞拗咬炒吵佼姣昴茆獠';
psy_s_19hao = '皓宝藻早枣老好道稻造脑恼岛倒祷捣抱讨考燥扫嫂保鸨稿草昊浩镐杲缟槁堡皂瑙媪燠袄懊葆褓芼澡套涝蚤拷栲';
psy_s_20ge = '哿火舸亸舵我躲拖娜荷可左果裹朵锁琐堕惰妥坐裸跛颇夥颗祸桠婀逻卵那坷爹簸叵垛哆硪么峨';
psy_s_21ma = '马下者野雅瓦寡傻社写泻夏也把厦惹冶贾假且玛姐舍喏赭洒嘏剐打耍那';
psy_s_22yang = '养痒象像橡仰朗桨奖蒋躺敞氅厂攘枉往颡惘两曩丈杖仗响掌党想鲞榜爽广享向飨幌莽纺网荡上壤赏晌仿罔谠倘魍魉谎蟒漭嗓盎恍脏吭沆慷襁镪肮犷';
psy_s_23gen = '梗影景井岭领境警请饼永骋逞颖颍顷整静省幸颈郢猛丙炳杏并秉耿矿冷靖哽绠荇艋蜢皿儆悻婧阱狰靓打瘿并犷眚憬鲠';
psy_s_24jiong = '迥炯茗挺艇梃醒酩酊并等鼎顶肯拯謦刭';
psy_s_25you = '有酒首口母妇後柳友斗狗久负厚手叟守否右受牖偶走阜九后咎薮吼帚垢舅纽藕朽臼肘韭亩剖诱牡缶酉苟丑糗扣叩某莠寿绶玖授蹂揉溲纣钮扭呕殴纠耦掊瓿拇姆擞绺抖陡蚪篓黝赳取';
psy_s_26qin = '寝饮锦品枕审甚廪衽稔凛懔沈朕荏婶葚禀噤谂怎恁饪覃';
psy_s_27gan = '感览揽胆澹啖坎惨敢颔撼毯糁湛菡萏罱椠喊嵌橄榄';
psy_s_28yan = '俭焰敛险检脸染掩点簟贬冉苒陕谄俨闪剡忝琰奄歉芡崭堑渐罨捡弇崦玷';
psy_s_29xian = '豏槛范减舰犯湛巉斩黯范';

psy_q_1song = '送梦凤洞众中瓮贡弄冻痛栋恸仲粽讽空控哄赣';
psy_q_2song = '宋重用颂诵统纵讼种综俸共供从缝葑壅雍封雺惷';
psy_q_3jiang = '绛巷戆降巷惷撞虹洚鬨憧幢艟淙';
psy_q_4zhi = '寘置事地意志泪吏赐自字义利器位戏至次伪萎为思寺瑞施智记异骑遗致治吹备肆翠使试类弃饵媚鼻易辔坠醉议翅避笥帜炽粹莳谊帅厕寄睡忌贰萃穗二臂嗣遂恣四骥季刺驷寐魅积被懿觊冀愧匮恚馈蒉篑柜暨庇豉莉腻秘比鸷毖啻示嗜饲伺薏祟值惴屣眦詈企渍譬跛挚燧隧悴尿稚雉莅悸肄泌识侍踬';
psy_q_5wei = '未味气贵费沸尉畏慰蔚魏纬胃汇谓渭卉讳毅既蜚溉翡诽衣';
psy_q_6yu = '御处去虑誉署据驭曙助絮箸豫恕与遽庶预语踞倨蓣淤锯觑狙翥薯疏';
psy_q_7yu = '遇路辂赂露鹭树度渡赋布步酤固素具务雾鹜数怒附兔故顾句墓慕暮募注住注驻炷祚裕误悟寤戍库护屦诉妒惧趣娶铸绔傅付谕喻妪芋捕哺互孺寓赴冱吐污晤煦酤讣仆赙驸婺锢蛀飓怖铺塑愫蠹溯镀璐雇瓠迕妇负阜副富醋措';
psy_q_8ji = '霁制计势世丽岁济第艺惠慧币弟滞际涕厉契敝弊毙帝蔽髻锐戾裔袂系祭卫隶闭逝缀翳替细桂税婿例誓筮蕙诣砺励瘗噬继脆睿毳曳蒂睇妻递逮蓟蚋薜荔唳捩粝泥媲嬖彗睥睨剂嚏谛缔剃屉悌俪锲贳掣羿棣蟪剃娣说赘憩鳜彘呓谜挤';
psy_q_9tai = '泰太带外盖大濑赖籁蔡害蔼艾丐奈柰汰癞霭会旆最贝沛霈绘脍荟狈侩桧蜕酹外兑';
psy_q_10gua = '卦挂画懈廨邂隘卖派债怪坏诫戒界介芥械薤拜快迈败稗晒瀣湃寨疥届蒯篑蒉喟聩块惫';
psy_q_11dui = '队内辈佩退碎背秽对废悔北诲晦昧配妹喙溃吠肺耒块碓刈悖焙淬敦塞爱代载态菜碍戴贷黛概岱溉慨耐在鼐玳再袋逮埭祓赉赛忾暧咳嗳睐';
psy_q_12zhen = '震信印进润阵镇刃顺慎鬓晋骏闰峻衅振俊舜赆吝烬讯仞迅汛趁衬仅觐蔺浚赈龀认殡摈缙躏廑谆瞬韧浚殉馑';
psy_q_13wen = '问汶运晕韵训粪忿酝郡紊愠近抆奋郓捃靳分闻';
psy_q_14yuan = '愿怨万饭献健建宪劝蔓券远键贩畈曼挽瑗媛圈恨寸困顿遁论钝闷逊嫩溷诨巽褪喷艮揾';
psy_q_15han = '瀚翰岸干汗观汉断乱叹看漫旦算玩烂难冠贯半案按弹炭赞灌爨窜幔粲灿璨换焕唤涣悍惮段判叛绊鹳伴畔锻腕惋馆旰捍疸但罐盥婉缎缦侃蒜钻谰';
psy_q_16jian = '谏雁涧间宦晏慢盼篆栈惯串患绽幻瓣苋办谩讪铲绾孪篡裥扮单';
psy_q_17xian = '霰殿面县变箭战煽膳见燕便传砚研扇院练链碾宴贱馔荐绢彦掾眷倦羡奠卷遍恋啭眩钏倩卞汴片禅谴溅饯善甸电炼咽茜念眄淀靛佃钿镟漩拣缮现狷炫绚绽线煎选旋颤擅缘撰唁谚媛忭弁援';
psy_q_18xiao = '啸笑照庙窍妙诏召邵要曜耀调钓吊叫眺少诮料疗潦掉峤徼跳嘹漂镣廖尿肖悄峭哨俏醮燎鹩鹞轿骠票铫';
psy_q_19xiao = '效貌校孝闹豹炮教罩棹较窖爆泡刨稍钞拗敲淖';
psy_q_20hao = '号帽报导操盗噪灶奥告诰到蹈傲暴劳躁造冒悼燥犒靠懊瑁燠耄糙套纛潦耗';
psy_q_21ge = '个贺佐大饿过座挫课唾播破卧货簸和轲驮髁磋作做剁磨懦糯缚那锉挼些';
psy_q_22ma = '祃驾夜下谢榭罢夏霸暇灞嫁赦华籍假蔗化价射骂稼架诈亚麝怕借卸帕坝靶鹧贳炙嗄乍咤诧侘罅吓娅哑讶迓桦话胯跨衩柘';
psy_q_23yang = '漾上状帐唱让酿旷壮放向忘仗畅葬匠相藏创丧浪长障瘴谤飏尚涨饷样舫访贶嶂抗桁妄怆宕怅酱况望量将当亮傍恙强抢谅胀鬯吭砀伉圹纩桄挡旺炕亢阆防';
psy_q_24jin = '敬命令证性政镜盛行圣咏姓庆映病柄劲竞靓净竟孟诤更正并聘硬炳泳迸横摒阱檠迎郑獍';
psy_q_25jin = '径定听罄磬赠乘佞邓证秤莹孕剩凭迳甑宁应胫暝钉订饤锭謦兴胜称泞瞪蹭蹬亘镫凝滢凳磴泾';
psy_q_26you = '宥候就售寿秀绣宿奏兽漏富陋狩昼寇茂旧胄宙袖岫柚覆复救厩臭佑右囿豆饾窦瘦漱咒究疚谬皱逅嗅遘溜镂逗透骤又侑幼读堠仆副锈鹫绉咮灸籀酎诟蔻僦构扣购彀戊懋贸袤嗽凑鼬甃沤';
psy_q_27qin = '沁饮禁荫浸谮谶枕噤甚鸩赁喑渗窨任妊';
psy_q_28kan = '勘探暗滥啖担憾暂三绀憨澹瞰淡缆';
psy_q_29yan = '艳剑念验堑赡店占敛厌焰垫欠僭酽潋滟俺砭坫';
psy_q_30xian  = '陷鉴泛梵忏赚蘸嵌站馅';

psy_r_1wu = '屋木竹目服福禄谷熟肉族鹿漉腹菊陆轴逐苜蓿宿菽牧伏夙蔌读犊渎牍椟黩毂复粥肃碌骕鬻育六缩哭幅斛戮仆畜蓄叔淑倏独卜馥沐速祝麓辘镞蹙筑穆睦秃縠覆辐瀑郁舳掬踘蹴跼茯袱鵩鹆髑槲扑匐簌蔟煜复蝠菔孰塾矗竺曝鞠嗾谡簏国副';
psy_r_2wo = '沃俗玉足曲粟烛属录辱狱绿毒局欲束鹄蜀促触续浴酷躅褥旭欲笃督赎渌纛碡瞩嘱勖溽缛梏';
psy_r_3jue = '觉角桷榷岳乐捉朔卓斫啄琢剥驳雹璞朴壳确浊擢濯渥幄握学龌龊槊搦镯喔邈荦';
psy_r_4zhi = '质日笔出室实疾术一乙壹吉秩率律逸佚失漆栗毕汨恤密蜜桔溢瑟膝匹述黜弼跸七叱卒虱悉戌嫉帅蒺侄踬怵蟋筚篥必泌荜秫栉唧帙溧谧昵轶聿诘耋垤捽茁觱鹬窒苾橘';
psy_r_5wu = '物佛拂屈郁乞掘吃讫绂弗勿迄不怫绋沸茀厥倔黻崛尉蔚契屹熨绂祓';
psy_r_6yue = '月骨发阙越谒没伐罚卒竭窟笏钺歇突忽袜曰汨阀筏鹘纥厥蹶蕨殁橛掘核蝎勃渤悖孛揭碣粤樾鳜脖饽鹁捽猝惚兀讷羯凸咄矻';
psy_r_7he = '曷达末阔钵脱夺褐割沫拔葛闼渴拨豁括抹遏挞跋撮泼秣掇聒獭刺喝磕蘖瘌袜活鸹斡怛钹捋';
psy_r_8xia = '黠拔八察杀刹轧戛瞎刮刷滑辖铩猾捌叭扒札扎帕茁鹘揠萨捺';
psy_r_9xie = '屑节雪绝列烈结穴说血舌洁别缺裂热决铁灭折拙切悦辙诀泄锲咽轶噎彻澈哲鳖设啮劣玦截窃孽浙孑桔颉拮撷揭褐缬碣挈抉亵薛拽爇冽瞥迭跌阅餮耋垤捏页阕觖谲鴂撇蹩篾楔惙辍啜缀撤绁杰桀涅霓蜺批';
psy_r_10yao = '药薄恶作落乐阁鹤爵弱约脚雀幕洛壑索郭错跃若酌托削铎凿箔鹊诺萼橐钥龠瀹着著虐掠获泊搏藿嚼勺谑廓绰霍镬莫箨缚貉各略骆寞膜鄂博昨柝格拓轹铄烁灼疟蒻箬芍躇却噱矍攫醵踱魄酪络烙珞斫膊粕簿柞漠摸酢怍涸郝垩谔鳄噩锷颚缴扩椁陌';
psy_r_11mo = '陌石客白泽伯迹宅拍席策册碧籍格役帛戟璧驿麦额柏魄积脉夕液尺隙逆画百辟赤易革脊翮屐获适索厄隔益窄核舄掷责坼惜癖僻掖腋释译峄择摘弈奕迫疫昔赫瘠谪亦硕貊跖鹡碛蹐只炙踯斥穸鬲骼舶珀吓磔拆喀蚱舴剧檗擘栅啧帻箦扼划蜴辟帼蝈刺嵴汐藉螫蓦摭襞虢哑绎射';
psy_r_12xi = '锡壁历枥击绩绩笛敌滴镝檄激寂觌溺觅狄荻幂戚鹢涤的吃沥雳霹惕汨剔砾翟籴倜析晰淅蜥劈甓嫡轹栎阋菂踢迪皙裼逖蜺阒';
psy_r_13zhi = '职国德食蚀色力翼墨极殛息熄直值得北黑侧贼饰刻则式轼域蜮殖植敕亟棘惑忒默织匿慝亿忆臆薏特勒肋幅仄昃稷识逼克即唧弋拭陟恻测翊洫啬穑鲫抑或匐';
psy_r_14ji = '缉辑戢立集邑急入泣湿习给十拾袭及级涩楫粒汁蛰执笠隰汲吸絷挹浥悒岌熠葺什芨廿揖煜歙笈圾褶翕';
psy_r_15he = '合塔答纳榻閤杂腊匝阖蛤衲沓鸽踏拓拉盍塌咂盒卅搭褡飒磕榼遢蹋蜡溘邋趿';
psy_r_16ye = '叶帖贴牒接猎妾蝶叠箧惬涉鬣捷颊楫聂摄慑镊蹑协侠荚挟铗浃睫厌靥蹀躞燮摺辄婕谍堞霎嗫喋碟鲽捻晔躐笈';
psy_r_17qia = '洽狭峡法甲业邺匣压鸭乏怯劫胁插锸押狎夹恰蛱硖掐剳袷眨胛呷歃闸霎';


# 词林正韵
clzy_p1="东中重从纵供同童僮铜桐峒筒瞳衷忠盅虫冲终忡悰崇嵩崧菘戎绒弓躬宫穹融雄熊穷冯风枫疯丰充隆窿空公功工攻釭蒙蒙朦瞢笼胧栊咙聋珑砻泷蓬篷洪荭红虹鸿丛翁嗡匆葱聪骢通棕烘崆冬咚彤农侬宗淙锺钟龙茏舂松淞冲容榕蓉溶庸佣慵封胸凶匈汹雍邕痈浓脓逢缝峰锋丰蜂烽葑踪茸蛩邛筇跫蚣喁濛倥璁懵";
clzy_z1="偬中重从纵供笼空缝鞚董懂动孔总拢桶捅蓊蠓汞肿踵宠垅陇拥冗冢捧勇甬踊涌俑蛹恐拱竦懵悚耸巩怂奉送梦凤洞众瓮贡弄冻痛栋恸仲粽讽控哄赣宋用颂诵统讼种汹综俸共倥";
clzy_p2="韁怆江缸窗邦双降飏望相长行量藏将创彷强慷丧抢吭傍当撞亢泷庞豇扛杠腔梆桩幢阳扬杨洋羊徉佯芳妨方坊防肪房亡忘忙茫芒妆庄装奘香乡湘厢箱釭镶芗襄骧光昌堂唐糖棠塘章张王常嫦裳凉粮梁粱良霜肠场尝偿床央鸯秧殃郎廊狼榔踉浆疆僵姜缰觞娘黄皇遑惶徨煌仓苍舱沧伤殇商帮汤疮墙樯嫱蔷康囊狂糠冈刚钢纲匡筐荒慌杭航桁翔详祥庠桑彰璋漳獐猖倡凰邙臧赃昂浪阊戕羌枪锵蜣跄篁簧璜潢攘瓤旁孀裆珰铛泱炀蝗隍怏肓汪鞅滂螂缃琅颃桄螳";
clzy_z2="怆讲港项棒蚌耩降飏望相长量藏将创彷强慷丧抢吭傍当撞亢养痒象像橡仰朗桨奖蒋敞氅厂躺枉往颡惘两曩丈杖仗响掌党想鲞榜爽广享向飨幌莽纺网荡壤赏仿罔谠倘魍魉谎蟒漭嗓盎恍沆襁镪肮犷绛巷戆漾上状帐唱让浪酿旷壮放向忘畅葬匠障瘴谤尚涨饷样舫访贶嶂抗桁妄宕怅酱况亮恙谅胀鬯脏砀伉圹纩桄挡旺炕阆防坱晌";
clzy_p3="呢晞摛为骑菲几儡妻衣隋支枝肢迤移罍垂吹陂碑奇宜仪皮槐儿离施知驰池规危夷师姿迟差龟眉悲之芝时诗涯棋旗辞词期祠基疑姬丝司葵医帷思滋持随痴维卮麾墀弥慈遗肌脂雌披嬉尸狸炊湄篱兹疲茨卑亏蕤歧岐谁斯厮澌私窥熙欺疵赀羁彝髭颐资糜饥衰锥姨夔祗伊追缁萁箕治咨尼而推匙陲魑锤缡璃骊羸帔罴糜蘼脾芪畸牺羲曦欹漪猗崎崖萎筛狮蛳鸱绥虽粢瓷椎饴嫠痍惟唯机耆逵岿丕毗枇貔楣霉辎蚩嗤媸埘莳鲥鹚笞漓怡贻禧噫其琪祺麒嶷螭栀鹂累踟琵嵋微薇晖辉徽挥韦围帏违闱霏妃飞非扉肥威祈畿笄机讥玑稀希依归饥矶欷诽绯葳巍沂圻颀齐縻黎犁梨萋凄堤低题提蹄啼鸡稽兮倪霓西栖犀嘶撕梯鼙赍迷泥溪蹊圭闺携畦嵇跻奚脐醯黧蠡醍鹈奎批砒睽荑篦齑藜猊鲵羝灰恢魁隈回徊梅枚玫媒煤雷颓崔催摧堆陪杯醅嵬诙裴培盔偎煨瑰茴追胚徘坯桅傀莓来";
clzy_z3="砌琲珥为骑菲几己儡妻衣殢泗施否遗纸只咫吹积泥是思识说靡彼毁委帔诡溉髓累易敦邃技绮萎觜此泚蕊徙尔弭婢侈弛豕紫旨指视美痞兕姊比水轨止徵市喜已纪跪妓蚁鄙晷子仔梓矢雉死履垒癸趾址以已似耜祀史驶耳使里理李起杞圯士仕俟始齿矣耻麂枳峙鲤迩氏玺巳滓苡倚匕迤逦旖旎舣蚍秕芷拟你企诔捶屣棰揣豸祉恃尾苇鬼岂卉伟斐匪篚娓悱榧韪炜虺玮虮荠礼体米启陛洗邸底抵弟坻柢涕悌澧醴诋眯娣递昵治睨蠡贿悔罪馁每块汇猥璀磊蕾傀腿寘置事地意志泪吏赐自字义利器位戏至次伪寺瑞智记异致备肆翠试类弃饵媚鼻辔坠醉议翅避笥帜炽粹莳谊帅厕寄睡忌贰萃穗二臂嗣遂恣四骥季刺驷寐魅被懿觊冀愧匮恚馈蒉篑柜暨庇豉莉腻秘鸷毖啻示嗜饲伺薏祟值惴屣眦詈企渍譬跛挚燧隧悴尿稚雉莅悸肄泌侍踬未味气贵费沸尉畏慰蔚魏纬胃谓渭卉讳毅既蜚翡诽霁制计势世丽岁济第艺惠慧币弟滞际涕厉契敝弊毙帝蔽髻锐戾裔袂系祭卫隶闭逝缀翳替细桂税婿例誓筮蕙诣砺励瘗噬继脆睿毳曳蒂睇递逮蓟蚋薜荔唳捩粝媲嬖彗睨剂嚏谛缔剃屉悌俪锲贳掣羿棣蟪娣赘憩鳜彘呓谜挤会旆最贝沛霈绘脍荟狈侩桧蜕酹外兑队内辈佩退碎背秽对废悔诲晦昧配妹喙溃吠肺耒块碓刈悖焙淬";
clzy_p4="鱼渔初书舒居裾琚渠蕖誉余舆胥狙锄据疏蔬梳躇虚嘘污铺墟徐猪闾庐驴予诸储除滁蜍如畲淤呕妤苴菹沮徂龉茹榈於祛蘧疽蛆醵纾樗欤虞愚娱隅无芜巫于衢癯瞿氍儒襦濡须需朱珠株诛铢蛛殊俞瑜榆愉逾渝窬谀腴区躯驱岖趋扶符凫芙雏敷麸夫肤纡输枢厨俱驹模谟摹蒲逋胡湖瑚乎壶狐弧孤辜姑觚菰徒途涂荼图屠奴吾梧吴租卢鲈炉芦颅垆蚨孥帑苏酥乌枯粗都茱侏姝禺拘嵎蹰桴俘臾萸吁滹瓠糊醐呼沽酤泸舻轳鸬驽匍葡菟诬呜迂盂竽趺毋孺酴鸪骷刳蛄晡葫呱蝴劬殂猢郛孚";
clzy_z4="屡语圉圄吕侣旅杼伫与仆茹恶誉渚煮疏狙富度暑否鼠汝贾黍杵著处贮莽女许污铺拒炬距所予楚车础阻俎沮叙绪序屿墅巨去苣举讵溆浒钜醑咀诅苎抒楮雨宇舞府鼓虎古股估土吐圃庾户树煦诩努辅组乳弩补鲁橹睹腐数簿竖普侮斧聚午伍釜缕部柱矩武五苦抚浦主杜坞祖愈堵扈父甫禹羽怒腑拊俯罟赌卤姥鹉拄栩窭脯妩庑麈褛篓偻酤牡谱怙肚踽虏孥诂瞽牯祜沪雇仵母某亩蛊琥御去虑署据驭曙助絮箸豫恕遽庶预踞倨蓣淤锯觑翥薯遇路辂赂露鹭渡赋布步固素具务雾鹜附兔故顾句墓慕暮募注住注驻炷祚裕误悟寤戍库护屦诉妒惧趣娶铸绔傅付谕喻妪芋捕哺互孺寓赴冱吐晤煦酤讣赙驸婺锢蛀飓怖塑愫蠹溯镀璐雇瓠迕妇负阜副醋措";
clzy_p5="佳街鞋牌柴钗崖涯偕阶皆谐骸排乖怀淮豺侪埋霾槐斋睚差崽楷秸揩挨俳开哀埃台苔抬该才材财裁栽哉来莱灾猜孩徕骀胎唉垓陔挨皑呆腮";
clzy_z5="蟹解洒拐矮摆买骇海改塞采彩楷在宰醢铠大恺待殆怠乃凯倍蓓迨亥泰太带外盖濑赖籁蔡害蔼艾丐奈柰汰癞霭懈廨邂隘卖派债怪坏诫戒界介芥械薤拜快迈败稗晒瀣湃寨疥届蒯篑蒉喟聩块惫爱代载态菜碍戴贷黛概岱溉慨耐鼐玳再袋逮埭赉赛忾暧咳嗳睐";
clzy_p6="蘋真因茵辛新薪晨辰臣泯论人仁神分亲申裀身汶宾滨槟缤囤邻鳞麟珍尘陈春津秦频苹颦濒银垠筠巾民岷珉贫莼淳醇纯唇伦轮沦抡匀旬巡驯钧均榛遵循甄宸纶椿鹑嶙辚磷呻伸绅寅姻荀询洵峋氤恂嫔彬皴娠闽纫湮肫逡菌臻豳文闻纹蚊云氛纷芬焚坟群裙君军勤斤筋勋薰曛醺芸耘芹欣氲荤汶汾殷雯贲纭昕熏魂浑温孙门尊樽存敦墩炖暾蹲豚村屯盆奔昏痕根恩吞荪扪裈昆鲲坤仑婚阍髡馄喷狲饨臀跟瘟飧怨粼嗔";
clzy_z6="轸敏允引尹尽忍准隼笋泯论闻喷盾菌闵悯分蚓牝拚殒紧汶蠢陨哂诊疹赈肾蜃膑黾泯窘吮缜吻粉蕴愤隐谨近忿刎搵槿瑾恽韫抆混棍阃悃捆衮滚鲧稳本畚笨损忖囤遁很沌恳垦龈震信印进润阵镇刃顺慎鬓晋骏闰峻衅振俊舜赆吝烬讯仞迅汛趁衬仅觐蔺浚赈龀认殡摈缙躏廑谆瞬韧浚殉馑问汶运晕韵训粪忿酝郡紊愠近抆奋郓捃靳恨寸困顿遁钝闷逊嫩溷诨巽褪艮搵";
clzy_p7="漙元原源沅翰鼋园袁猿垣便难看鲜烦蕃卷樊喧冠拚厌萱暄燕冤言钿间轩藩溅叹媛嬛拌援患辕番繁翻幡璠鸳殷鹓蜿湲扁爰汗掀燔圈谖寒韩丹单纶安鞍餐檀坛滩弹残干肝竿阑栏澜兰刊丸完桓纨端湍酸团攒官鸾銮峦欢宽盘蟠漫邯郸摊玕拦珊狻鼾杆跚姗殚箪瘅谰獾倌棺剜潘盘般蹒瘢磐瞒谩馒鳗钻抟邗删潸关弯湾还环鬟寰班斑蛮颜奸攀顽山闲艰悭孱潺擐圜菅般颁鬘疝讪斓娴鹇鳏先前千阡笺天坚肩贤弦烟莲怜连田填巅鬈宣年颠牵妍眠渊涓捐娟边编悬泉迁仙钱煎然延筵毡旃蝉缠廛联篇偏绵全镌穿川缘鸢旋船涎鞭专圆员乾虔愆权拳椽传焉嫣鞯褰搴铅舷跹鹃筌痊诠悛禅婵躔颛燃涟琏翩骈癫阗沿蜒胭芊鳊胼滇佃畋咽湮狷蠲蔫骞膻扇棉拴荃籼砖挛儇璇犍";
clzy_z7="翦撚罥炼阮翰远晚苑返反便难看鲜饭研卷偃蹇琬拚冠沅圈宛婉畹菀钿间念观蜿绻叹挽堰旱暖管琯禅满短传馆缓盥碗懒伞伴卵散弹伴诞罕瀚浣断侃算款但坦袒纂缎拌懑干谰莞潸眼简版板阪盏产限绾柬拣撰馔赧皖汕铲羼楝栈铣善遣浅典转衍犬选冕辇免展茧辨篆勉剪显饯践喘藓软蹇演兖件腆跣缅缱殄扁匾蚬岘畎燹隽键变泫癣阐颤膳鳝舛娩辗脔辫捻愿怨万饭献健建宪劝蔓券远侃键贩畈曼瑗媛瀚岸汉断乱散旦算玩烂贯半案按炭汗赞灌爨窜幔粲灿璨换焕唤涣悍惮段判叛绊鹳伴畔锻腕惋馆旰捍疸但罐盥婉缎缦侃蒜钻谰谏雁患涧宦晏慢盼篆栈惯串绽幻瓣苋办谩铲绾孪篡裥扮霰殿面县变箭战扇煽膳见砚院练链碾燕宴贱馔荐绢彦掾眷倦羡奠遍恋啭眩钏倩卞汴片谴溅饯善转甸电咽茜单眄淀靛佃镟漩拣缮现狷炫绚绽线煎选旋颤擅撰唁谚媛忭弁援";
clzy_p8="蛴巣萧箫貂刁凋姣漂挑泡要料调雕迢条操瞭夭炮挠研髫蜩枭刨了教跳浇聊辽寥撩寮僚尧宵消霄绡号销超朝潮嚣骄娇蕉焦椒饶硝烧遥徭摇谣瑶韶昭招镳瓢苗猫腰桥乔娆妖飘逍潇鸮骁祧鹪鹩缭獠嘹幺邀姚樵谯憔标飚嫖剽佻龆苕岧噍哓跷侥魈峣描钊轺桡铫鹞翘枵侨窑礁肴巢交郊茅嘲钞包胶苞梢庖匏坳敲胞抛蛟崤鵁鞘抄蝥咆哮凹淆跑艄捎爻咬铙茭鲛抓豪劳毫髦绦刀萄猱褒桃糟旄袍稍蒿涛皋陶鳌曹遭羔糕高搔毛艘滔骚韬缫膏牢醪逃濠壕饕洮淘叨啕篙熬遨翱嗷臊嗥尻鏖螯獒敖牦漕嘈槽掏唠涝捞痨芼";
clzy_z8="筱小表鸟晓少姣漂挑泡要调扰绕绍杪瞭夭炮挠沼眇矫皎刨了教杳钞窈窕袅铫敲劳缭掉肇缥獠缈渺淼茑赵兆缴悄舀侥蓼娆硗剿晁藐秒殍巧饱卯狡爪鲍搅绞拗咬炒吵佼昴茆皓宝藻早枣老好道稻造脑恼岛倒祷捣抱讨考燥扫嫂保鸨稿草昊浩镐杲缟槁堡皂瑙媪燠袄懊葆褓芼澡套涝蚤拷栲啸笑照庙窍妙诏召邵曜耀钓吊叫眺诮料疗潦峤徼跳嘹镣廖尿肖峭哨俏醮燎鹩鹞轿骠票效貌校孝闹豹罩棹较窖爆稍拗淖号帽报导盗噪灶奥告诰到蹈傲暴躁冒悼倒燥犒靠懊瑁燠耄糙套潦耗";
clzy_p9="它她歌多罗河戈阿波科柯陀娥蛾鹅萝何螺禾珂蓑婆坡呵哥轲沱鼍拖驼跎和佗磨他峨俄摩么娑莎迦疴苛蹉嵯驮箩逻锣哪挪锅诃窠蝌髁倭涡窝讹陂鄱皤魔梭唆骡挼靴瘸搓哦瘥酡";
clzy_z9="涴亸哿火舸舵我躲拖娜荷可合左果裹朵锁琐堕惰妥坐裸跛夥大颗祸桠婀逻卵那坷簸叵垛哆娑硪个贺佐饿座和挫课唾播破卧货簸驮磋作做剁廓磨懦糯缚锉挼";
clzy_p10="佳娲蜗蛙娃哇麻花霞家茶华沙牙涯蛇瓜斜邪芽车差嘉瑕纱鸦遮叉奢巴咱耶嗟遐加笳赊槎蟆骅虾葭袈裟砂衙呀琶耙芭杷笆疤爬葩佘鲨查茬楂渣爹挝咤拿椰珈跏枷迦痂茄桠丫哑划哗夸胯抓洼呱";
clzy_z10="马灺下者野雅瓦寡傻社写泻夏也把厦贾惹冶假且玛姐舍喏赭洒嘏剐打耍那卦挂祃驾夜谢榭罢霸暇灞嫁赦蔗化价射骂稼架诈亚麝怕借卸帕坝靶鹧贳炙嗄乍咤诧罅吓娅哑讶迓桦话跨衩柘";
clzy_p11="汀庚羹盲觥彭亨英烹平行评凭拼枰京惊荆明盟鸣荣兵听兄醒卿生更甥笙牲擎鲸迎衡耕徵萌甍宏闳茎罂莺樱泓橙争筝清情晴精睛菁晶旌盈楹瀛嬴赢营婴缨贞成城诚呈程酲声征轻名倾萦琼峥嵘撑粳坑铿撄鹦黥蘅澎膨棚浜坪苹钲伧檠嘤轰嬛铮狰宁狞瞪绷怦璎砰氓鲭侦柽蛏茔茕赓黉瞠青经泾形陉亭庭廷霆蜓停丁仃馨星腥惺俜灵龄玲铃伶零冥溟铭瓶屏萍荧萤荣扃蜻硎苓聆瓴翎娉婷宁瞑螟猩疔叮厅町泠棂囹羚蛉咛型邢蒸烝承丞惩澄陵凌绫菱冰膺鹰蝇绳升垧缯仍兢矜征登灯僧憎增曾层能朋鹏弘肱薨腾藤恒罾崩滕誊崚嶒姮塍冯症簦瞢凝棱楞";
clzy_z11="梗影景井岭领境警请饼凭行永骋逞颖颍顷整静省幸颈郢醒猛丙更炳杏秉耿矿冷靖哽绠荇艋蜢皿儆悻婧阱靓打瘿犷眚憬鲠迥炯茗挺艇梃酩酊等鼎顶肯拯謦刭敬命证性政镜圣咏姓庆映病柄劲竞靓净竟孟诤聘硬炳泳迸摒阱檠迎郑獍径定听罄磬赠佞邓证秤孕剩迳甑宁胫订饤锭謦泞瞪蹭蹬亘镫滢凳磴泾";
clzy_p12="忧毬蝤尤邮优尤流旒留骝榴刘由油游猷悠攸牛修羞秋周州洲舟酬雠柔逑俦畴筹稠丘邱抽瘳遒呕收鸠搜驺愁休囚求裘仇浮谋牟眸侔矛侯喉猴讴鸥楼陬偷头投钩沟幽纠啾楸蚯踌绸惆勾娄琉疣犹邹兜呦咻貅球蜉蝣辀帱阄瘤硫浏庥湫泅酋瓯啁飕鍪篌抠篝诌骰偻蝼髅搂欧彪掊虬抔不瓿缪鞦";
clzy_z12="甃媾有酒首口否後柳友斗狗久厚手富叟守右受牖读偶走九后咎薮吼副帚垢舅纽藕朽臼肘韭剖诱仆缶酉苟丑糗扣叩某莠寿绶玖授溲纣钮扭呕殴纠耦掊瓿拇姆擞绺抖陡蚪篓黝赳宥候就售寿秀绣宿奏兽漏陋狩昼寇茂旧胄宙袖岫柚覆救厩臭佑右囿豆饾窦瘦漱咒究疚谬皱逅嗅遘溜镂逗透骤复又侑幼堠锈鹫绉咮灸籀酎诟蔻僦构扣购彀戊懋贸袤嗽凑鼬";
clzy_p13="沉侵寻任禁沈占浔临林霖针箴斟心簪深琴禽擒衾钦吟淫今襟衿金音阴岑壬歆森祲喑琛涔骎忱淋妊掺参椹郴芩檎琳愔喑黔嵚砧";
clzy_z13="寝饮锦任禁沈占品枕审甚廪衽稔凛懔朕荏婶葚禀噤谂怎恁饪覃沁荫浸谮谶噤甚鸩赁喑渗窨妊";
clzy_p14="覃潭参骖忺颔嵌南楠男谙庵含涵函岚蚕探贪耽眈龛堪谈甘三酣柑惭蓝担簪谭昙坛婪戡痰篮褴蚶憨泔聃邯蟫盐檐廉帘嫌严髯谦奁纤恹签瞻蟾炎添兼缣沾尖潜阎镰黏淹钳甜恬拈砭詹蒹歼黔钤佥觇崦渐鹣腌毵襜阉咸缄岩谗衔帆衫杉监凡馋芟搀喃掺巉";
clzy_z14="感紞览揽胆颔嵌澹啖坎惨探敢撼毯糁湛菡萏罱椠喊橄榄俭焰敛险检脸三染渐掩点簟贬冉苒陕谄俨闪剡忝琰奄歉芡崭堑罨捡崦玷槛范减舰犯湛斩黯范勘暗滥啖担憾暂绀憨澹瞰淡缆艳剑念验堑赡店敛厌焰垫欠僭酽潋滟俺砭坫陷鉴泛梵忏赚蘸站馅";
clzy_r15="簇屋木竹目服福禄谷熟菽肉族鹿漉腹菊陆轴逐苜蓿宿牧伏夙蔌读犊渎牍椟黩毂复粥肃碌鬻育国六缩哭幅斛戮仆畜蓄叔淑倏独卜馥沐速祝麓辘镞蹙筑穆睦秃覆辐瀑郁舳掬踘蹴茯袱鹆髑槲扑匐簌蔟煜蝠菔孰塾矗竺曝鞠嗾谡簏副沃俗玉足曲粟烛属录辱狱绿毒局欲束鹄蜀促触续浴酷躅褥旭欲笃督赎渌纛碡北瞩嘱勖溽缛梏醁";
clzy_r16="觉角桷榷岳乐捉朔数卓啄琢剥驳雹璞朴壳确浊擢濯渥幄握学龌龊槊搦镯喔邈荦药薄恶作落阁鹤爵弱约脚雀幕洛壑索郭错跃若酌托削铎凿箔鹊诺萼度橐钥龠瀹着著虐掠获泊搏藿嚼勺谑廓绰霍镬莫箨缚貉各略骆寞膜鄂博昨柝格拓轹铄烁灼疟蒻箬芍躇却噱矍攫醵踱魄酪络烙珞膊粕簿柞漠摸酢怍涸郝垩谔鳄噩锷颚缴扩椁陌";
clzy_r17="拍质日笔出室实疾术一乙壹吉橘秩率律逸易积识佚失漆栗毕恤密蜜桔溢瑟膝匹述黜弼跸七叱卒虱悉戌嫉帅蒺侄踬怵蟋筚篥必泌荜秫栉唧帙溧谧昵轶聿诘耋垤捽茁鹬窒苾陌石客白泽伯迹宅席策册碧籍格役帛戟璧驿麦额柏魄脉夕液尺隙逆画百辟赤革脊翮屐获适索厄隔益窄核舄掷责坼惜癖僻掖腋释译峄择摘弈奕迫疫昔赫瘠谪亦硕貊跖碛只炙踯斥穸鬲骼舶珀吓磔拆喀蚱舴剧檗擘栅啧帻箦扼划蜴辟帼蝈刺嵴汐藉螫蓦摭襞虢哑绎射锡壁历枥击绩绩笛敌滴镝檄激寂觌溺觅狄荻幂戚涤的吃沥雳霹惕剔砾翟籴倜析晰淅蜥劈甓嫡轹栎阋菂踢迪皙裼逖蜺阒汨职国德食蚀色力翼墨极殛息熄直值得北黑侧贼饰刻则塞式轼域蜮殖植敕亟棘惑忒默织匿慝亿忆臆薏特勒幅仄昃稷逼克即唧弋拭陟恻测翊洫啬穑鲫抑或匐缉辑戢立集邑急入泣湿习给十拾袭及级涩楫粒汁蛰执笠隰汲吸絷挹浥悒岌熠葺什芨廿揖煜歙笈圾褶翕";
clzy_r18="窣鹖物佛拂屈郁乞掘吃讫绂弗勿迄不怫绋沸茀厥倔黻崛尉蔚契纥屹熨绂月惙骨发阙越谒没伐罚卒竭窟笏钺歇突忽袜曰阀筏鹘蹶蕨殁橛核蝎勃渤悖孛揭碣粤樾鳜脖饽鹁捽猝惚兀讷呐羯凸咄曷达末阔钵脱夺褐割沫拔葛闼渴拨豁括抹遏挞跋撮泼秣掇聒獭刺喝磕蘖瘌袜活鸹斡怛钹捋黠拔八察杀刹轧戛瞎刮刷滑辖铩猾捌叭札扎帕茁鹘揠萨捺屑节雪绝列烈结穴说血舌洁别缺裂热决铁灭折拙切悦辙诀泄锲咽轶噎彻澈哲鳖设啮劣玦截窃孽浙孑桔颉拮撷揭褐缬碣挈抉亵薛拽爇冽瞥迭跌阅餮耋垤捏页阕觖谲鴂撇蹩篾楔辍啜缀撤绁杰桀涅霓蜺批叶帖贴牒接猎妾蝶叠箧惬涉鬣捷颊楫聂摄慑镊蹑协侠荚挟铗浃睫厌靥蹀躞燮摺辄婕谍堞霎嗫喋碟鲽捻晔躐笈靼";
clzy_r19="合塔答纳榻閤杂腊匝阖蛤衲沓鸽踏拓拉盍塌咂盒卅搭褡飒磕榼遢蹋蜡溘邋趿洽狭峡法甲业邺匣压鸭乏怯劫胁插锸押狎夹恰蛱硖掐札袷眨胛呷歃闸霎";


# 中华新韵
zhxy_p1="啊腌扒叭巴吧芭岜疤笆粑豝嚓跨叉杈差咖瓜抓胍榻喇哈阿花哗加茄迦痂枷耞珈袈嘉佳家傢葭豭咖夸姱啦妈摩嬷趴凹咱葩杉沙莎痧鲨纱砂他她它哇洼蛙娲虾丫呀鸦哑桠查楂喳呱欻旮笳拉垃吗蚂仨裟砂趿渣揸馇挝阿八捌擦插锸耷哒嗒鎝褡发筏夹嘎刮栝鸹拉邋抹掐袷葜撒杀刹铩煞刷趿塌溻禢踏挖呷瞎鸭压押扎匝咂拶吒哳浃撒答啊茶查搽嵖猹槎楂碴苴垞蛤华哗骅铧麻嘛蟆拿扒杷爬钯耙筢琶娃霞遐瑕暇牙伢芽岈玡蚜崖涯睚衙拔茇菝跋魃察茬檫达鞑沓怛妲笪靼答跶乏伐茷垡砝阀罚嘎滑划猾夹浃郏荚铗蛱恝戛颊旯拉匣狎挟柙侠峡狭硖辖黠杂砸扎札轧闸铡喋剳";
zhxy_z1="把靶礤叉衩蹅镲打剐寡哈贾跨假瘕卡佧咔咯侉喇俩马吗玛码蚂哪卡洒傻耍瓦佤哑扠雅砟咋诈鲊爪法甲钾岬胛撒靸塔獭鳎眨坝把弝爸耙罢霸灞汊衩岔杈侘鲅诧差姹大尬卦诖挂絓褂罣化划华画话桦价驾髂架假嫁稼挎胯落跨蚂祃骂那娜怕下夏嗄厦罅暇亚讶迓娅咤乍蚱痄氩挜炸榨瓦砑刹发珐划剌腊蜡瘌辣镴呐纳肭衲钠捺帕恰洽袷卅飒萨唼歃煞箑霎拓沓跶挞闼嗒遢榻鳎漯踏鞳蹋袜腽吓轧揠栅";
zhxy_p2="波播菠玻嶓搓磋蹉瑳多哆呙锅卜埚涡坡颇摸阿陂莎唆娑梭挲疙睃圪嗦嗍鲅蓑拖莴倭唷涡窝蜗踒阿婀痾哥歌戈呵科蝌柯疴苛珂窠轲颗屙菏棵髁的了么呢车奢赊畲遮仡猞拨鱿趵钵饽剥逴踔戳撮咄剟掇裰郭崞聒蝈豁劐擢捋泊泼钹说缩托脱喔拙捉苛桌倬涿焯作嘬鸽割搁喝磕瞌榼脖嵯痤瘥鹾罗萝啰逻脶猡锣椤箩骡螺谟馍馍摹模麽摩磨嬷蘑磨魔挪娜傩婆鄱繁皤驮佗陀坨驼柁砣鸵酡跎蛇鼍鹅蛾娥莪俄峨哦讹和禾何河荷阇膜婆皤沱渮哪挼孛荸伯驳帛瓝泊柏勃钹铂舶博鹁浡渤搏箔膊踣薄馞欂襮礴夺度铎踱怫佛掇咄裰剟国掴帼漍腘虢馘活嗑橐灼彴茁踔卓斫浊酌浞诼着啄琢椓蠋擢濯镯昨作笮阁葛蛤颌合涸盒膜拙棁捽貉曷盍阖壳德得额鹖则舴晢蜇革格鬲隔嗝槅膈滆塥鎘骼纥劾阂核翮壳咳颏舌则责择咋泽啧帻舴箦赜折哲辄蛰谪摺磔辙翟";
zhxy_z2="跛簸脞朵垛躲亸果菒蜾裹火伙夥裸瘰叵笸所唢锁琐妥椭我左佐坷可砢舸蓏扯恶惹舍者褶赭哿岢喏椁抹索撮葛渴庹薄簸播措错剉厝挫锉堕剁舵惰跺垛过货祸和磨蓦懦糯破偌唾卧涴硪坐座阼怍柞胙做酢祚饿哦个贺荷课驮社舍射赦麝这柘蔗鹧箇锞厍檗擘错娖啜惙婼婥绰辍龊歠或获惑霍豁嚄雘镬藿蠖矱謋扩括栝适蛞筈阔廓鞟落泺荦抹蓦嚜怍酢柞洛骆络珞硌跞雒漯末没殁沫陌脉莫眜秣貊漠寞靺貘墨镆瘼默纆茉诺搦朴迫珀粕魄弱若箬蒻爇偌妁烁铄朔硕蒴搠槊蟀拓柝萚箨跅沃偓握幄渥斡龌作恶垩鄂谔萼遏崿愕腭鍔噩鳄各喝壑鹤溘嗑属乐虼熇赫策册测侧厕恻彻坼掣撤澈厄頞扼呃轭恶虼赫吓客刻克可缂勒泐讷热色瑟塞涩穑设涉摄慑特慝忒忑螣仄昃浙跖侧埒褐榼唶这啬崱";
zhxy_p3="爹阶皆喈嗟街湝乜咩些靴耶倻椰偕掖瘪憋鳖跌颏疙节截疖角圪结接秸揭噘撅捏撇瞥切缺阙贴得怗贴帖楔歇蝎削薛噎曰约瘸斜邪偕谐鞋携爷耶茄伽鲑踅椰别蹩迭垤昳絰瓞谍堞耋揲喋牒叠碟蝶艓蹀孑节讦劫劼杰诘拮洁结桔桀捷偈玦觉决绝倔桷掘崛脚觖厥劂谲獗蕨橛噱爵蹶矍嚼爝攫钁协胁挟絜颉撷勰襭穴学噱";
zhxy_z3="瘪姐解咧且写也冶野苤噘咧撇血雪铁帖界介届戒诫芥疥借卸藉解械谢榭灺薤獬邂澥瀣曳夜蚧趄蟹懈炧倔列劣冽埒捩烈鬣裂猎䴕趔躐略掠灭叶蔑蠛陧聂臬涅啮嗫嵲镊颞蹑蘖孽糵虐疟切妾怯窃挈惬慊朅锲箧却悫雀确阕鹊阙榷餮帖泄泻绁屑亵渫燮媟契躞血谑咽晔烨掖曳邺液谒腋饁靥业页月乐刖軏抈玥岳栎钥钺阅悦跃越粤龠瀹爚樾";
zhxy_p4="开哎哀埃挨娭唉欸掰偲钗差揣呆该陔垓荄赅乖揩腮毸鳃筛酾衰摔苔台胎歪灾哉栽甾斋拍摘拆塞猜挨皑癌才财材裁侪柴豺还孩骸徊怀淮槐踝来莱崃徕涞埋霾俳排徘牌簰邰苔抬骀炱鲐白宅翟";
zhxy_z4="嗳矮蔼霭捭摆采彩睬踩揣逮歹傣改海醢剀凯垲闿恺铠慨楷锴蒯买乃艿奶氖迺甩崴载宰仔崽拐窄百柏伯佰艾爱僾隘碍嗳嗌瑷叆暧败拜稗呗菜蔡縩虿瘥踹膪嘬大代岱迨绐骀玳带殆贷待怠埭袋逮叇戴黛丐芥钙盖溉概欬怪亥骇害坏忾会块快侩郐哙狯浍脍筷鲙徕睐赖濑癞籁劢迈卖奈柰萘耐鼐褦派湃塞赛晒帅率太汰态泰钛外再在载债砦寨瘵拽麦脉塞";
zhxy_p5="微欸陂杯卑背悲碑鹎衰崔催摧縗吹榱炊堆飞妃非菲啡騑绯馡蜚扉霏鲱归圭龟妫规邽扳闺硅黑嘿傀瘣瑰鲑灰诙虺挥咴恢袆珲豗晖辉翬麾徽亏刲岿勒悝盔窥胚呸绥衃醅虽荽睢濉忒推危威逶偎隈葳椳煨溦巍蝛薇追骓锥椎欸垂陲捶椎槌棰倕锤箽肥淝腓回茴洄蛔奎逵馗隗葵揆骙暌魁戣睽蝰累雷嫘缧擂檑礌镭羸罍虆玫枚眉莓脢梅嵋猸湄邳媒楣煤酶镅霉糜陪培赔没裵蕤绥隋随遂谁颓韦为圩贼违围帏沩桅唯帷惟薇维嵬巍潍闱";
zhxy_z5="北欸璀匪悱棐菲诽榧斐篚翡给轨匦氿宄庋佹垝诡鬼姽癸晷悔虺毁傀跬累耒诔垒磊蕾儡藟癗美镁每浼馁蕊水髓腿伟纬苇玮炜洧韪尾娓委诿萎痿痏猥嘴北欸贝狈钡邶琲备背褙被辈孛悖倍焙蓓惫煹鞁鞴碚褙鐾臂萃脺啐淬綷悴瘁粹翠脆毳对怼憝碓兑队芾肺费沸狒痱废吠柜刽桧刿贵桂跪鳜会惠哕秽诲晦慧蟪彗篲噦靧卉汇蕙阓讳恚贿喙烩绘荟浍桧嘒匮蒉喟馈溃愦愧聩泪类累颣肋酹擂妹昧寐魅痗袂媚内沛霈旆帔佩配辔芮枘锐瑞睿蚋睡税说帨岁祟谇繐遂碎睟隧燧穗邃退侻蜕未味胃谓猥畏喂渭尉蔚慰卫位遗魏为坠缀惴缒赘醊最罪醉蕞晬槜";
zhxy_p6="凹熬包薄苞胞孢剥龅煲褒标飚彪骠镖瘭飙操糙藨镳瀌膘杓猋骉摽操抄怊钞超剿潦刀叨忉刁汈蛁雕貂叼碉凋鲷高皋羔槔睾膏篙糕蒿薅嚆交骄艽郊茭浇娇姣胶椒蛟焦蕉教跤僬鲛嶕礁噍鹪轇尻捞撩猫喵孬抛脬泡漂剽慓飘缥螵僄悄磽磽锹劁敲橇缲搔骚挑缫臊捎烧梢稍筲艄蛸叨涛绦掏滔韬弢饕慆佻祧肖枭枵哓骁嘐逍虓鸮消宵绡萧硝销削蠨蛸翛箫潇霄魈歊嚣幺约夭吆妖要喓腰邀遭糟钊招昭嘲啁着朝约剥削豪敖璈遨嗷廒獒熬隞嶅聱翱鳌鏖螯骜薄雹曹槽螬漕嘈晃巢朝嘲潮捡捯号嗥毫壕濠嚎蠔嚼劳崂痨牢捞唠醪聊辽疗僚漻寥嘹獠寮缭嫽燎憭髎毛矛茅牦旄酕锚髦蝥蟊苗描瞄饶挠饶蛲猱呶刨咆狍庖炮袍匏嫖朴瓢薸乔侨荞峤桥硚翘谯荍鞽憔樵瞧荛桡蛲饶娆桡蛲饶娆苕韶勺芍咷梼逃洮桃陶萄梼啕淘綯醄鼗条岹苕调笤齠蜩迢髫岧鲦崤淆洨爻尧肴淆轺峣陶姚窑谣摇徭遥猺瑶飖鳐轺凿着";
zhxy_z6="袄媪拗饱宝保鸨葆堡褓表俵婊裱草懆巘吵炒导岛捣倒祷蹈搞缟槁暠镐稿藁好郝侥佼挢狡饺绞铰湫皎搅角脚剿儌徼缴考拷栲烤老佬姥栲潦了蓼憭卯峁泖昴铆邈眇秒矫杪淼渺缈藐舀恼脑瑙鸟茑嬲袅跑殍漂摽缥瞟巧悄愀扰绕娆扫嫂少讨挑窕黊小晓筱杳舀咬窈早枣蚤澡璪藻爪找沼邈岙坳燠拗奡傲奥慠澳懊骜鏊报刨抱趵豹鲍暴瀑曝爆鳔操猋耖到悼帱倒盗帱道稻吊铞钓窎调掉铫窎藋告诰好号昊耗浩滈淏皓镐皞颢灏叫峤觉校轿教酵噍挢噭徼蕌铐犒靠涝唠络酪落烙耢嫪尥料撂廖狊钌镣茂冒贸耄袤帽帽媢瑁貌瞀懋妙庙缪闹淖尿溺泡爆炮疱票傈漂骠俏诮峭窍翘撬鞘绕扫臊埽瘙少邵劭绍哨潲稍套跳眺朓粜孝哮肖笑效校啸药要鹞钥瀹靿曜耀皂灶造慥糙噪簉燥唣躁召兆诏笊赵棹旐照罩召肇曌";
zhxy_p7="抽掐紬瘳丢都兜蔸勾佝沟枸钩缑篝巘鞲齁勼纠鸠究赳阄湫揪啾蝤轇芤抠眍溜熘搂喽哞妞区讴沤瓯欧殴呕鸥丘邱龟秋蚯湫楸鹙鳅鞦收搜嗖锼馊廋溲飕艘偷修脩休咻羞鸺貅馐髹优攸忧悠呦幽麀舟州谄侜周洲粥啁赒輈诪邹郰緅驺诹陬鲰粥儔帱畴筹酬俦踌惆绸稠禂仇愁雠侯喉猴篌瘊糇流留榴骝刘浏瘤琉硫旒鹠遛镏飗瘤鎏娄楼偻蒌喽耧蝼髅牟眸谋蛑缪鍪牛抔掊裒囚仇犰求毬虬泅俅璆酋逑球遒赇裘璆蝤柔揉糅煣蹂鞣头投骰尤犹疣鱿莸铀由邮油游猷繇蝣妯轴";
zhxy_z7="丑瞅斗抖蚪陡枓否缶苟岣狗枸吼笱犼九久玖韭灸酒漫讪口柳绺搂嵝篓某纽钮扭忸杻狃偶呕藕掊糗手首守叟瞍薮擞嗾朽宿友有酉卣莠牖黝羑帚肘走臭凑辏腠豆逗痘窦斗脰垢构购勾诟够媾逅后候厚堠臼桕舅就僦鹫疚旧咎救厩柩叩扣筘寇蔻溜馏遛陋镂瘘漏谬缪拗耨沤怄受授寿狩售绶瘦擞嗽透秀绣锈岫袖臭嗅溴又右幼有佑侑柚囿宥诱釉蚴鼬咒纣宙绉胄昼皱甃骤籀酎奏揍肉兽六";
zhxy_p8="安氨唵桉庵谙鹌鞍盦扳班颁斑攽般搬瘢皤癍参骖餐觇搀幨襜川穿氽撺镩丹担单眈酖耽郸聃禅儋殚箪端帆番蕃幡藩翻干甘杆玕肝柑竿疳尴关观纶官冠矜倌棺瘝鳏顸酣憨鼾欢讙獾驩刊看勘龛堪戡宽髋颟囡番潘攀三叁山芟杉删衫姗珊栅舢扇跚煽潸膻闩拴栓酸坍贪摊滩瘫湍弯剜湾蜿豌糌簪占沾毡旃粘詹谵邅瞻专砖颛钻躜边砭萹笾编煸蝙鯿箯鞭参骖餐掂傎癫滇颠巅戋尖奸歼坚间肩艰监兼菅笺渐犍湔缄蒹煎缣鹣搛熸鞬鳒韉捐涓娟朘圈鹃镌蠲拈蔫片扁偏篇犏翩千仟阡芊扦迁佥钎牵铅悭谦签愆鹐骞搴磏諐褰圈悛棬弮天添黇仙先纤氙忺籼掀铦酰跹锨鲜暹骞轩宣谖萱揎喧瑄煖禤暄儇懁咽恹殷胭烟焉崦阉阏奄淹腌湮鄢嫣燕鸢眢鸳冤渊鹓箢寒残蚕惭单鋋馋谗婵禅孱缠蝉廛僝潺澶镡蟾镵巉躔传船遄椽攒凡矾烦墦蕃攀樊璠燔繁蘩邗汗邯含函琀焓晗涵韩还环桓圜阛寰缳鬟郇荁洹貆澴轘兰岚斓拦栏婪阑蓝谰澜褴篮斕镧峦娈孪挛鸾脔滦銮蛮谩蔓馒瞒鞔鳗鬘男南难喃楠爿胖般盘磻磐蹒蟠蚺然燃髯坛昙倓郯谈弹覃谭痰潭檀团漙抟咱丸纨完玩顽刓汍烷奁连镰怜帘莲涟联裢鲢廉濂鐮鬑磏眠绵棉年粘黏鲇便骈胼蹁钤前虔钱钳乾掮潜黔犍权全佺诠荃泉辁拳铨痊惓筌蜷醛鳈鬈颧田佃畋恬钿甜湉填阗闲贤弦咸挦涎娴衔舷痫鹇嫌玄悬旋漩璇延蜒严言芫妍岩炎沿铅研盐阎筵颜檐元园员沅垣湲袁原圆鼋援媛缘猿塬嫄源羱辕橼";
zhxy_z8="俺铵唵埯揞坂板版钣蝂舨惨黪纛产刬浐啴谄铲阐舛喘胆亶疸掸短反返杆秆赶敢感橄擀澉鳡莞馆琯筦管罕喊缓坎侃砍欿莰槛顑款窾览揽缆榄罱漤壈懒卵满螨赧腩蝻暖冉苒染阮软朊伞散糁馓闪陕掺忐坦钽袒毯疃宛莞挽娩菀晚脘惋婉绾琬皖碗拶昝噆攒趲斩飐盏展崭展转纂贬窆扁匾藊碥褊典点碘踮拣茧柬俭检捡笕研减剪睑锏简趼谫戬碱翦蹇謇卷锩琏敛脸免丐免沔黾勉娩冕偭渑湎缅靦腼捻辇碾撵浅遣谴缱犬畎绻忝殄淟餂觍腆舔显险蚬崄毨猃筅跣铣鲜藓燹选晅烜癣奄兖俨衍弇掩剡黡郾蝘縯眼琰演魇偃鼹远犴岸按胺案韂暗黯办半扮伴拌绊湴瓣灿璨掺粲孱忏颤串钏窜簒爨石旦担但诞萏啖淡惮弹氮蛋髧贉禫澹段断塅缎椴煅碫锻簖犯饭范贩梵泛畈干旰绀淦骭赣惯观贯冠掼涫祼盥灌瓘鹳罐汉扞汗旱垾捍菡颔翰撼憾悍焊瀚幻换奂宦涣唤浣患焕痪豢擐轘漶睆看崁嵌墈阚瞰烂滥曼谩蔓幔墁漫慢嫚缦熳镘乱难判拚泮盼叛畔袢鋬散讪汕苫钐疝单赸剡掸扇掞善禅骟鄯墡缮擅膳嬗赡蟮鳝涮蒜算叹炭探碳彖万忨腕蔓馔暂錾赞占栈战站绽湛颤蘸传钻转啭赚撰篆馔攥卞弁昪抃汴忭苄变便遍辨辩辫缏电佃甸阽店玷垫钿淀惦奠殿靛簟癜见件间饯建荐健牮贱剑涧监舰渐楗瞷谏践锏毽腱溅鉴键槛僭箭卷隽倦狷绢桊鄄圈眷罥练炼恋殓链楝潋面眄廿念埝片骗欠纤綪椠芡茜倩堑嵌慊歉劝券掭县岘现宪苋限线陷馅羡線献腺霰券泫昡炫绚眩旋渲楦碹厌砚咽彥艳晏唁宴验谚堰雁焰焱滟酽餍鷃谳燕赝嬿苑怨院垸媛椽瑗愿";
zhxy_p9="奔贲锛玢宾彬傧斌滨缤槟濒豳参抻郴伧琛嗔汶瞋春椿蝽村皴踆惇吨墩礅敦蹲恩分芬吩纷玢菌氛棻雰根跟昏阍惛婚巾斤今紷金津衿矜筋禁襟军均龟君钧皲坤昆崑裈堃焜琨髡鹍锟鲲抡拎闷喷拼姘钦侵亲衾駸嵚囷逡森申伸身呻砷侁诜参绅珅莘娠深糁燊孙荪狲飧吞暾温瘟心芯骎辛忻昕欣炘锌新歆薪馨鑫勋埙熏薰薫獯曛醺窨因阴茵洇裀荫音姻氤殷堙喑闉愔禋晕缊氲煴赟贞针侦浈珍帧胗真桢砧祯蓁斟甄獉溱榛箴臻迍肫窀谆尊遵樽鳟岑涔臣尘辰沉忱陈宸晨谌纯莼唇淳鹑漘醇存蹲坟汾棼焚濆痕贲贲浑珲馄混哏魂邻林临淋琳粼磷潾嶙遴霖辚瞵鳞麟仑伦论抡沦纶轮门扪们民忞旻岷缗您盆湓贫频嫔颦芹芩矜秦琴覃禽勤懃擒噙螓裙群人壬仁仍任神什屯囤饨豚臀文纹炆闻蚊雯旬郇寻巡询洵荀荨峋恂鲟循吟垠龈狺訚崟银荧淫寅蟫鄞夤嚚霪云匀芸员沄纭昀畇筠耘筼麇";
zhxy_z9="本苯畚碜踸蠢刌忖爹盹峨轲髁趸粉衮绲么滚磙鲧很狠仅吨尽卺紧堇锦谨馑瑾槿肯垦恳啃捆阃悃凛廩懔檀皿闵抿黾泯闽悯敏湣愍品榀锓寝忍荏稔损笋隼榫沈审婶哂矧吮刎抆吻紊稳尹引饮蚓殷隐瘾允陨殒怎诊枕轸轸疹袗缜准墩撙奔坋笨倴摈殡鬓膑摁衬疢龀称趁榇讥寸囤沌钝炖盾顿遁分份奋愤忿偾粪瀵亘艮棍恨诨圂混溷慁仅溷妗尽进近劲荩晋赆烬浸琎唫祲靳禁缙觐殣噤俊菌郡峻馂浚骏焌竣裉困吝赁淋蔺躏闷焖懑恁嫩论喷牝聘吣沁亲刃认仞任纫韧饪妊纴褈润闰肾甚渗椹葚蜃慎顺舜瞬问汶璺揾囟信衅训迅汛讯驯徇逊殉浚巽蕈噀印饮荫胤窨孕运郓晕酝慍缊韫韵蕴熨谮圳阵鸩振朕赈揕震镇";
zhxy_p10="肮邦帮梆浜仓苍沧鸧舱昌倡菖猖阊娼伥创疮窗胯当珰铛裆筜方坊芳枋邡钫冈岗刚矼肛纲钢缸釭罡堽光咣桃胱夯荒肓塃慌江将姜豇浆僵螀缰疆康慷糠囊匡劻诓恇筐牤乓雱滂膀枪锵羌戗戕将腔蜣铰镪嚷丧桑伤汤殇商觞墒熵双泷霜孀孀骦鹴汤铴耥嘡镗蹚汪乡芗相香厢湘缃箱襄骧镶秧央湍殃鸯鞅赃脏臧张章獐彰嫜璋樟蟑妆庄桩装卬昂藏长场苌肠尝常偿徜裳嫦床幢防妨坊忍肪鲂房行吭迒杭絎航颃皇黄凰隍喤煌遑徨湟惶粕锽潢璜蝗篁磺蟥簧鳇扛狂诳鵟郞狼郎琅榔桹琅廊嫏樃硠锒稂鎯螂良俍莨凉梁椋量粮粱邙芒忙杧盲氓茫硭铓牻嚢馕娘彷庞逄旁蒡膀磅螃强墙蔷嫱樯蘘灢禳瓤唐堂棠塘搪糖溏瑭樘膛赯螗螳鄌亡王详降绛庠祥翔扬阳羊玚飏炀杨旸佯疡徉洋";
zhxy_z10="绑榜膀厂场昶惝敞鼈闯倡挡党谠仿访彷纺昉舫岗港画广犷怳恍晃谎幌讲奖桨浆蒋耩膙良两俩籍魉莽蟒漭曩攮抢强镪襁壤攘嚷嗓搡磉颡垧晌赏爽塽帑倘淌惝傥躺朗网枉罔往惘魍享响饷飨想鲞仰养氧痒驵长涨掌奘盎蚌棒傍谤蒡搒镑磅稖怅畅唱创怆当宕荡垱挡砀档菪放杠筻戆逛沆巷晃滉榥匠降将学张弶强酱犟糨亢伉抗闶炕圹纩旷况邝矿贶框眶浪莨阆凉悢谅亮辆靓量晾喨踉攮酿胖呛戗籽跄让瀼丧上尚绱烫趟忘妄望量向项巷相象像橡怏样恙烊漾脏奘葬藏丈仗杖账帐涨胀障幛嶂瘴壮状僮撞幢";
zhxy_p11="庚更横盛正应乘胜兴行莹茔凭暝钉称令并伻崩听祊绷嘣冰兵槟屏柽琤称蛏铛赪撑噌瞠灯登噔蹬镫丁仃叮玎盯钉疔酊靪丰风封枫疯峰烽葑锋蜂更庚耕赓鹒羹亨哼精茎惊京经睛泾荆菁旌晶粳兢鲸坑吭硁铿蒙抨怦砰烹嘭乒俜娉青轻氢倾卿圊清蜻鲭扔僧升生声牲笙甥鼪厅汀听翁嗡兴星狚惺腥应英莺婴撄嘤罂缨璎樱鹦媖瑛膺鹰曾增憎缯罾正争筝蒸征怔挣峥狰钲症烝睁铮稳东冲憧充忡翀舂惮艟匆苁囱枞葱骢璁聪熜冬咚鸫工弓公功攻供肱宫恭蚣躬龚觥哼轰哄訇烘薨埛駉扃空倥崆屄箜忪松凇菘嵩恫通嗵瘑凶兄芎匈汹恟胸佣痈拥邕鄘雍墉慵庸镛壅臃鳙中忪忠终钟盅衷螽宗综棕踪鬃层曾嶒成酲丞呈枨诚承城宬乘盛程惩裎塍澄橙冯逢缝恒姮桁珩横衡蘅楞棱伶灵苓蛉囹泠玲令瓴铃鸰凌陵聆菱棂暹舲翎羚绫棱零龄鲮酃氓虻萌蒙盟甍瞢幪濛曚矇朦艨檬名茗明鸣冥铭洺蓂溟暝瞑螟能棕拧咛狞柠凝芃朋膨堋澎彭棚蓬硼鹏篷鬅平冯评坪苹凭枰洴帡屏瓶萍勍情晴檠擎黥绳渑疼腾誊螣藤廷亭停庭蜓婷霆行形邢陉型荥盈萤莹营萦楹滢蝇潆贏赢瀛迎虫重崇从丛尝悰琮弘红吰闳宏泓荭虹闳洪翃鸿黉龙栊茏咙泷珑眬胧昽聋笼隆癃窿农侬哝傢浓脓秾邛穷茕穹藭筇琼蛩跫戎茸荣绒容崂蓉溶瑢榕融嵘同彤侗苘峒桐砼垌佟烔鲷峂樟僮铜童潼瞳朣曈艟雄熊喁颙";
zhxy_z11="蓁更横盛正应乘胜兴莹凭暝钉称令醒并瑧绷狰丙秉柄饼炳屏禀鞞逞骋等戥顶酊鼎讽唪埂耿哽绠梗鲠绷井阱刭颈景儆憬璟警冷令岭领猛勐蜢艋蒙獴锰懵蠓酩捧顷请綮馨少眚町侹挺艇蓊滃醒擤影郢颍颖拯整宠董懂巩汞拱珙栱哄唝炅迥浻炯煚熲窘孔恐倥陇垄拢笼冗怂省耸悚竦统捅桶痛恸筒永咏泳勇涌俑恿蛹踊肿种冢踵总偬声泵迸绷蚌蹦并病摒蹭秤牚邓凳嶝澄磴瞪镫蹬订钉定碇锭凤奉俸缝更横啈劲径净胫痉竞竟婧敬靖静净境獍镜另令愣孟梦命宁佞拧泞椪碰庆凊箐磬罄圣胜晟乘盛剩瓮蕹兴杏幸性姓荇悻建应映硬媵综锃赠甑正证郑怔诤政挣症铮冲铳动冻侗栋洞恫胴胨垌硐共贡供讧哄澒空控鞚弄讼宋送诵颂用佣中仲众种重纵粽";
zhxy_p12="氐低羝堤提蹂揉沤几讥叽饥玑机乩肌矶鸡奇屐剞笄姬基期赍犄嵇畸跻箕稽齑丽畿羁咪眯妮丕邳裼批纰坯披砒沏妻栖萋期攲梯蹊欺兮西溪希茜郗稀熙牺唏悕晞傒豨僖嘻奚嬉熹樨羲蹊粞犀曦醯巇鼳伊铱医衣依袆咿猗漪噫繄居车苴拘驹俱狙罝疽据琚趄睢裾区岖佉驱祛蛆躯焌趋黢呈圩盱须虚需嘘墟胥湑谞訏迂纡淤逼嘀滴圾芨唧积击缉激唧襀劈噼霹七柒凄欹戚缉喴漆剔踢夕吸汐昔析矽穸息悉蜥晰淅惜翕蜤锡晰熄噏膝螅歙螅窸蟋一壹揖曲屈掬鞠鋦离蛐欻戌厘狸离骊梨犁鹂喱蓠漓缡璃嫠孷藜黎鲡罹篱黧蠡弥迷眯猕谜糜麋靡蘼醾尼泥坭呢妮輗怩倪霓猊鲵麑皮陂疲枇芘狓毗蚍陴埤啤琵脾裨蜱罴貔鼙齐祈圻芪岐荠祁其奇跂祈祇俟耆颀脐旂萁畦跛崎淇颈骑琪琦棋蛴祺錡綦旗蕲鳍麒鬐荑绨提啼鹈騠缇稊题醍蹄仪圮夷痍匜迤饴怡宜荑贻沂诒眙簃姨胰扅蛇移遗颐椸疑嶷彝儿而驴闾榈劬渠蕖瞿蘧氍癯衢蘧鸲徐于予妤玙余馀欤盂臾鱼竽舁俞谀娱萸雩渔隅揄喁畲逾腴渝愉瑜榆虞愚觎舆窬髃荸鼻锹迪笛的荻敌涤微嫡翟镝及伋吉岌汲级极即舍诘亟革芨急疾棘殛蕺集蒺楫辑嵴踖瘠藉籍习席觋袭媳嶍隰檄熄锡局桔菊焗跼橘曲";
zhxy_z12="匕牝比沘妣蹂揉沤秕彼醴俾鄙氐邸诋坻抵底砥骶几己虮掎挤宓犹取麂礼契李里俚逦悝澧鲤理娌蠡米捋芈弭敉靡拟你旎圮仳否吡痞屺岂企启杞起绮棨晵稽体洗铣玺徙喜葸蓗屣禧蟢已以苡矣莒迤蚁倚椅旖踦尔耳迩饵珥柜咀沮莒枸矩举榉龃踽蒟吕侣铝旅屡偻缕膂褛履女取去娶龋许诩栩湑糈醑与予屿伛宇羽雨俣禹语圄龉圉庾瘐窳瑀偊笔给戟脊匹癖擗劈乞乙曲币闭庇詖閟泌駜毖陛毙狴庳敝婢睥薜蓖秘篦蔽脾裨痹弊髀避劈臂比地弟的娣菂第帝谛谤蒂棣睇缔递计记髻伎纪芰技系忌际妓季剂垍荠洎济既觊继徛祭偈悸寄惎蓟跽骑髺霁鲚漈暨冀罽骥厉吏丽励利例疠砺猁欋隶戾唳荔俪俐疠莉莅粝詈痢泥昵腻睨屁睥媲气弃契砌器憩汽剃屉涕绨替殢悌裼嚏戏饩系细盻禊亿义异浥艺呓刈忆议汨羿易率兵羿谊翌肄裔翊诣意臆毅薏劓翳翼癔懿瘗缢殪二贰巨句聚犋讵苣拒具炬沮钜俱倨据距惧飓锯踞屦遽瞿醵虑滤女趣觑序叙酗绪溆絮煦婿与玉驭芋呈妪寸语预喻御寓裕愈豫谕滪遇誉饫必嬖毕苾荜哗筚滗湢愊弼愎腷煏辟碧馝壁躄觱襞璧薜的迹寂绩稷鲫髺力历立粒呖沥枥栗砾瓅疠笠雳溧跞傈篥汩觅密蜜幂谧匿溺辟僻澼甓譬迄讫泣偈葺碛倜逖惕趯却阋舄隙瀹潟一壹弋仡屹亦杙抑邑佚役译逆易峄佾泆怿驿绎枻轶疫弈奕挹悒逸益嗌熠溢镒埸蜴剧律绿率氯恧衄阒旭畜蓄恤续蓿勖洫玉郁育昱狱钰浴域欲阈尉煜蜮毓鹆鹬燠鬻熨潏峪";
zhxy_p13="哧蚩鸱絺眵笞瓻摛嗤痴媸螭魑呲差疵跐骴尸师诗思鸤坻絁狮葹施訾酾司丝私咝鸶仂斯蛳幼飔厮罳澌撕嘶之卮知支芝吱枝肢栀胝祗脂蜘仔吱孜咨姿兹赀资訾泑嗞缁辎赠粢孳滋趑觜锱龇菑鲻吃失虱湿只织池弛驰迟踟坁持匙漦墀篪词茈茨祠瓷辞慈磁雌慈糍鹚时拾十石实识食蚀仁浉执直侄值职填植殖絷跍摭踯";
zhxy_z13="齿侈耻豉礼制此泚史使矢豖始驶屎死止直芷偲沚祉只趾枳咫问訾旨指枉纸轵咔徽子仔籽姊秭茈紫訾籽梓滓尺炽翅眙啻从未次伺刺赐士氏示世仁市式似事势侍试视贳柿拭是恃莳逝誓筮舐弑谥啫噬已四饲巳寺似姒汜兕伺鋦耜祀四泗俟食笥碀嗣至层识帜制轾治峙致智痣滞彘置雉稚踬自豸挚贽志质字瓷眦渍恣彳叱斥赤饬敕拭饰适室释螫式轼郅帙质栉陟桎贽挚轾秩掷鸷炙蛭日";
zhxy_p14="逋蜅初粗都阇嘟夫肤玞鄜孵敷估姑咕沽孤轱畈鸪罛菇菰蛄辜酤呱觚箍乎呼毂糊刳矻枯骷撸噜铺痡殳书倏姝抒纾枢妷殊梳舒摴樗摅毹输疏蔬苏稣酥栈乌圬邬污呜於钨巫朱洙侏诛茱珠株诸铢猪蛛槠潴橥租菹出督忽胡惚唿淴哭窟仆菩不鹄扑噗叔修辞菽淑窣突秃凸葖屋诬刍除厨锄滁蜍橱篨躇蹰雏徂殂凫扶孚罘苻莩俘浮蚨桴符涪蜉鞭郛狐弧縠和壶葫猢瑚糊蝴糊醐湖瓠鹕卢芦庐垆炉泸栌轳胪鸬颅舻鲈模奴孥驽匍莆脯葡蒲酺如茹儒薷嚅濡孺襦蠕图荼徒途涂菟屠酴无毋芜吾吴唔梧蜈鼯醭毒独读渎椟牍默犊髑顿弗佛艴茀幅袱刜拂彿氟绋茀怫芾伏洑茯绂祓服菔芙匐福蝠辐幞襆囫斛觳鹘醭璞濮孰赎塾熟秫俗竹术竺逐烛舳瘃躅足卒崒族镞";
zhxy_z14="补捕哺堡处杵础楮储楚褚肚堵赌睹父甫抚拊斧府俯釡辅脯頫腑腐簠古诂股牯贾罟蛄盅鼓嘏瞽虎浒唬苦鲁橹镥瞄掳虏卤母牡亩拇姆姥努弩胬埔圃浦溥普谱氆汝乳暑黍署鼠数薯曙土吐午五伍仵庑怃忤妩武侮捂牾鹉舞主拄渚煮褚麈诅阻组俎祖卜笃谷骨毂榖鹘汩榾朴蹼辱属蜀嘱瞩属布怖步埔部埠蔀箁簿处醋杜肚妒妬度渡镀蠹父讣付负妇附咐阜驸赴副蝜赋傅富鲋缚赙固故顾堌崮雇锢痼户护沪戽扈互冱岵怙瓠库裤绔路赂璐露鹭辂暮幕募墓慕怒铺戍树竖怒塑庶数墅漱澍腧素嗉愫诉溯愬兔吐堍菟务杌悟误晤雾恶坞鹜骛戊寤婺焐伫苎助住纻僇贮杼注驻柱炷著蛀铸翥箸不亍畜矗触斶黜俶绌諔怵搐滀黜促簇蔟蹙蹴卒猝复腹蝮覆缚馥鳆笏梏喾酷陆录菉鹿渌绿琭禄碌睩蓼僇辘漉麓戮簏箓醁木目沐苜牧睦幕穆霂瀑曝入蓐缛褥溽沐怵术束述夙肃速宿骕粟谡蔌鹔觫簌物勿兀杌筑祝";


yun_arr = {
  "psy":{
    "一东(平)":psy_1dong,
    "二冬(平)":psy_2dong,
    "三江(平)":psy_3jiang,
    "四支(平)":psy_4zhi,
    "五微(平)":psy_5wei,
    "六鱼(平)":psy_6yu,
    "七虞(平)":psy_7yu,
    "八齐(平)":psy_8qi,
    "九佳(平)":psy_9jia,
    "十灰(平)":psy_10hui,
    "十一真(平)":psy_11zhen,
    "十二文(平)":psy_12wen,
    "十三元(平)":psy_13yuan,
    "十四寒(平)":psy_14han,
    "十五删(平)":psy_15shan,
    "一先(平)":psy_1xian,
    "二萧(平)":psy_2xiao,
    "三肴(平)":psy_3yao,
    "四豪(平)":psy_4hao,
    "五歌(平)":psy_5ge,
    "六麻(平)":psy_6ma,
    "七阳(平)":psy_7yang,
    "八庚(平)":psy_8geng,
    "九青(平)":psy_9qing,
    "十蒸(平)":psy_10zheng,
    "十一尤(平)":psy_11you,
    "十二侵(平)":psy_12qin,
    "十三覃(平)":psy_13qing,
    "十四盐(平)":psy_14yan,
    "十五咸(平)":psy_15xian,

    "一董(仄)上声":psy_s_1dong,
    "二肿(仄)上声":psy_s_2zhong,
    "三讲(仄)上声":psy_s_3jiang,
    "四纸(仄)上声":psy_s_4zhi,
    "五尾(仄)上声":psy_s_5wei,
    "六语(仄)上声":psy_s_6yu,
    "七麌(仄)上声":psy_s_7yu,
    "八荠(仄)上声":psy_s_8ji,
    "九蟹(仄)上声":psy_s_9xie,
    "十贿(仄)上声":psy_s_10hui,
    "十一轸(仄)上声":psy_s_11zhen,
    "十二吻(仄)上声":psy_s_12wen,
    "十三阮(仄)上声":psy_s_13ruan,
    "十四旱(仄)上声":psy_s_14han,
    "十五潸(仄)上声":psy_s_15shan,
    "十六铣(仄)上声":psy_s_16xian,
    "十七筱(仄)上声":psy_s_17xiao,
    "十八巧(仄)上声":psy_s_18qiao,
    "十九浩(仄)上声":psy_s_19hao,
    "二十哿(仄)上声":psy_s_20ge,
    "二十一马(仄)上声":psy_s_21ma,
    "二十二养(仄)上声":psy_s_22yang,
    "二十三梗(仄)上声":psy_s_23gen,
    "二十四迥(仄)上声":psy_s_24jiong,
    "二十五有(仄)上声":psy_s_25you,
    "二十六寝(仄)上声":psy_s_26qin,
    "二十七感(仄)上声":psy_s_27gan,
    "二十八琰(仄)上声":psy_s_28yan,
    "二十九豏(仄)上声":psy_s_29xian,

    "一送(仄)去声":psy_q_1song,
    "二宋(仄)去声":psy_q_2song,
    "三绛(仄)去声":psy_q_3jiang,
    "四寘(仄)去声":psy_q_4zhi,
    "五未(仄)去声":psy_q_5wei,
    "六御(仄)去声":psy_q_6yu,
    "七遇(仄)去声":psy_q_7yu,
    "八霁(仄)去声":psy_q_8ji,
    "九泰(仄)去声":psy_q_9tai,
    "十卦(仄)去声":psy_q_10gua,
    "十一队(仄)去声":psy_q_11dui,
    "十二震(仄)去声":psy_q_12zhen,
    "十三问(仄)去声":psy_q_13wen,
    "十四愿(仄)去声":psy_q_14yuan,
    "十五翰(仄)去声":psy_q_15han,
    "十六谏(仄)去声":psy_q_16jian,
    "十七霰(仄)去声":psy_q_17xian,
    "十八啸(仄)去声":psy_q_18xiao,
    "十九效(仄)去声":psy_q_19xiao,
    "二十号(仄)去声":psy_q_20hao,
    "二十一个(仄)去声":psy_q_21ge,
    "二十二祃(仄)去声":psy_q_22ma,
    "二十三漾(仄)去声":psy_q_23yang,
    "二十四敬(仄)去声":psy_q_24jin,
    "二十五径(仄)去声":psy_q_25jin,
    "二十六宥(仄)去声":psy_q_26you,
    "二十七沁(仄)去声":psy_q_27qin,
    "二十八勘(仄)去声":psy_q_28kan,
    "二十九艳(仄)去声":psy_q_29yan,
    "三十陷(仄)去声":psy_q_30xian,

    "一屋(仄)入声":psy_r_1wu,
    "二沃(仄)入声":psy_r_2wo,
    "三觉(仄)入声":psy_r_3jue,
    "四质(仄)入声":psy_r_4zhi,
    "五物(仄)入声":psy_r_5wu,
    "六月(仄)入声":psy_r_6yue,
    "七曷(仄)入声":psy_r_7he,
    "八黠(仄)入声":psy_r_8xia,
    "九屑(仄)入声":psy_r_9xie,
    "十药(仄)入声":psy_r_10yao,
    "十一陌(仄)入声":psy_r_11mo,
    "十二锡(仄)入声":psy_r_12xi,
    "十三职(仄)入声":psy_r_13zhi,
    "十四缉(仄)入声":psy_r_14ji,
    "十五合(仄)入声":psy_r_15he,
    "十六叶(仄)入声":psy_r_16ye,
    "十七洽(仄)入声":psy_r_17qia
  },

  "clzy":{
    "第一部(平)":clzy_p1,
    "第一部(仄)":clzy_z1,
    "第二部(平)":clzy_p2,
    "第二部(仄)":clzy_z2,
    "第三部(平)":clzy_p3,
    "第三部(仄)":clzy_z3,
    "第四部(平)":clzy_p4,
    "第四部(仄)":clzy_z4,
    "第五部(平)":clzy_p5,
    "第五部(仄)":clzy_z5,
    "第六部(平)":clzy_p6,
    "第六部(仄)":clzy_z6,
    "第七部(平)":clzy_p7,
    "第七部(仄)":clzy_z7,
    "第八部(平)":clzy_p8,
    "第八部(仄)":clzy_z8,
    "第九部(平)":clzy_p9,
    "第九部(仄)":clzy_z9,
    "第十部(平)":clzy_p10,
    "第十部(仄)":clzy_z10,
    "第十一部(平)":clzy_p11,
    "第十一部(仄)":clzy_z11,
    "第十二部(平)":clzy_p12,
    "第十二部(仄)":clzy_z12,
    "第十三部(平)":clzy_p13,
    "第十三部(仄)":clzy_z13,
    "第十四部(平)":clzy_p14,
    "第十四部(仄)":clzy_z14,
    "第十五部(入)":clzy_r15,
    "第十六部(入)":clzy_r16,
    "第十七部(入)":clzy_r17,
    "第十八部(入)":clzy_r18,
    "第十九部(入)":clzy_r19
  },

  "zhxy":{
    "一麻(平)":zhxy_p1,
    "一麻(仄)":zhxy_z1,
    "二波(平)":zhxy_p2,
    "二波(仄)":zhxy_z2,
    "三皆(平)":zhxy_p3,
    "三皆(仄)":zhxy_z3,
    "四开(平)":zhxy_p4,
    "四开(仄)":zhxy_z4,
    "五微(平)":zhxy_p5,
    "五微(仄)":zhxy_z5,
    "六豪(平)":zhxy_p6,
    "六豪(仄)":zhxy_z6,
    "七尤(平)":zhxy_p7,
    "七尤(仄)":zhxy_z7,
    "八寒(平)":zhxy_p8,
    "八寒(仄)":zhxy_z8,
    "九文(平)":zhxy_p9,
    "九文(仄)":zhxy_z9,
    "十唐(平)":zhxy_p10,
    "十唐(仄)":zhxy_z10,
    "十一庚(平)":zhxy_p11,
    "十一庚(仄)":zhxy_z11,
    "十二齐(平)":zhxy_p12,
    "十二齐(仄)":zhxy_z12,
    "十三支(平)":zhxy_p13,
    "十三支(仄)":zhxy_z13,
    "十四姑(平)":zhxy_p14,
    "十四姑(仄)":zhxy_z14
  }

};



