

class 黑暗圣剑传说:
    class 兽语:
        翻译表 = {\
            ' ':' ',
            ',':',',
            '，':'，',
            '。':'。',
            '!':'!',
            '！':'！',
            '呼噜噜':'你好',
            '吭':'你',
            '咕':'我',
            '哼':'<询问>',
            #'':'',
            '呼哈噜噜':'宁静的天气',
            '噗噗':'说',
            '吧哒':'听懂',
            '啊耶':'也',
            '哎噜呦':'阳光',
            '哩咔喳':'特别的',
            '咕咕呸':'欢喜',
            '喝':'是',
            '咔哼哩':'朋友',
            '隔嘻':'它',
            '咪吗哄':'宝物',
            '咳嗷嗷嗷':'赠送',
            '吗呢吗':'谢谢',
            '呵嘻噢':'普通的',
            '哇噜哇噜哈呸哈':'战斗',
        }

        例句集 = [\
            '吭哼吧哒咕噗噗哼，咔哼哩',
            
            '哇噜哇噜哈呸哈，哦哇噜哈',
            '哩咔喳吧哒，咔哼哩！',
            '咕哩哇叽嗝嘻吭，呼哈鲁鲁',
            '吗呢吗喝咪吗哄，咕咕呸！',
        ]
