#__all__:goto
r'''[[[
e ../../python3_src/seed/math/power/addition_chain/short/cf_chain.py

seed.math.power.addition_chain.short.cf_chain
py -m nn_ns.app.debug_cmd   seed.math.power.addition_chain.short.cf_chain -x # -off_defs
py -m nn_ns.app.doctest_cmd seed.math.power.addition_chain.short.cf_chain:__doc__ -ht # -ff -df
#######

[[
源起:
1994:'Efficient-computation-of-addition-chains(1994)(Bergeron).pdf'
]]
[[
函数分类{本模块}:
主函数:
    #最主要的导出函数:
    构造冫加靶链牜加辗链构造式扌
        :: 靶值集 -> 加靶链
        '(kw:策略名纟连分数拆分/str) -> (kw:鬽缓存冃靶值讠加辗链构造式/may {靶值:魖加辗链构造式}/缓存) -> 靶值集/{靶值} -> 加靶链{靶值集}'

    #主要用于py_adhoc_call:
    枚举冫靶值集辻加靶链牜加辗链构造式扌
        :: Iter (靶值集|靶值) -> Iter (相应输入项, 加靶链)
        '(kw:策略名纟连分数拆分/str) -> (kw:鬽缓存冃靶值讠加辗链构造式/may {靶值:魖加辗链构造式}/缓存) -> 序列纟靶值集丨靶值/(Iter ({靶值}|靶值冃靶值集)) -> Iter ((靶值集|靶值冃靶值集), 加靶链{(靶值集|靶值冃靶值集)})'
核心函数:
    #构造:〖加辗链构造式〗<<==意图:避免构造中间加链的开销
    #两者相互递归调用:
    构造冫加辗链构造式冃加靶链扌
    取造冫加辗链构造式扌
核心函数相关的类类型与对象:
    乸加辗链串接式
    乸加辗链附尾式
    乸加辗链础链式
        加辗链构造式牜幺
    匴策略纟连分数拆分
外部使用的辅助函数:
    取造冫加辗链构造式牜幺扌
        #用于『with mk_ctx4lazy_import4funcs_(__name__):』
内部使用的辅助函数:
    规范化冫候选分母集扌
        靶值集巛丨靶值扌
    divisor7dichotomic_strategy_
    构造冫加链牜二进制拆分扌
]]


'#'; __doc__ = r'#'

[[
>>> 构造冫加靶链牜加辗链构造式扌([484], 策略名纟连分数拆分='二幂冃平方根策略', 欤添加显链长=True)
(12, (1, 2, 4, 8, 12, 24, 28, 30, 60, 120, 240, 480, 484))
>>> 构造冫加靶链牜加辗链构造式扌([484], 策略名纟连分数拆分='窗式拆分牜加靶链优化牜连分数拆分牜二幂冃平方根策略', 欤添加显链长=True)
(11, (1, 2, 3, 6, 12, 15, 30, 60, 120, 240, 242, 484))


>>> for x in 枚举冫靶值集辻加靶链牜加辗链构造式扌([191, 2*191, 171, 3*171, 3277, 5*3277, 2731, 6*2731], 策略名纟连分数拆分='窗式拆分牜加靶链优化牜连分数拆分牜二幂冃平方根策略', 欤添加显链长=True):print(x)
(191, 11, (1, 2, 3, 6, 9, 11, 22, 44, 47, 94, 188, 191))
(382, 11, (1, 2, 4, 5, 9, 14, 23, 46, 92, 184, 368, 382))
(171, 10, (1, 2, 3, 5, 10, 20, 40, 42, 84, 168, 171))
(513, 10, (1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 513))
(3277, 15, (1, 2, 3, 6, 12, 24, 48, 51, 102, 204, 408, 816, 819, 1638, 3276, 3277))
(16385, 15, (1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048, 4096, 8192, 16384, 16385))
(2731, 15, (1, 2, 3, 5, 10, 20, 40, 42, 84, 168, 336, 341, 682, 1364, 2728, 2731))
(16386, 15, (1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048, 4096, 8192, 8193, 16386))
>>> for x in 枚举冫靶值集辻加靶链牜加辗链构造式扌(range(1,1+200), 策略名纟连分数拆分='窗式拆分牜加靶链优化牜连分数拆分牜二幂冃平方根策略', 欤添加显链长=True):print(x)
((), 0, (1,))
(2, 1, (1, 2))
(3, 2, (1, 2, 3))
(4, 2, (1, 2, 4))
(5, 3, (1, 2, 4, 5))
(6, 3, (1, 2, 3, 6))
(7, 4, (1, 2, 3, 6, 7))
(8, 3, (1, 2, 4, 8))
(9, 4, (1, 2, 4, 8, 9))
(10, 4, (1, 2, 4, 5, 10))
(11, 5, (1, 2, 4, 5, 10, 11))
(12, 4, (1, 2, 3, 6, 12))
(13, 5, (1, 2, 3, 6, 12, 13))
(14, 5, (1, 2, 3, 6, 7, 14))
(15, 5, (1, 2, 3, 6, 12, 15))
(16, 4, (1, 2, 4, 8, 16))
(17, 5, (1, 2, 4, 8, 16, 17))
(18, 5, (1, 2, 4, 8, 9, 18))
(19, 6, (1, 2, 4, 8, 9, 18, 19))
(20, 5, (1, 2, 4, 5, 10, 20))
(21, 6, (1, 2, 4, 5, 10, 20, 21))
(22, 6, (1, 2, 4, 5, 10, 11, 22))
(23, 6, (1, 2, 3, 5, 10, 20, 23))
(24, 5, (1, 2, 3, 6, 12, 24))
(25, 6, (1, 2, 3, 6, 12, 24, 25))
(26, 6, (1, 2, 3, 6, 12, 13, 26))
(27, 6, (1, 2, 3, 6, 12, 24, 27))
(28, 6, (1, 2, 3, 6, 7, 14, 28))
(29, 7, (1, 2, 3, 6, 12, 14, 28, 29))
(30, 6, (1, 2, 3, 6, 12, 15, 30))
(31, 7, (1, 2, 3, 6, 12, 15, 30, 31))
(32, 5, (1, 2, 4, 8, 16, 32))
(33, 6, (1, 2, 4, 8, 16, 32, 33))
(34, 6, (1, 2, 4, 8, 16, 17, 34))
(35, 7, (1, 2, 4, 8, 16, 17, 34, 35))
(36, 6, (1, 2, 4, 8, 9, 18, 36))
(37, 7, (1, 2, 4, 8, 9, 18, 36, 37))
(38, 7, (1, 2, 4, 8, 9, 18, 19, 38))
(39, 7, (1, 2, 3, 6, 9, 18, 36, 39))
(40, 6, (1, 2, 4, 5, 10, 20, 40))
(41, 7, (1, 2, 4, 5, 10, 20, 40, 41))
(42, 7, (1, 2, 4, 5, 10, 20, 21, 42))
(43, 7, (1, 2, 3, 5, 10, 20, 40, 43))
(44, 7, (1, 2, 4, 5, 10, 11, 22, 44))
(45, 7, (1, 2, 4, 5, 10, 20, 40, 45))
(46, 8, (1, 2, 4, 5, 10, 11, 22, 23, 46))
(47, 8, (1, 2, 3, 6, 9, 11, 22, 44, 47))
(48, 6, (1, 2, 3, 6, 12, 24, 48))
(49, 7, (1, 2, 3, 6, 12, 24, 48, 49))
(50, 7, (1, 2, 3, 6, 12, 24, 25, 50))
(51, 7, (1, 2, 3, 6, 12, 24, 48, 51))
(52, 7, (1, 2, 3, 6, 12, 13, 26, 52))
(53, 8, (1, 2, 3, 6, 12, 13, 26, 52, 53))
(54, 7, (1, 2, 3, 6, 12, 24, 48, 54))
(55, 8, (1, 2, 3, 6, 12, 13, 26, 52, 55))
(56, 7, (1, 2, 3, 6, 7, 14, 28, 56))
(57, 8, (1, 2, 3, 6, 12, 14, 28, 56, 57))
(58, 8, (1, 2, 3, 6, 7, 14, 28, 29, 58))
(59, 8, (1, 2, 3, 6, 12, 14, 28, 56, 59))
(60, 7, (1, 2, 3, 6, 12, 15, 30, 60))
(61, 8, (1, 2, 3, 6, 12, 15, 30, 60, 61))
(62, 8, (1, 2, 3, 6, 12, 15, 30, 60, 62))
(63, 8, (1, 2, 3, 6, 12, 15, 30, 60, 63))
(64, 6, (1, 2, 4, 8, 16, 32, 64))
(65, 7, (1, 2, 4, 8, 16, 32, 64, 65))
(66, 7, (1, 2, 4, 8, 16, 32, 33, 66))
(67, 8, (1, 2, 4, 8, 16, 32, 33, 66, 67))
(68, 7, (1, 2, 4, 8, 16, 17, 34, 68))
(69, 8, (1, 2, 4, 8, 16, 17, 34, 68, 69))
(70, 8, (1, 2, 4, 8, 16, 17, 34, 35, 70))
(71, 9, (1, 2, 4, 8, 16, 17, 34, 35, 70, 71))
(72, 7, (1, 2, 4, 8, 9, 18, 36, 72))
(73, 8, (1, 2, 4, 8, 9, 18, 36, 72, 73))
(74, 8, (1, 2, 4, 8, 9, 18, 36, 37, 74))
(75, 8, (1, 2, 3, 6, 9, 18, 36, 72, 75))
(76, 8, (1, 2, 4, 8, 9, 18, 19, 38, 76))
(77, 8, (1, 2, 4, 5, 9, 18, 36, 72, 77))
(78, 8, (1, 2, 3, 6, 9, 18, 36, 39, 78))
(79, 9, (1, 2, 3, 6, 9, 18, 36, 39, 78, 79))
(80, 7, (1, 2, 4, 5, 10, 20, 40, 80))
(81, 8, (1, 2, 4, 5, 10, 20, 40, 80, 81))
(82, 8, (1, 2, 4, 5, 10, 20, 40, 41, 82))
(83, 9, (1, 2, 4, 8, 10, 20, 40, 41, 82, 83))
(84, 8, (1, 2, 4, 5, 10, 20, 21, 42, 84))
(85, 8, (1, 2, 4, 5, 10, 20, 40, 80, 85))
(86, 8, (1, 2, 3, 5, 10, 20, 40, 43, 86))
(87, 9, (1, 2, 3, 5, 10, 20, 40, 43, 86, 87))
(88, 8, (1, 2, 4, 5, 10, 11, 22, 44, 88))
(89, 9, (1, 2, 4, 5, 10, 20, 40, 44, 88, 89))
(90, 8, (1, 2, 4, 5, 10, 20, 40, 45, 90))
(91, 9, (1, 2, 4, 5, 10, 20, 40, 45, 90, 91))
(92, 9, (1, 2, 4, 8, 10, 11, 22, 44, 46, 92))
(93, 9, (1, 2, 4, 5, 10, 11, 22, 44, 88, 93))
(94, 9, (1, 2, 3, 6, 9, 11, 22, 44, 47, 94))
(95, 9, (1, 2, 3, 4, 7, 11, 22, 44, 88, 95))
(96, 7, (1, 2, 3, 6, 12, 24, 48, 96))
(97, 8, (1, 2, 3, 6, 12, 24, 48, 96, 97))
(98, 8, (1, 2, 3, 6, 12, 24, 48, 49, 98))
(99, 8, (1, 2, 3, 6, 12, 24, 48, 96, 99))
(100, 8, (1, 2, 3, 6, 12, 24, 25, 50, 100))
(101, 9, (1, 2, 3, 6, 12, 24, 48, 50, 100, 101))
(102, 8, (1, 2, 3, 6, 12, 24, 48, 51, 102))
(103, 9, (1, 2, 3, 6, 12, 24, 48, 51, 102, 103))
(104, 8, (1, 2, 3, 6, 12, 13, 26, 52, 104))
(105, 9, (1, 2, 4, 6, 12, 24, 48, 52, 104, 105))
(106, 9, (1, 2, 3, 6, 12, 13, 26, 52, 53, 106))
(107, 9, (1, 2, 3, 6, 12, 13, 26, 52, 104, 107))
(108, 8, (1, 2, 3, 6, 12, 24, 48, 54, 108))
(109, 9, (1, 2, 3, 6, 12, 24, 48, 54, 108, 109))
(110, 9, (1, 2, 3, 6, 12, 13, 26, 52, 55, 110))
(111, 9, (1, 2, 3, 6, 7, 13, 26, 52, 104, 111))
(112, 8, (1, 2, 3, 6, 7, 14, 28, 56, 112))
(113, 9, (1, 2, 3, 6, 12, 14, 28, 56, 112, 113))
(114, 9, (1, 2, 3, 6, 12, 14, 28, 56, 57, 114))
(115, 9, (1, 2, 3, 6, 12, 14, 28, 56, 112, 115))
(116, 9, (1, 2, 3, 6, 12, 14, 28, 56, 58, 116))
(117, 9, (1, 2, 4, 5, 10, 14, 28, 56, 112, 117))
(118, 9, (1, 2, 3, 6, 12, 14, 28, 56, 59, 118))
(119, 9, (1, 2, 3, 6, 7, 14, 28, 56, 112, 119))
(120, 8, (1, 2, 3, 6, 12, 15, 30, 60, 120))
(121, 9, (1, 2, 3, 6, 12, 15, 30, 60, 120, 121))
(122, 9, (1, 2, 3, 6, 12, 15, 30, 60, 61, 122))
(123, 9, (1, 2, 3, 6, 12, 15, 30, 60, 120, 123))
(124, 9, (1, 2, 3, 6, 12, 15, 30, 60, 62, 124))
(125, 9, (1, 2, 4, 5, 10, 15, 30, 60, 120, 125))
(126, 9, (1, 2, 3, 6, 12, 15, 30, 60, 63, 126))
(127, 10, (1, 2, 3, 6, 12, 15, 30, 60, 63, 126, 127))
(128, 7, (1, 2, 4, 8, 16, 32, 64, 128))
(129, 8, (1, 2, 4, 8, 16, 32, 64, 128, 129))
(130, 8, (1, 2, 4, 8, 16, 32, 64, 65, 130))
(131, 9, (1, 2, 4, 8, 16, 32, 64, 65, 130, 131))
(132, 8, (1, 2, 4, 8, 16, 32, 33, 66, 132))
(133, 9, (1, 2, 4, 8, 16, 32, 33, 66, 132, 133))
(134, 9, (1, 2, 4, 8, 16, 32, 33, 66, 67, 134))
(135, 10, (1, 2, 4, 8, 16, 32, 33, 66, 67, 134, 135))
(136, 8, (1, 2, 4, 8, 16, 17, 34, 68, 136))
(137, 9, (1, 2, 4, 8, 16, 17, 34, 68, 136, 137))
(138, 9, (1, 2, 4, 8, 16, 17, 34, 68, 69, 138))
(139, 10, (1, 2, 4, 8, 16, 17, 34, 68, 69, 138, 139))
(140, 9, (1, 2, 4, 8, 16, 17, 34, 35, 70, 140))
(141, 10, (1, 2, 4, 8, 16, 17, 34, 35, 70, 140, 141))
(142, 10, (1, 2, 4, 8, 16, 17, 34, 35, 70, 71, 142))
(143, 10, (1, 2, 3, 4, 8, 16, 32, 35, 70, 140, 143))
(144, 8, (1, 2, 4, 8, 9, 18, 36, 72, 144))
(145, 9, (1, 2, 4, 8, 9, 18, 36, 72, 144, 145))
(146, 9, (1, 2, 4, 8, 9, 18, 36, 72, 73, 146))
(147, 9, (1, 2, 3, 6, 9, 18, 36, 72, 144, 147))
(148, 9, (1, 2, 4, 8, 9, 18, 36, 37, 74, 148))
(149, 9, (1, 2, 4, 5, 9, 18, 36, 72, 144, 149))
(150, 9, (1, 2, 3, 6, 9, 18, 36, 72, 144, 150))
(151, 10, (1, 2, 3, 6, 9, 18, 36, 37, 74, 148, 151))
(152, 9, (1, 2, 4, 8, 9, 18, 19, 38, 76, 152))
(153, 9, (1, 2, 4, 8, 9, 18, 36, 72, 144, 153))
(154, 10, (1, 2, 4, 8, 9, 18, 19, 38, 76, 77, 154))
(155, 10, (1, 2, 3, 6, 9, 18, 36, 38, 76, 152, 155))
(156, 9, (1, 2, 3, 6, 9, 18, 36, 39, 78, 156))
(157, 10, (1, 2, 3, 6, 9, 18, 36, 39, 78, 156, 157))
(158, 10, (1, 2, 3, 6, 9, 18, 36, 39, 78, 156, 158))
(159, 10, (1, 2, 3, 6, 9, 18, 36, 39, 78, 156, 159))
(160, 8, (1, 2, 4, 5, 10, 20, 40, 80, 160))
(161, 9, (1, 2, 4, 5, 10, 20, 40, 80, 160, 161))
(162, 9, (1, 2, 4, 5, 10, 20, 40, 80, 81, 162))
(163, 9, (1, 2, 3, 5, 10, 20, 40, 80, 160, 163))
(164, 9, (1, 2, 4, 5, 10, 20, 40, 41, 82, 164))
(165, 9, (1, 2, 4, 5, 10, 20, 40, 80, 160, 165))
(166, 9, (1, 2, 4, 6, 10, 20, 40, 80, 160, 166))
(167, 10, (1, 2, 3, 5, 10, 20, 40, 41, 82, 164, 167))
(168, 9, (1, 2, 4, 5, 10, 20, 21, 42, 84, 168))
(169, 10, (1, 2, 4, 8, 10, 20, 40, 42, 84, 168, 169))
(170, 9, (1, 2, 4, 5, 10, 20, 40, 80, 160, 170))
(171, 10, (1, 2, 3, 5, 10, 20, 40, 42, 84, 168, 171))
(172, 9, (1, 2, 3, 5, 10, 20, 40, 43, 86, 172))
(173, 10, (1, 2, 3, 5, 10, 20, 40, 43, 86, 172, 173))
(174, 10, (1, 2, 3, 5, 10, 20, 40, 43, 86, 172, 174))
(175, 10, (1, 2, 3, 5, 10, 20, 40, 43, 86, 172, 175))
(176, 9, (1, 2, 4, 5, 10, 11, 22, 44, 88, 176))
(177, 10, (1, 2, 4, 5, 10, 20, 40, 44, 88, 176, 177))
(178, 10, (1, 2, 4, 5, 10, 11, 22, 44, 88, 89, 178))
(179, 10, (1, 2, 3, 6, 9, 11, 22, 44, 88, 176, 179))
(180, 9, (1, 2, 4, 5, 10, 20, 40, 45, 90, 180))
(181, 10, (1, 2, 4, 5, 10, 20, 40, 45, 90, 180, 181))
(182, 10, (1, 2, 4, 5, 10, 20, 40, 45, 90, 180, 182))
(183, 10, (1, 2, 3, 5, 10, 20, 40, 45, 90, 180, 183))
(184, 10, (1, 2, 4, 8, 10, 11, 22, 44, 46, 92, 184))
(185, 10, (1, 2, 4, 8, 9, 11, 22, 44, 88, 176, 185))
(186, 10, (1, 2, 4, 5, 10, 11, 22, 44, 88, 176, 186))
(187, 10, (1, 2, 4, 5, 10, 11, 22, 44, 88, 176, 187))
(188, 10, (1, 2, 3, 6, 9, 11, 22, 44, 47, 94, 188))
(189, 11, (1, 2, 3, 6, 9, 11, 22, 44, 47, 94, 188, 189))
(190, 11, (1, 2, 3, 6, 9, 11, 22, 44, 47, 94, 188, 190))
(191, 11, (1, 2, 3, 6, 9, 11, 22, 44, 47, 94, 188, 191))
(192, 8, (1, 2, 3, 6, 12, 24, 48, 96, 192))
(193, 9, (1, 2, 3, 6, 12, 24, 48, 96, 192, 193))
(194, 9, (1, 2, 3, 6, 12, 24, 48, 96, 97, 194))
(195, 9, (1, 2, 3, 6, 12, 24, 48, 96, 192, 195))
(196, 9, (1, 2, 3, 6, 12, 24, 48, 49, 98, 196))
(197, 10, (1, 2, 3, 6, 12, 24, 48, 49, 98, 196, 197))
(198, 9, (1, 2, 3, 6, 12, 24, 48, 96, 192, 198))
(199, 10, (1, 2, 3, 6, 12, 24, 48, 49, 98, 196, 199))
(200, 9, (1, 2, 3, 6, 12, 24, 25, 50, 100, 200))

]]

[[
构造冫加靶链牜加辗链构造式扌
$ szmm4shortest_addition_chain 484
    [ℓ(484) == 11]
py_adhoc_call   seed.math.power.addition_chain.short.cf_chain   @构造冫加靶链牜加辗链构造式扌  +欤添加显链长  --策略名纟连分数拆分:二幂冃平方根策略  ='[484]'
    (12, (1, 2, 4, 8, 12, 24, 28, 30, 60, 120, 240, 480, 484))
        #[链长==13][显链长==12]
py_adhoc_call   seed.math.power.addition_chain.short.cf_chain   @构造冫加靶链牜加辗链构造式扌  +欤添加显链长  --策略名纟连分数拆分:窗式拆分牜加靶链优化牜连分数拆分牜二幂冃平方根策略  ='[484]'
    (11, (1, 2, 3, 6, 12, 15, 30, 60, 120, 240, 242, 484))
        #[链长==12][显链长==11]
    #bug__small_fragment_at_LSB:
        (1, 2, 3, 6, 7, 14, 15, 30, 60, 120, 121, 242, 484)
            #[链长==13][显链长==12]

===
view others/数学/最短加链/最短加链--py_doc-www-杂录.txt
    [191==min{u | [u:<-[1..]][ℓ(2*u) == ℓ(u)]}]
    [171==min{u | [u:<-[1..]][ℓ(3*u) == ℓ(u)]}]
    [3277==min{u | [u:<-[1..]][ℓ(5*u) == ℓ(u)]}]
    [2731==min{u | [u:<-[1..]][ℓ(6*u) == ℓ(u)]}]
py_adhoc_call   seed.math.power.addition_chain.short.cf_chain   ,枚举冫靶值集辻加靶链牜加辗链构造式扌  +欤添加显链长 --策略名纟连分数拆分:窗式拆分牜加靶链优化牜连分数拆分牜二幂冃平方根策略  ='[191, 2*191, 171, 3*171, 3277, 5*3277, 2731, 6*2731]'
    结果见上面:doctest
===
]]
[[
===
py_adhoc_call   seed.math.power.addition_chain.short.cf_chain   ,枚举冫靶值集辻加靶链牜加辗链构造式扌 +欤添加显链长  --策略名纟连分数拆分:窗式拆分牜加靶链优化牜连分数拆分牜二幂冃平方根策略  ='range(1,1+200)'
    结果见上面:doctest
===
]]


py_adhoc_call   seed.math.power.addition_chain.short.cf_chain   @f

]]]'''#'''
__all__ = r'''
魖加辗链构造式
    乸加辗链串接式
    乸加辗链附尾式
    乸加辗链础链式
        加辗链构造式牜幺
            取造冫加辗链构造式牜幺扌
构造冫加辗链构造式冃加靶链扌
    取造冫加辗链构造式扌
        规范化冫候选分母集扌
            靶值集巛丨靶值扌
    匴策略纟连分数拆分
        构造冫加靶链牜加辗链构造式扌
        枚举冫靶值集辻加靶链牜加辗链构造式扌


'''.split()#'''
#divisor7dichotomic_strategy_
#构造冫加链牜二进制拆分扌
__all__
___begin_mark_of_excluded_global_names__0___ = ...
from functools import cached_property
from seed.abc.abc__ver1 import abstractmethod, override, ABC

from seed.tiny_.check import check_type_is, check_type_le, check_int_ge, check_int_ge_le, check_all_

from seed.helper.lazy_import__func7context import mk_ctx4lazy_import4funcs_ #NOTE:not support "as"
with mk_ctx4lazy_import4funcs_(__name__):
    #.from itertools import islice
    from heapq import heappop, heappush, heapify
    from math import isqrt

    from seed.debug.print_err import print_err
    from seed.math.floor_ceil import floor_log2, ceil_log2
    from seed.helper.ifNone import ifNone, ifNonef
    from seed.math.power.addition_chain.common.check import 检查冫严序加链乊靶值扌, 检查冫严序加链扌
    from seed.math.power.addition_chain.short.binary import 构造冫加链巛靶值牜二进制拆分扌

___end_mark_of_excluded_global_names__0___ = ...
__all__

class 魖加辗链构造式(ABC):
    '『cf_chain{n,d} := cf_chain{d,r} *> cf_chain{q} +> r』 ~ 『n == d*q+r』'
    __slots__ = ()
    r'''[[[
    [cf_chain <: star_chain <: addition_chain]
    [加辗链 <: 加星链==加贪链{宽度<=1} <: 加链]
        #辗转相除/连分数
    #]]]'''#'''
    @abstractmethod
    def 罓输出冫加链扌(sf, 输出用加链前缀, 输出用词典冃加链前缀, /):
        '[uint]{len>0}/加链 -> {uint:idx} -> None'
    @property
    @abstractmethod
    def 显链长(sf, /):
        '-> uint'
    @property
    @abstractmethod
    def 靶值(sf, /):
        '-> uint'
    def __len__(sf, /):
        return 1+sf.显链长
    @cached_property
    def 冃加链(sf, /):
        '-> 加链'
        输出用加链前缀 = [1]
        输出用词典冃加链前缀 = {1:0}
        sf.罓输出冫加链扌(输出用加链前缀, 输出用词典冃加链前缀)
        加链 = tuple(输出用加链前缀)
        检查冫严序加链扌(加链)
        return 加链
class 乸加辗链串接式(魖加辗链构造式):
    '(cf_chain{d,r} *> cf_chain{q})'
    ___no_slots_ok___ = True
    def __init__(sf, 加辗式冃前缀, 加辗式冃待提后缀, /):
        check_type_le(魖加辗链构造式, 加辗式冃前缀)
        check_type_le(魖加辗链构造式, 加辗式冃待提后缀)
        sf._pre = 加辗式冃前缀
        sf._suf = 加辗式冃待提后缀
    @property
    def 加辗式冃前缀(sf, /):
        return sf._pre
    @property
    def 加辗式冃待提后缀(sf, /):
        return sf._suf
    @override
    def 罓输出冫加链扌(sf, 输出用加链前缀, 输出用词典冃加链前缀, /):
        '[uint]{len>0}/加链 -> {uint:idx} -> None'
        sf.加辗式冃前缀.罓输出冫加链扌(输出用加链前缀, 输出用词典冃加链前缀)
        sf.加辗式冃待提后缀.罓输出冫加链扌(输出用加链前缀, 输出用词典冃加链前缀)
    @cached_property
    @override
    def 显链长(sf, /):
        '-> uint'
        return sf.加辗式冃前缀.显链长 + sf.加辗式冃待提后缀.显链长
    @cached_property
    @override
    def 靶值(sf, /):
        '-> uint'
        return sf.加辗式冃前缀.靶值 * sf.加辗式冃待提后缀.靶值

class 乸加辗链附尾式(魖加辗链构造式):
    '(cf_chain{d*q} +> r)'
    ___no_slots_ok___ = True
    def __init__(sf, 加辗式冃前缀, 余数冃待提靶值, /):
        check_type_le(魖加辗链构造式, 加辗式冃前缀)
        check_int_ge(0, 余数冃待提靶值)
        sf._pre = 加辗式冃前缀
        sf._r = 余数冃待提靶值
    @property
    def 加辗式冃前缀(sf, /):
        return sf._pre
    @property
    def 余数冃待提靶值(sf, /):
        return sf._r
    @override
    def 罓输出冫加链扌(sf, 输出用加链前缀, 输出用词典冃加链前缀, /):
        '[uint]{len>0}/加链 -> {uint:idx} -> None'
        i = len(输出用加链前缀)
        scale = 输出用加链前缀[-1]
        sf.加辗式冃前缀.罓输出冫加链扌(输出用加链前缀, 输出用词典冃加链前缀)
        dv = scale*sf.余数冃待提靶值
        if dv == 0:return
        if not dv in 输出用词典冃加链前缀:raise Exception
        #bug:if not 输出用词典冃加链前缀[dv] >= i:raise Exception(((输出用加链前缀, scale, sf.余数冃待提靶值), dv, (i, 输出用词典冃加链前缀[dv])))
            #Exception: (([1, 2, 4, 8, 12, 24], 4, 1), 4, (3, 2))
        if not 输出用词典冃加链前缀[dv] >= i-1:raise Exception(((输出用加链前缀, scale, sf.余数冃待提靶值), dv, (i, 输出用词典冃加链前缀[dv])))
        j = len(输出用加链前缀)
        v = 输出用加链前缀[-1] +dv
        输出用加链前缀.append(v)
        输出用词典冃加链前缀[v] = j
    @cached_property
    @override
    def 显链长(sf, /):
        '-> uint'
        return sf.加辗式冃前缀.显链长 + (0 < sf.余数冃待提靶值)
    @cached_property
    @override
    def 靶值(sf, /):
        '-> uint'
        return sf.加辗式冃前缀.靶值 + sf.余数冃待提靶值


class 乸加辗链础链式(魖加辗链构造式):
    '(cf_chain{addition_chain{u}})'
    ___no_slots_ok___ = True
    def __init__(sf, 加链, /):
        check_type_is(tuple, 加链)
        if not 加链:raise TypeError
        check_int_ge_le(1, 1, 加链[0])
        sf._us = 加链
    @property
    def 加链(sf, /):
        return sf._us
    @override
    def 罓输出冫加链扌(sf, 输出用加链前缀, 输出用词典冃加链前缀, /):
        '[uint]{len>0}/加链 -> {uint:idx} -> None'
        scale = 输出用加链前缀[-1]
        it = enumerate(sf.加链, len(输出用加链前缀)-1)
        777; next(it)
        for j, u in it:
            v = scale*u
            输出用加链前缀.append(v)
            输出用词典冃加链前缀[v] = j
    @cached_property
    @override
    def 显链长(sf, /):
        '-> uint'
        return len(sf.加链)-1
    @cached_property
    @override
    def 靶值(sf, /):
        '-> uint'
        return sf.加链[-1]
加辗链构造式牜幺 = 乸加辗链础链式((1,))
def 取造冫加辗链构造式牜幺扌():
    #用于『with mk_ctx4lazy_import4funcs_(__name__):』
    return 加辗链构造式牜幺


def 构造冫加链牜二进制拆分扌(靶值, /):
    '靶值 -> 加链{靶值}'
    return 构造冫加链巛靶值牜二进制拆分扌(靶值)
    #.check_int_ge(1, 靶值)
    #.s = f'{靶值:b}'
    #.us = [1]
    #.for c in s[1:]:
    #.    us.append(us[-1] <<1)
    #.    if c == '1':
    #.        us.append(us[-1] +1)
    #.加链 = tuple(us)
    #.检查冫严序加链乊靶值扌(靶值, 加链)
    #.return 加链
def 规范化冫候选分母集扌(靶值, 候选分母集, /):
    '靶值 -> {(候选分母|靶值集)} -> [[有效路由靶值]]'
    路由阵列 = set()
    for 除数丨路由集 in 候选分母集:
        #.if type(除数丨路由集) is int:
        #.    除数 = 除数丨路由集
        #.    路由集 = [除数]
        #.else:
        #.    路由集 = 除数丨路由集
        路由集 = 靶值集巛丨靶值扌(除数丨路由集)
        路由集 = set(路由集)
        check_all_([check_int_ge_le, 1, 靶值], 路由集)
        路由集.discard(1)
        # all:[路由值 >= 2]
        #if len(路由集) >= 2:路由集.discard(2)
        路由集.add(靶值)
        if len(路由集) == 1:
            continue
        # [靶值 > 除数 >= 2]
        路由阵列.add(tuple(sorted(路由集, reverse=True)))
    路由阵列 = tuple(sorted(路由阵列, reverse=True))
    return 路由阵列
    #.if 0:
    #.    候选分母集 = set(候选分母集)
    #.    check_all_([check_int_ge, 0], 候选分母集)
    #.    降序列表纟除数 = sorted(filter(lambda 除数: (2 <= 除数 < 靶值), 候选分母集), reverse=True)
    #.    if not 降序列表纟除数:raise Exception('有效候选分母集:空')
    #.    # [靶值 > 除数 >= 2]
        #.加辗链构造式 = min((构造冫加辗链构造式冃加靶链扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, [靶值, 除数], 欤保留靶值二=True) for 除数 in 降序列表纟除数), key=len)
            # [靶值集:=[靶值, 除数]]
    #.else:
def 取造冫加辗链构造式扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, 靶值, /):
    '(靶值冃分子->{(候选分母|靶值集)}}) -> {靶值:魖加辗链构造式}/缓存 -> 靶值 -> 魖加辗链构造式{靶值}as_is 加辗链{靶值}'
    #靶值讠候选分母集扌 = _取冫策略扌(靶值讠候选分母集扌)
    if not None is (加辗链构造式:=缓存冃靶值讠加辗链构造式.get(靶值)):
        return 加辗链构造式
    check_int_ge(1, 靶值)
    #.x = 乸全局属性弱(False, 靶值)
    #.if 靶值 < 5 or x.阳爻数纟靶值 == 1:
    if 靶值 < 5 or 靶值.bit_count() == 1:
        #3or二幂 <==> 加链唯一
        #.加链 = 构造冫加链牜二进制拆分扌(靶值)
        加链 = 构造冫加链巛靶值牜二进制拆分扌(靶值)
        加辗链构造式 = 乸加辗链础链式(加链)
    else:
        # [靶值 >= 5][靶值 非二幂]
        # [加链{靶值} 非唯一]
        候选分母集 = 靶值讠候选分母集扌(靶值)
        路由阵列 = 规范化冫候选分母集扌(靶值, 候选分母集)
        # [靶值 > 除数 >= 2]
        加辗链构造式 = min((构造冫加辗链构造式冃加靶链扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, 路由靶值集, 欤保留靶值二=True) for 路由靶值集 in 路由阵列), key=len)
    加辗链构造式
    缓存冃靶值讠加辗链构造式[靶值] = 加辗链构造式
    return 取造冫加辗链构造式扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, 靶值)
def 构造冫加辗链构造式冃加靶链扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, 靶值集, /, *, 欤保留靶值二):
    '(靶值/分子->{(候选分母|靶值集)}) -> {靶值:魖加辗链构造式}/缓存 -> 靶值集/{靶值} -> 魖加辗链构造式as_is加靶链{靶值集}'
    #靶值讠候选分母集扌 = _取冫策略扌(靶值讠候选分母集扌)
    靶值集 = set(靶值集)
    check_all_([check_int_ge, 0], 靶值集)
    欤保留靶值二 = bool(欤保留靶值二) or (2 == max(靶值集, default=0))
    low = 2 if 欤保留靶值二 else 3
    负值二叉堆冃靶值集= [-u for u in 靶值集 if u >= low]
    777; heapify(负值二叉堆冃靶值集)
    # [负值二叉堆冃靶值集:没有重复值]
    # [负值二叉堆冃靶值集:[靶值>=3]if not [[欤保留靶值二][初始时:[2<-靶值集]]] else[靶值>=2]]
    def _heapget0(ls, /):
        return -ls[0]
    def _heappop(ls, /):
        if not ls:
            return 1
        return -heappop(ls)
    def _heappush(ls, u, /):
        check_int_ge(0, u)
        if u < 3 or u in 靶值集:
            return
        靶值集.add(u)
        heappush(ls, -u)
        # [负值二叉堆冃靶值集:没有重复值]
        # [负值二叉堆冃靶值集:[靶值>=3]if not [[欤保留靶值二][初始时:[2<-靶值集]]] else[靶值>=2]]
    qr_ls = []
    while 负值二叉堆冃靶值集:
        靶值 = _heappop(负值二叉堆冃靶值集)
        assert 靶值 >= 2
        if not 负值二叉堆冃靶值集:
            加辗链构造式 = 取造冫加辗链构造式扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, 靶值)
            break
        除数 = _heapget0(负值二叉堆冃靶值集)
        assert 靶值 > 除数 >= 2
        qr = (q, r) = divmod(靶值, 除数)
        assert q >= 1
        assert 0 <= r < 除数
        qr_ls.append(qr)
        _heappush(负值二叉堆冃靶值集, r)
    else:
        加辗链构造式 = 加辗链构造式牜幺
    加辗链构造式
    qr_ls
    for q, r in reversed(qr_ls):
        if not q == 1:
            _加辗链构造式 = 取造冫加辗链构造式扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, q)
            加辗链构造式 = 乸加辗链串接式(加辗链构造式, _加辗链构造式)
        if not r == 0:
            加辗链构造式 = 乸加辗链附尾式(加辗链构造式, r)
    加辗链构造式
    return 加辗链构造式





def divisor7dichotomic_strategy_(u, /):
    # [σ(N)=γ_{dichotomic_strategy}(N) =[def]= {N//2**((floor_log2(N)+1)//2)}]
        # [sqrtN/sqrt2 <= σ(N) <= sqrt2*sqrtN]
        #   [[N>=8] <-> [σ(N) >= 2]]
        #   为了避免无效d:我补丁:[[ν(N)<=3] -> [σ(N) := β(N)]]
    #assert u >= 5
    Au = floor_log2(u)
    d = u>>((1+Au)//2)
    #bug:assert (u >= 8) is (d >= 2), (u, Au, d)
        #AssertionError: (7, 2, 3)
    assert (u >= 4) is (d >= 2), (u, Au, d)
    d = max(2, d)
    return d
def _test__divisor7dichotomic_strategy_():
    for u in range(100):
        try:
            divisor7dichotomic_strategy_(u)
        except AssertionError as exc:
            print_err(exc)
            # (4, 2, 2)
            # (5, 2, 2)
            # (6, 2, 3)
            # (7, 2, 3)
            pass
    return

def _初版牜毛病mk_us_(k, u, L, /):
    us = [1<<(L-j) for j in range(k, L, k)]
    return us
def _原文版mk_us_(k, u, L, /):
    #bug{bug__small_fragment_at_LSB}:us = [u>>j for j in range(k, L, k)]
    rk = 1+ (L-1)%k
    us = [u>>j for j in range(rk, L, k)]
    return us
def _去零版mk_us_(k, u, L, /):
    us = _原文版mk_us_(k, u, L)
    mask = (1<<k)-1
    us = [v for v in us if v&mask]
    #.us = [v for v, v_ in zip(us, chain([u], us)) if v_&mask]
    return us


class 匴策略纟连分数拆分:
    '[靶值讠候选分母集扌 :: (靶值/分子->{(候选分母|靶值集)})]'
    @staticmethod
    def 二进制拆分策略(靶值, /):
        return (靶值//2,) # [q==2][前缀比后缀更长]
        return (2,)
    @staticmethod
    def 二幂冃平方根策略(靶值, /):
        #连分数拆分牜二幂冃平方根策略
        return (divisor7dichotomic_strategy_(靶值),)
    @staticmethod
    def 窗式拆分牜加靶链优化牜连分数拆分牜二幂冃平方根策略(靶值, /):
        u = 靶值
        assert u >= 1
        v2 = u.bit_count()
        if v2 <= 3:
            #二进制拆分
            return 匴策略纟连分数拆分.二进制拆分策略(u)
        assert u >= 15
        #.d = divisor7dichotomic_strategy_(u)
        #.assert 3 <= d < u

        #.Au = floor_log2(u)
        #.s = f'{u:b}'
        #.assert len(s) == 1+Au


        #见上面:mk_us_
        #.mk_us_ = _原文版mk_us_
        mk_us_ = _去零版mk_us_
        def iter_(u, /):
            assert u >= 1
            #assert u >= 5
            L = u.bit_length()
            assert L >= 1
            rt = isqrt(L)
            assert rt >= 1
                #vs:[k:=λ(λ(N))//2]#floor_log2(L-1)//2
            #for k in range(1, 1+rt):
            for k in range(1, 1+min(3+rt,(L+1)//2)):
                us = mk_us_(k, u, L)
                us.append(u)
                yield us
        return iter_(靶值)

def _取冫策略扌(靶值讠候选分母集扌, /):
    if type(靶值讠候选分母集扌) is str:
        nm = 靶值讠候选分母集扌
        靶值讠候选分母集扌 = getattr(匴策略纟连分数拆分, nm)
    return 靶值讠候选分母集扌

def 靶值集巛丨靶值扌(靶值集丨靶值, /):
    '(靶值集|靶值冃靶值集) -> 靶值集'
    if type(靶值集丨靶值) is int:
        靶值 = 靶值集丨靶值
        靶值集 = (靶值,)
    else:
        靶值集 = 靶值集丨靶值
    return 靶值集
def 枚举冫靶值集辻加靶链牜加辗链构造式扌(序列纟靶值集丨靶值, /, *, 策略名纟连分数拆分='二幂冃平方根策略', 鬽缓存冃靶值讠加辗链构造式=None, 欤保留靶值二=False, 欤添加显链长=False):
    '(kw:策略名纟连分数拆分/str) -> (kw:鬽缓存冃靶值讠加辗链构造式/may {靶值:魖加辗链构造式}/缓存) -> 序列纟靶值集丨靶值/(Iter ({靶值}|靶值冃靶值集)) -> Iter ((靶值集|靶值冃靶值集), 加靶链{(靶值集|靶值冃靶值集)})'
    靶值讠候选分母集扌 = _取冫策略扌(策略名纟连分数拆分)
    缓存冃靶值讠加辗链构造式 = ifNone(鬽缓存冃靶值讠加辗链构造式, {})
    for 靶值集丨靶值 in 序列纟靶值集丨靶值:
        靶值集 = 靶值集巛丨靶值扌(靶值集丨靶值)
        靶值集 = set(靶值集)
        靶值集.discard(1)
        if not 欤保留靶值二:
            if len(靶值集) >= 2:靶值集.discard(2)
        靶值集 = tuple(sorted(靶值集))
        加辗链构造式 = 构造冫加辗链构造式冃加靶链扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, 靶值集, 欤保留靶值二=欤保留靶值二)
        加靶链 = 加链 = 加辗链构造式.冃加链
        靶值集丨靶值 = 靶值集[0] if len(靶值集) == 1 else 靶值集
        yield (靶值集丨靶值, 加靶链) if not 欤添加显链长 else (靶值集丨靶值, -1+len(加靶链), 加靶链)
    return
def 构造冫加靶链牜加辗链构造式扌(靶值集, /, *, 策略名纟连分数拆分='二幂冃平方根策略', 鬽缓存冃靶值讠加辗链构造式=None, 欤保留靶值二=False, 欤添加显链长=False):
    '(kw:策略名纟连分数拆分/str) -> (kw:鬽缓存冃靶值讠加辗链构造式/may {靶值:魖加辗链构造式}/缓存) -> 靶值集/{靶值} -> 加靶链{靶值集}'
    靶值讠候选分母集扌 = _取冫策略扌(策略名纟连分数拆分)
    缓存冃靶值讠加辗链构造式 = ifNone(鬽缓存冃靶值讠加辗链构造式, {})
    加辗链构造式 = 构造冫加辗链构造式冃加靶链扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, 靶值集, 欤保留靶值二=欤保留靶值二)
    加靶链 = 加链 = 加辗链构造式.冃加链
    return 加靶链 if not 欤添加显链长 else (-1+len(加靶链), 加靶链)



__all__
pass;枚举冫靶值集辻加靶链牜加辗链构造式扌
from seed.math.power.addition_chain.short.cf_chain import 构造冫加靶链牜加辗链构造式扌
    # :: 靶值集 -> 加靶链
def _API():
    def 构造冫加靶链牜加辗链构造式扌(靶值集, /, *, 策略名纟连分数拆分='二幂冃平方根策略', 鬽缓存冃靶值讠加辗链构造式=None, 欤保留靶值二=False, 欤添加显链长=False):
        '(kw:策略名纟连分数拆分/str) -> (kw:鬽缓存冃靶值讠加辗链构造式/may {靶值:魖加辗链构造式}/缓存) -> 靶值集/{靶值} -> 加靶链{靶值集}'

pass;匴策略纟连分数拆分.窗式拆分牜加靶链优化牜连分数拆分牜二幂冃平方根策略
from seed.math.power.addition_chain.short.cf_chain import 构造冫加辗链构造式冃加靶链扌, 取造冫加辗链构造式扌
def _API():
    def 构造冫加辗链构造式冃加靶链扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, 靶值集, /, *, 欤保留靶值二):
        '(靶值/分子->{(候选分母|靶值集)}) -> {靶值:魖加辗链构造式}/缓存 -> 靶值集/{靶值} -> 魖加辗链构造式as_is加靶链{靶值集}'
    def 取造冫加辗链构造式扌(靶值讠候选分母集扌, 缓存冃靶值讠加辗链构造式, 靶值, /):
        '(靶值冃分子->{(候选分母|靶值集)}}) -> {靶值:魖加辗链构造式}/缓存 -> 靶值 -> 魖加辗链构造式{靶值}as_is 加辗链{靶值}'

from seed.math.power.addition_chain.short.cf_chain import 乸加辗链串接式, 乸加辗链附尾式, 乸加辗链础链式, 取造冫加辗链构造式牜幺扌, 加辗链构造式牜幺, 魖加辗链构造式

from seed.math.power.addition_chain.short.cf_chain import (
魖加辗链构造式
,    乸加辗链串接式
,    乸加辗链附尾式
,    乸加辗链础链式
,        加辗链构造式牜幺
,            取造冫加辗链构造式牜幺扌
,构造冫加辗链构造式冃加靶链扌
,    取造冫加辗链构造式扌
,        规范化冫候选分母集扌
,            靶值集巛丨靶值扌
,    匴策略纟连分数拆分
,        构造冫加靶链牜加辗链构造式扌
,        枚举冫靶值集辻加靶链牜加辗链构造式扌
)
if 1:
    #{used by:}{move from:}view script/蛮力搜索冫最短加链牜修剪搜索树.py
    from seed.math.power.addition_chain.short.cf_chain import _初版牜毛病mk_us_, _原文版mk_us_, _去零版mk_us_
    from seed.math.power.addition_chain.short.cf_chain import divisor7dichotomic_strategy_, _test__divisor7dichotomic_strategy_
    from seed.math.power.addition_chain.short.cf_chain import 构造冫加链牜二进制拆分扌
from seed.math.power.addition_chain.short.cf_chain import *
