#__all__:goto
r'''[[[
e ../../python3_src/seed/math/power/addition_chain/short/window.py

seed.math.power.addition_chain.short.window
py -m nn_ns.app.debug_cmd   seed.math.power.addition_chain.short.window -x # -off_defs
py -m nn_ns.app.doctest_cmd seed.math.power.addition_chain.short.window:__doc__ -ht # -ff -df
#######

[[
源起:
view ../../python3_src/seed/math/power/addition_chain/shortest/upper_bound4len_optimal_addition_chain.py
    反常现象:
        (3583, (16, 17, 16))
            #(最小靶值纟最小显链长, (最小显链长, 上界纟最小显链长牜实证, 上界纟最小显链长牜速算))
==>>:
    [〖匴策略纟连分数拆分.窗式拆分牜加靶链优化牜连分数拆分牜二幂冃平方根策略〗并非『窗式拆分』]
]]


'#'; __doc__ = r'#'
(3583, (16, 17, 16))
(14143037, (30, 33, 32))
>>> fs2 = [构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌, 构造冫最佳参数辻加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽首宽扌]
>>> for 靶值 in [3583, 14143037]:
...   for f1 in fs2:
...     (参数, 加链) = f1(靶值)
...     print((靶值, 显链长纟(加链), 参数, 加链))
(3583, 17, 1, (1, 2, 3, 6, 7, 8, 16, 24, 48, 55, 110, 220, 440, 880, 1760, 3520, 3575, 3583))
(3583, 16, (3, 3), (1, 2, 3, 6, 7, 12, 24, 48, 55, 110, 220, 440, 447, 894, 1788, 3576, 3583))
(14143037, 33, 1, (1, 2, 4, 5, 10, 15, 17, 22, 44, 66, 132, 154, 171, 193, 386, 772, 1544, 3088, 3281, 3452, 6904, 13808, 27616, 55232, 110464, 220928, 441856, 883712, 1767424, 3534848, 7069696, 14139392, 14142844, 14143037))
(14143037, 30, (4, 4), (1, 2, 3, 6, 7, 13, 26, 52, 104, 208, 215, 430, 860, 863, 1726, 3452, 6904, 13808, 27616, 27623, 55246, 110492, 220984, 441968, 883936, 883939, 1767878, 3535756, 7071512, 14143024, 14143037))

上面&下面 ==>>: ???[滑窗式 不如 定窗式]???
    考虑:逆向滑动...最高位1
    但是结果: 定窗式 优于 滑窗式牜低阳爻 优于 滑窗式牜高阳爻


>>> def f2(fs2, N, /):
...     n4fst = n4snd = n4same = 0
...     for 靶值 in range(1, 1+N):
...         ls = [f1(靶值) for f1 in fs2]
...         (a, b) = [显链长纟(加链) for (参数, 加链) in ls]
...         if (a < b):n4fst += 1
...         elif (a > b):n4snd += 1
...         else:n4same += 1
...     return (n4fst, n4snd), n4same
>>> f2(fs2, 100)
((0, 3), 97)
>>> f2(fs2, 1000)   #doctest: +SKIP
((3, 128), 869)
>>> f2(fs2, 10000)  #doctest: +SKIP
((30, 3213), 6757)



>>> for 靶值 in [3583, 14143037]:bin(靶值)
'0b110111111111'
'0b110101111100111000111101'

>>> fs3 = [构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌, 构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌, 构造冫最佳参数辻加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽首宽扌]
>>> for 靶值 in [3583, 14143037]:
...   for f1 in fs3:
...     (参数, 加链) = f1(靶值)
...     print((靶值, 显链长纟(加链), 参数, 加链))
(3583, 17, 1, (1, 2, 3, 6, 7, 8, 16, 24, 48, 55, 110, 220, 440, 880, 1760, 3520, 3575, 3583))
(3583, 17, 1, (1, 2, 3, 6, 7, 8, 16, 24, 48, 55, 110, 220, 440, 880, 1760, 3520, 3575, 3583))
(3583, 16, (3, 3), (1, 2, 3, 6, 7, 12, 24, 48, 55, 110, 220, 440, 447, 894, 1788, 3576, 3583))
(14143037, 33, 1, (1, 2, 4, 5, 10, 15, 17, 22, 44, 66, 132, 154, 171, 193, 386, 772, 1544, 3088, 3281, 3452, 6904, 13808, 27616, 55232, 110464, 220928, 441856, 883712, 1767424, 3534848, 7069696, 14139392, 14142844, 14143037))
(14143037, 33, 1, (1, 2, 4, 5, 10, 15, 17, 22, 44, 66, 132, 154, 171, 193, 386, 772, 1544, 3088, 3281, 3452, 6904, 13808, 27616, 55232, 110464, 220928, 441856, 883712, 1767424, 3534848, 7069696, 14139392, 14142844, 14143037))
(14143037, 30, (4, 4), (1, 2, 3, 6, 7, 13, 26, 52, 104, 208, 215, 430, 860, 863, 1726, 3452, 6904, 13808, 27616, 27623, 55246, 110492, 220984, 441968, 883936, 883939, 1767878, 3535756, 7071512, 14143024, 14143037))

vs:上面:((0, 3), 97)
>>> f2(fs3[::2], 100)
((0, 7), 93)
>>> f2(fs3[::2], 1000)  #doctest: +SKIP
((6, 208), 786)

>>> f2(fs3[:2], 100)    #doctest: +SKIP
((1, 5), 94)
>>> f2(fs3[:2], 1000)   #doctest: +SKIP
((27, 106), 867)









py_adhoc_call   seed.math.power.addition_chain.short.window   @f
]]]'''#'''
__all__ = r'''
构造冫加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽扌
    构造冫加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌
        构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌


构造冫加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌
    构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌
        构造冫加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽扌


构造冫加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽首宽扌
    构造冫最佳参数辻加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽首宽扌
        构造冫加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽乊首宽扌


奇数部扌
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
#.from itertools import islice
from seed.tiny_.check import check_type_is, check_int_ge, check_int_ge_le
from seed.helper.lazy_import__func7context import mk_ctx4lazy_import4funcs_ #NOTE:not support "as"
with mk_ctx4lazy_import4funcs_(__name__):
    #from seed.debug.print_err import print_err
    from seed.math.power.addition_chain.common.properties import 显链长纟, 阳爻数纟, 首爻位纟
    from seed.math.power.addition_chain.common.check import 检查冫严序加链乊靶值扌

    from seed.math.power.addition_chain.short.binary import 构造冫加链巛靶值牜二进制拆分扌
    from seed.math.power.addition_chain.short.cf_chain import 构造冫加靶链牜加辗链构造式扌

    #from seed.tiny_.funcs import fst
    from seed.math.max_power_of_base_as_factor_of_ import factor_pint_out_2_powers
    #from seed.math.max_power_of_base_as_factor_of_ import max_power_of_base_as_factor_of_, count_num_low_0bits_of_pint, count_num_low_1bits_of_uint, factor_pint_out_2_powers, factor_nonzero_int_out_sign_and_2_powers
___end_mark_of_excluded_global_names__0___ = ...

def 奇数部扌(片值, /):
    check_int_ge(1, 片值)
    (ez, odd) = factor_pint_out_2_powers(片值)
    return odd


def 构造冫加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽乊首宽扌(窗宽, 如首宽, 靶值, /):
    r'''[[[
    '窗宽/uint{>=1} -> 如首宽/int{<=窗宽}{>=1-窗宽} -> 靶值/uint{>=1} -> 加链{靶值}'

    [首爻位纟靶值 := floor_log2(靶值)]
    [总长 := 1+floor_log2(靶值)]
    [真首宽 := if [如首宽 >= 1] then 如首宽 else 窗宽+如首宽]
    !! [1 <= 真首宽 <= 窗宽]
    => [1-窗宽 <= 如首宽 <= 窗宽]
    * [总长 <= 真首宽]:
        [加靶集冃尾表 := {靶值}]
        [加链 := _构造冫加靶链扌(加靶集冃尾表)]
    * [总长 > 真首宽]:
        [强尾宽 := 1+(-1+总长-真首宽)%窗宽]
        [体片数目 := (总长-真首宽-强尾宽)///窗宽]
        [总长 == 真首宽 +窗宽*体片数目 +强尾宽]
        [靶值改 := 靶值 << (窗宽-强尾宽)]
        [加靶集冃尾表 := {奇数部纟(片值) | [j:<-[0..<2+体片数目]][片值 := ((靶值改>>(j*窗宽))&(-1+2**窗宽))][片值=!=0]}]
        [加链 := sorted({*_构造冫加靶链扌(加靶集冃尾表), ???...})]

    ]]]'''#'''
    check_int_ge(1, 窗宽)
    check_int_ge_le(1-窗宽, 窗宽, 如首宽)
    check_int_ge(1, 靶值)
    真首宽 = 如首宽 if 如首宽 >= 1 else 窗宽+如首宽
    check_int_ge_le(1, 窗宽, 真首宽)
    总长 = 靶值.bit_length()
    if 总长 <= 真首宽:
        加链 = 构造冫加链巛靶值牜二进制拆分扌(靶值)
        return 加链
    强尾宽 = 1+(-1+总长-真首宽)%窗宽
    体片数目 = (总长-真首宽-强尾宽)//窗宽
    assert 总长 == 真首宽 +窗宽*体片数目 +强尾宽
    靶值改 = 靶值 << (窗宽-强尾宽)
    奇部列表冃尾表 = []
    阴爻数目列表 = []
    掩码 = (-1+2**窗宽)
    阴爻数目牜累积 = 0
    for j in range(2+体片数目):
        片值 = ((靶值改>>(j*窗宽))&掩码)
        if 片值:
            (阴爻数目, 奇部) = factor_pint_out_2_powers(片值)
            奇部列表冃尾表.append(奇部)
            阴爻数目牜累积 += 阴爻数目
            阴爻数目列表.append(阴爻数目牜累积)
            777;阴爻数目牜累积 = 窗宽 -阴爻数目 -奇部.bit_length()
        else:
            阴爻数目牜累积 += 窗宽
        阴爻数目牜累积
    阴爻数目列表[0] -= (窗宽-强尾宽)
    奇部列表冃尾表.reverse()
    阴爻数目列表.reverse()
    us = [0]
    for 奇部, 阴爻数目 in zip(奇部列表冃尾表, 阴爻数目列表):
        for _ in range(奇部.bit_length()):
            us.append(us[-1] << 1)
        us.append(us[-1] ^ 奇部)
        for _ in range(阴爻数目):
            us.append(us[-1] << 1)
    加靶集冃尾表 = {*奇部列表冃尾表}
    加链冃尾表 = 构造冫加靶链牜加辗链构造式扌(加靶集冃尾表)
    加靶集 = {*us, *加链冃尾表}
    777;加靶集.remove(0)
    加链 = tuple(sorted(加靶集))
    检查冫严序加链乊靶值扌(靶值, 加链)
    return 加链

def 构造冫加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽扌(窗宽, 靶值, /):
    '窗宽/uint{>=1} -> 靶值/uint{>=1} -> 加链{靶值}'
    check_int_ge(1, 窗宽)
    check_int_ge(1, 靶值)
    总长 = 靶值.bit_length()
    窗宽 = max(窗宽, 总长)
    # [窗宽 <= 总长]

    掩码 = (-1+2**窗宽)
        # !! [窗宽 <= 总长]#不太大
    #反掩码 = ~掩码
    加靶集冃尾表 = set()
    us = [靶值]
    while us[-1]:
        u = us[-1]
        if u&1:
            片值 = u & 掩码
            加靶集冃尾表.add(片值)
            #h = u & 反掩码 # == u -片值
            us.append(u ^ 片值)
        else:
            us.append(us[-1] >> 1)
    us.pop()
    加链冃尾表 = 构造冫加靶链牜加辗链构造式扌(加靶集冃尾表)
    加靶集 = {*us, *加链冃尾表}
    加链 = tuple(sorted(加靶集))
    检查冫严序加链乊靶值扌(靶值, 加链)
    return 加链


def 构造冫加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽扌(窗宽, 靶值, /):
    '窗宽/uint{>=1} -> 靶值/uint{>=1} -> 加链{靶值}'
    check_int_ge(1, 窗宽)
    check_int_ge(1, 靶值)
    s = f'{靶值:b}'
    总长 = len(s)
    assert s[0] == '1'
    窗宽 = max(窗宽, 总长)
    # [窗宽 <= 总长]

    j = 0
    加靶集冃尾表 = set()
    us = [0]
    while j < 总长:
        if s[j] == '1':
            t = s[j:j+窗宽]
            片值 = int(t, 2)
            for _ in range(len(t)):
                us.append(us[-1] << 1)
            us.append(us[-1] ^ 片值)
            加靶集冃尾表.add(片值)
            j += len(t)
        else:
            us.append(us[-1] << 1)
            j += 1
    assert j == 总长
    加链冃尾表 = 构造冫加靶链牜加辗链构造式扌(加靶集冃尾表)
    加靶集 = {*us, *加链冃尾表}
    777;加靶集.remove(0)
    加链 = tuple(sorted(加靶集))
    检查冫严序加链乊靶值扌(靶值, 加链)
    return 加链



def 构造冫加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌(靶值, /):
    '靶值/uint{>=1} -> 加链{靶值}'
    (窗宽, 加链) = 构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌(靶值)
    return 加链
def 构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌(靶值, /):
    '靶值/uint{>=1} -> (窗宽, 加链{靶值})'
    check_int_ge(1, 靶值)

    总长 = 靶值.bit_length()
    return min(((窗宽, 构造冫加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽扌(窗宽, 靶值)) for 窗宽 in range(1, 1+总长)), key=_key_func)





def 构造冫加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌(靶值, /):
    '靶值/uint{>=1} -> 加链{靶值}'
    (窗宽, 加链) = 构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌(靶值)
    return 加链
def 构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌(靶值, /):
    '靶值/uint{>=1} -> (窗宽, 加链{靶值})'
    check_int_ge(1, 靶值)

    总长 = 靶值.bit_length()
    return min(((窗宽, 构造冫加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽扌(窗宽, 靶值)) for 窗宽 in range(1, 1+总长)), key=_key_func)
def _key_func(x, /):
    (参数, 加链) = x
    return (显链长纟(加链), 参数)

def 构造冫最佳参数辻加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽首宽扌(靶值, /):
    '靶值/uint{>=1} -> ((窗宽,首宽), 加链{靶值})'
    check_int_ge(1, 靶值)

    总长 = 靶值.bit_length()
    return min((((窗宽,首宽), 构造冫加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽乊首宽扌(窗宽,首宽, 靶值)) for 窗宽 in range(1, 1+总长) for 首宽 in range(1, 1+窗宽)), key=_key_func)
def 构造冫加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽首宽扌(靶值, /):
    ((窗宽,首宽), 加链) = 构造冫最佳参数辻加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽首宽扌(靶值)
    return 加链

__all__

from seed.math.power.addition_chain.short.window import 构造冫加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌, 构造冫加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌, 构造冫加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽首宽扌


from seed.math.power.addition_chain.short.window import 构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌, 构造冫最佳窗宽辻加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽扌, 构造冫最佳参数辻加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链牜内选窗宽首宽扌

from seed.math.power.addition_chain.short.window import 构造冫加链巛靶值牜窗式拆分牜滑窗式牜高阳爻牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽扌, 构造冫加链巛靶值牜窗式拆分牜滑窗式牜低阳爻牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽扌, 构造冫加链巛靶值牜窗式拆分牜定窗式牜加靶链优化纟非零片段奇数部集牜加辗链乊窗宽乊首宽扌


from seed.math.power.addition_chain.short.window import *
