#__all__:goto
r'''[[[
e ../../python3_src/seed/math/power/addition_chain/shortest/rewrite3.py

seed.math.power.addition_chain.shortest.rewrite3
py -m nn_ns.app.debug_cmd   seed.math.power.addition_chain.shortest.rewrite3 -x # -off_defs
py -m nn_ns.app.doctest_cmd seed.math.power.addition_chain.shortest.rewrite3:__doc__ -ht # -ff -df
#######

[[
源起:
view script/min_add_ver5__mixed_recursive_greedy_zpow_addition_chain.py
    简并态{递归婪溟链}
-->:更名:
view ../../python3_src/seed/math/power/addition_chain/shortest/mixed_recursive_greedy_zpow_addition_chain.py
view ../../python3_src/seed/math/power/addition_chain/shortest/mixed_recursive_greedy_zpow_addition_chain__doc__py_adhoc_call.py
    最短加链暨递归婪溟链
]]
[[
递归婪溟链
    强调:递归最短{在不考虑 溟化值 的前提下 递归最短}{溟化值集 构成 跳线，不是 主线}
    『婪』-贪婪型:类比于:加星链
    『溟』-二幂环

# [:约束牜定义冫递归婪溟链]:here
[靶值 == 次大数 + (内点<<溟次)]
[内点 in 简并集纟次大数]
[最小显链长纟靶值 == 最小显链长纟次大数 +1 +溟次]
[溟化值集 := {内点<<ez | [n:<-[1..=溟次]]}]
]]


'#'; __doc__ = r'#'

>>> [*枚举冫递归婪溟链巛严序加链扌([1])]
[乸递归婪溟链((1,), (), (), (), (0,))]
>>> [*枚举冫递归婪溟链巛严序加链扌([1, 2])]
[乸递归婪溟链((1, 2), (0,), (0,), (0,), (0, 1))]
>>> [*枚举冫递归婪溟链巛严序加链扌([1, 2, 3])]
[乸递归婪溟链((1, 3), (1,), (0,), (1,), (0, 2))]
>>> 严序加链讠址引讠列表纟双加数址引扌([1, 2, 3])
((), ((0, 0),), ((1, 0),))

>>> uss = ([1, 2, 3, 5, 10, 13, 23, 46, 92, 184, 185, 369], [1, 2, 4, 8, 16, 32, 64, 80, 144, 288, 368, 369], [1, 2, 4, 8, 16, 32, 48, 80, 160, 320, 368, 369])
>>> [[(str(递归婪溟链), max(递归婪溟链.次大数址引讠内点址距)) for 递归婪溟链 in 枚举冫递归婪溟链巛严序加链扌(us)] for us in uss]
[[('[1~3~5~10~13~23~46~92~184~185~369]', 8)], [('[1~2~4~8~16~80~144~288~368~369]', 8)], [('[1~2~4~8~16~48~80~160~320~368~369]', 9)]]






>>> def test4many_(趃纟最短加链, /, *, fmt_case):
...   for 最短加链 in 趃纟最短加链:
...     try:
...         缩写集文本 = 缩写集文本纟递归婪溟链巛严序加链扌(最短加链, fmt_case=fmt_case)
...     except Exception as exc:
...         raise Exception(exc, 最短加链)
...     tail = ''
...     for 递归婪溟链 in 解读冫缩写集文本纟列表纟递归婪溟链扌(缩写集文本, fmt_case=fmt_case):
...         assert 递归婪溟链.严序加链 == 最短加链, (最短加链, 递归婪溟链.严序加链, 递归婪溟链)
...         #if not 递归婪溟链.欤递归最短扌():print(f'----\n--#非递归最短:{递归婪溟链.to_xxx_str_(fmt_case)!s}')
...         if not 递归婪溟链.欤递归最短扌():
...             tail = '#非递归最短'
...     print(缩写集文本+tail)

>>> some_optimal_addition_chains_of_12509 = (
... ((1, 2, 3, 6, 12, 13, 24, 48, 96, 192, 384, 397, 781, 1562, 3124, 6248, 6261, 12509) #左侧最小==右侧最小
... ,(1, 2, 4, 8, 16, 17, 32, 64, 128, 256, 512, 1024, 1041, 2082, 4164, 8328, 12492, 12509) #左侧最大
... ,(1, 2, 4, 8, 12, 13, 24, 48, 96, 192, 384, 768, 781, 1562, 3124, 6248, 12496, 12509) #右侧最大
... ,(1, 2, 3, 6, 12, 13, 24, 48, 96, 192, 384, 768, 781, 1562, 3124, 6248, 12496, 12509) #from website
... ))
>>> test4many_(some_optimal_addition_chains_of_12509, fmt_case='stem_str')
[1~3~6~12~13~397~781~1562~3124~6248~6261~12509]
[1~17~1041~2082~4164~12492~12509]
[1~2~4~12~13~781~1562~3124~6248~12496~12509]
[1~3~6~12~13~781~1562~3124~6248~12496~12509]
>>> test4many_(some_optimal_addition_chains_of_12509, fmt_case='dnzw_str')
[-^1---3-1^5-2^5----5-1]
[-^4-1^10---^1-4]
[---^1-3-1^6-----5]
[-^1---3-1^6-----5]


某条最短加链暨递归婪溟链{靶值:=12509}
[-^4-1^10---^1-4]
[1~~17~~1041~~2082~~4164~~12492~~12509]
##  |# | #    | #  | #    |      |
#1  |# | 1041-x #  | 4164 |      |
#2  |# |        #  | 8328-x      |
#4  |# |      2082-x             |
#8  |# |                         |
#16-x# |                         |
#32  # |                         |
#64 17-o-------------------------x
#128   |
#256   |
#512   |
#1024--x






>>> optimal_addition_chains_of_5784689 = (
... ((1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,16385,16401,32768,49169,81937,98322,180259,360518,721036,1442072,2884144,2900545,5784689)
... ,(1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,16385,16401,32768,49169,81937,98322,180259,360518,721036,1442072,2884144,5768288,5784689)
... ,(1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,16385,16401,32768,49169,81937,163874,180259,360518,721036,1442072,2884144,2900545,5784689)
... ,(1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,16385,16401,32768,49169,81937,163874,180259,360518,721036,1442072,2884144,5768288,5784689)
... ,(1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,16385,16401,32768,65536,81937,98322,180259,360518,721036,1442072,2884144,2900545,5784689)
... ,(1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,16385,16401,32768,65536,81937,98322,180259,360518,721036,1442072,2884144,5768288,5784689)
... ,(1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,16385,16401,32768,65536,81937,163874,180259,360518,721036,1442072,2884144,2900545,5784689)
... ,(1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,16385,16401,32768,65536,81937,163874,180259,360518,721036,1442072,2884144,5768288,5784689)
... ,(1,2,4,8,16,32,64,65,97,128,225,353,706,1412,2824,5648,11296,22592,45184,90368,180736,180801,361537,723074,1446148,2892296,2892393,5784689)
... ,(1,2,4,8,16,32,64,65,97,128,225,353,706,1412,2824,5648,11296,22592,45184,90368,180736,180801,361537,723074,1446148,2892296,5784592,5784689)
... ,(1,2,4,8,16,32,64,65,97,128,225,353,706,1412,2824,5648,11296,22592,45184,90368,180736,361472,361537,723074,1446148,2892296,2892393,5784689)
... ,(1,2,4,8,16,32,64,65,97,128,225,353,706,1412,2824,5648,11296,22592,45184,90368,180736,361472,361537,723074,1446148,2892296,5784592,5784689)
... ,(1,2,4,8,16,32,64,65,97,128,256,353,706,1412,2824,5648,11296,22592,45184,90368,180736,180801,361537,723074,1446148,2892296,2892393,5784689)
... ,(1,2,4,8,16,32,64,65,97,128,256,353,706,1412,2824,5648,11296,22592,45184,90368,180736,180801,361537,723074,1446148,2892296,5784592,5784689)
... ,(1,2,4,8,16,32,64,65,97,128,256,353,706,1412,2824,5648,11296,22592,45184,90368,180736,361472,361537,723074,1446148,2892296,2892393,5784689)
... ,(1,2,4,8,16,32,64,65,97,128,256,353,706,1412,2824,5648,11296,22592,45184,90368,180736,361472,361537,723074,1446148,2892296,5784592,5784689)
... ))
>>> test4many_(optimal_addition_chains_of_5784689, fmt_case='stem_str')
[1~16385~16401~49169~81937~98322~180259~360518~721036~1442072~2884144~2900545~5784689]#非递归最短
[1~16385~16401~49169~81937~98322~180259~360518~721036~1442072~2884144~5768288~5784689]#非递归最短
[1~16385~16401~49169~81937~163874~180259~360518~721036~1442072~2884144~2900545~5784689]
[1~16385~16401~49169~81937~163874~180259~360518~721036~1442072~2884144~5768288~5784689]
[1~16385~16401~81937~98322~180259~360518~721036~1442072~2884144~2900545~5784689]#非递归最短
[1~16385~16401~81937~98322~180259~360518~721036~1442072~2884144~5768288~5784689]#非递归最短
[1~16385~16401~81937~163874~180259~360518~721036~1442072~2884144~2900545~5784689]
[1~16385~16401~81937~163874~180259~360518~721036~1442072~2884144~5768288~5784689]
[1~65~97~225~353~706~1412~2824~5648~11296~22592~45184~90368~180736~180801~361537~723074~1446148~2892296~2892393~5784689]
[1~65~97~225~353~706~1412~2824~5648~11296~22592~45184~90368~180736~180801~361537~723074~1446148~2892296~5784592~5784689]
[1~65~97~225~353~706~1412~2824~5648~11296~22592~45184~90368~180736~361472~361537~723074~1446148~2892296~2892393~5784689]
[1~65~97~225~353~706~1412~2824~5648~11296~22592~45184~90368~180736~361472~361537~723074~1446148~2892296~5784592~5784689]
[1~65~97~353~706~1412~2824~5648~11296~22592~45184~90368~180736~180801~361537~723074~1446148~2892296~2892393~5784689]
[1~65~97~353~706~1412~2824~5648~11296~22592~45184~90368~180736~180801~361537~723074~1446148~2892296~5784592~5784689]
[1~65~97~353~706~1412~2824~5648~11296~22592~45184~90368~180736~361472~361537~723074~1446148~2892296~2892393~5784689]
[1~65~97~353~706~1412~2824~5648~11296~22592~45184~90368~180736~361472~361537~723074~1446148~2892296~5784592~5784689]
>>> test4many_(optimal_addition_chains_of_5784689, fmt_case='dnzw_str')
[-^14-1^4-2^15-3^15-3-1-----8-1]#非递归最短
[-^14-1^4-2^15-3^15-3-1------9]#非递归最短
[-^14-1^4-2^15-3^15--4-----8-1]
[-^14-1^4-2^15-3^15--4------9]
[-^14-1^4-2^16-2-1-----7-1]#非递归最短
[-^14-1^4-2^16-2-1------8]#非递归最短
[-^14-1^4-2^16--3-----7-1]
[-^14-1^4-2^16--3------8]
[-^6-1^5-2^7-3^7----------12-1----16-1]
[-^6-1^5-2^7-3^7----------12-1-----17]
[-^6-1^5-2^7-3^7-----------13----16-1]
[-^6-1^5-2^7-3^7-----------13-----17]
[-^6-1^5-2^8----------11-1----15-1]
[-^6-1^5-2^8----------11-1-----16]
[-^6-1^5-2^8-----------12----15-1]
[-^6-1^5-2^8-----------12-----16]


##经过『.欤递归最短扌()』确认:
某条最短加链暨递归婪溟链{靶值:=5784689}
[-^14-1^4-2^16--3------8]
[1~~~~~~16385~~16401~~81937~~163874~~180259~~360518~~721036~~1442072~~2884144~~5768288~~5784689]
##     |#     |#     |#     |       |#      |#      |#      |#       |#       |        |
#1     |#     |#     |81937-x       |180259-x#      |721036-x#       |2884144-x        |
#2     |16385-o------o--------------x        360518-x        1442072-x                 |
#4     |      |#     |                                                                 |
#8     |      |16401-o-----------------------------------------------------------------x
#16----o------x      |
#32    |             |
#64    |             |
#128   |             |
#256   |             |
#512   |             |
#1024  |             |
#2048  |             |
#4096  |             |
#8192  |             |
#16384-x             |
#32768               |
#65536---------------x




















#>>> from nn_ns.math_nn.numbers.shortest_addition_chain__the_max_one import pint2arbitrary_shortest_addition_chain as 靶值讠最短加链
>>> from seed.math.power.addition_chain.data.get_target_uint2may_optimal_addition_chain7max_recur_shortest_stem_ import 取冫靶值讠婪溟链牜递归最短牜左侧最大扌, 靶值讠婪溟链牜递归最短牜左侧最大扌
>>> 靶值讠最短加链 = 取冫靶值讠婪溟链牜递归最短牜左侧最大扌()
>>> def 趃靶值序列讠趃最短加链序列扌(序列纟靶值, /):
...     return (靶值讠最短加链[靶值] for 靶值 in 序列纟靶值)
>>> def test_(*, fmt_case):
...     test4many_(趃靶值序列讠趃最短加链序列扌(range(1, 100 or len(靶值讠最短加链))), fmt_case=fmt_case)
>>> test_(fmt_case='stem_str')
[1]
[1~2]
[1~3]
[1~2~4]
[1~5]
[1~2~6]
[1~2~6~7]
[1~2~4~8]
[1~9]
[1~2~10]
[1~2~10~11]
[1~2~4~12]
[1~2~4~12~13]
[1~2~4~12~14]
[1~5~15]
[1~2~4~8~16]
[1~17]
[1~2~18]
[1~2~18~19]
[1~2~4~20]
[1~2~4~20~21]
[1~2~4~20~22]
[1~5~9~18~23]
[1~2~4~8~24]
[1~2~4~8~24~25]
[1~2~4~8~24~26]
[1~9~27]
[1~2~4~8~24~28]
[1~2~4~8~24~28~29]
[1~2~10~30]
[1~2~10~30~31]
[1~2~4~8~16~32]
[1~33]
[1~2~34]
[1~2~34~35]
[1~2~4~36]
[1~2~4~36~37]
[1~2~4~36~38]
[1~2~4~12~13~39]
[1~2~4~8~40]
[1~2~4~8~40~41]
[1~2~4~8~40~42]
[1~9~17~34~43]
[1~2~4~8~40~44]
[1~9~45]
[1~2~10~18~36~46]
[1~2~4~12~13~39~47]
[1~2~4~8~16~48]
[1~2~4~8~16~48~49]
[1~2~4~8~16~48~50]
[1~17~51]
[1~2~4~8~16~48~52]
[1~2~4~8~16~48~52~53]
[1~2~18~54]
[1~2~18~54~55]
[1~2~4~8~16~48~56]
[1~2~4~8~16~48~56~57]
[1~2~4~8~16~48~56~58]
[1~17~51~59]
[1~2~4~20~60]
[1~2~4~20~60~61]
[1~2~4~20~60~62]
[1~2~4~20~21~63]
[1~2~4~8~16~32~64]
[1~65]
[1~2~66]
[1~2~66~67]
[1~2~4~68]
[1~2~4~68~69]
[1~2~4~68~70]
[1~2~4~68~70~71]
[1~2~4~8~72]
[1~2~4~8~72~73]
[1~2~4~8~72~74]
[1~2~4~8~24~25~75]
[1~2~4~8~72~76]
[1~9~17~34~68~77]
[1~2~4~8~24~26~78]
[1~2~4~8~24~26~78~79]
[1~2~4~8~16~80]
[1~2~4~8~16~80~81]
[1~2~4~8~16~80~82]
[1~17~33~66~83]
[1~2~4~8~16~80~84]
[1~17~85]
[1~2~18~34~68~86]
[1~2~4~8~24~28~29~87]
[1~2~4~8~16~80~88]
[1~2~4~8~16~80~88~89]
[1~2~18~90]
[1~2~4~8~24~25~75~91]
[1~2~4~20~36~72~92]
[1~2~4~20~36~72~92~93]
[1~2~4~8~24~26~78~94]
[1~2~4~20~21~37~74~95]
[1~2~4~8~16~32~96]
[1~2~4~8~16~32~96~97]
[1~2~4~8~16~32~96~98]
[1~33~99]

>>> test_(fmt_case='dnzw_str')
[+]
[-]
[-^1]
[--]
[-^2]
[--^1]
[--^1-2]
[---]
[-^3]
[--^2]
[--^2-2]
[---^1]
[---^1-3]
[---^1-2]
[-^2-^1]
[----]
[-^4]
[--^3]
[--^3-2]
[---^2]
[---^2-3]
[---^2-2]
[-^2-1^2--2]
[----^1]
[----^1-4]
[----^1-3]
[-^3-^1]
[----^1-2]
[----^1-2-5]
[--^2-^1]
[--^2-^1-3]
[-----]
[-^5]
[--^4]
[--^4-2]
[---^3]
[---^3-3]
[---^3-2]
[---^1-3-^1]
[----^2]
[----^2-4]
[----^2-3]
[-^3-1^3--2]
[----^2-2]
[-^3-^2]
[--^2-1^2--2]
[---^1-3-^1-3^1]
[-----^1]
[-----^1-5]
[-----^1-4]
[-^4-^1]
[-----^1-3]
[-----^1-3-6]
[--^3-^1]
[--^3-^1-3]
[-----^1-2]
[-----^1-2-6]
[-----^1-2-5]
[-^4-^1-2^3]
[---^2-^1]
[---^2-^1-4]
[---^2-^1-3]
[---^2-3-^1]
[------]
[-^6]
[--^5]
[--^5-2]
[---^4]
[---^4-3]
[---^4-2]
[---^4-2-4]
[----^3]
[----^3-4]
[----^3-3]
[----^1-4-^1]
[----^3-2]
[-^3-1^3---3]
[----^1-3-^1]
[----^1-3-^1-6]
[-----^2]
[-----^2-5]
[-----^2-4]
[-^4-1^4--2]
[-----^2-3]
[-^4-^2]
[--^3-1^3--2]
[----^1-2-5-^1]
[-----^2-2]
[-----^2-2-6]
[--^3-^2]
[----^1-4-^1-3^1]
[---^2-1^2--2]
[---^2-1^2--2-6]
[----^1-3-^1-3^1]
[---^2-3-2^2--2]
[------^1]
[------^1-6]
[------^1-5]
[-^5-^1]


[1~2~4~20~21~37~74~95]
[---^2-3-2^2--2]
    [-0^0-0^0-0^2-3^0-2^2-0^0-2^0]







严序加链讠最短缩写文本纟递归婪溟链扌
严序加链巛最短缩写文本纟递归婪溟链扌

>>> def testZS4many_(趃纟最短加链, /, *, fmt_case):
...   for 最短加链 in 趃纟最短加链:
...     try:
...         最短缩写文本 = 严序加链讠最短缩写文本纟递归婪溟链扌(最短加链, fmt_case=fmt_case)
...     except Exception as exc:
...         raise Exception(exc, 最短加链)
...     _最短加链 = 严序加链巛最短缩写文本纟递归婪溟链扌(最短缩写文本, fmt_case=fmt_case)
...     assert _最短加链 == 最短加链, (最短加链, _最短加链, 最短缩写文本)
...     print(最短缩写文本)


>>> def testZS_(*, fmt_case):
...     testZS4many_(趃靶值序列讠趃最短加链序列扌(range(1, 100 or len(靶值讠最短加链))), fmt_case=fmt_case)
>>> testZS_(fmt_case='stem_str') #doctest: +ELLIPSIS
[1]
[1~2]
[1~3]
[1~2~4]
[1~5]
...
[1~2~4~20~21~37~74~95]
[1~2~4~8~16~32~96]
[1~2~4~8~16~32~96~97]
[1~2~4~8~16~32~96~98]
[1~33~99]
>>> testZS_(fmt_case='dnzw_str') #doctest: +ELLIPSIS
[+]
[-]
[-^1]
[--]
[-^2]
...
[---^2-3-2^2--2]
[------^1]
[------^1-6]
[------^1-5]
[-^5-^1]











py_adhoc_call   seed.math.power.addition_chain.shortest.rewrite3   @严序加链讠最短缩写文本纟递归婪溟链扌 --fmt_case:dnzw_str  ='(1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 1025, 2050, 3075, 4099, 8198, 11273, 19471, 38942, 50215)'
    '[-^10-^1-2^10--2-1--2]'

py_adhoc_call   seed.math.power.addition_chain.shortest.rewrite3   @f

]]]'''#'''
__all__ = r'''
乸递归婪溟链
    主线讠参数纟乸递归婪溟链扌
    主线巛次大数址引讠内点址距溟次扌
枚举冫递归婪溟链巛严序加链扌
    枚举冫缩写文本纟递归婪溟链巛严序加链扌
        缩写集文本纟递归婪溟链巛严序加链扌
            解读冫缩写集文本纟列表纟递归婪溟链扌

拆分冫缩写集文本纟列表纟递归婪溟链扌
合成冫缩写集文本纟序列纟递归婪溟链扌


严序加链讠最短缩写文本纟递归婪溟链扌
严序加链巛最短缩写文本纟递归婪溟链扌
    严序加链巛缩写文本纟递归婪溟链扌

Error__addition_chain_has_no_greedy_zpow_recur_shortest_stem
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
#.#################################
from seed.helper.lazy_import__func7context import mk_ctx4lazy_import4funcs_ #NOTE:not support "as"
with mk_ctx4lazy_import4funcs_(__name__):
    #.from itertools import islice
    from functools import cached_property

    from seed.tiny_.containers import mk_tuple
    from seed.tiny_.check import check_type_is, check_int_ge, check_all_
    from seed.math.power.addition_chain.common.indices import 严序加链讠址引讠列表纟双加数址引扌
    from seed.math.power.addition_chain.data.get_target_uint2may_len_optimal_addition_chain_ import 取冫靶值讠最小显链长扌, 靶值讠最小显链长扌
    #.from seed.helper.repr_input import repr_helper
___end_mark_of_excluded_global_names__0___ = ...

class Error__addition_chain_has_no_greedy_zpow_recur_shortest_stem(Exception):pass

class 乸递归婪溟链:
    '主要构造方式:枚举冫递归婪溟链巛严序加链扌'
    def 欤递归最短扌(sf, 靶值讠最小显链长=None, /):
        靶值讠最小显链长 = 靶值讠最小显链长 if not 靶值讠最小显链长 is None else 取冫靶值讠最小显链长扌()
        return all(显链长 == 靶值讠最小显链长[主干值] for 主干值, 显链长 in zip(reversed(sf.主线), reversed(sf.主线址引讠显链长)))


    def __init__(sf, 主线, 次大数址引讠内点溟次, 次大数址引讠内点址距, 次大数址引讠最大输出溟次, 主线址引讠显链长, /):
        args = (主线, 次大数址引讠内点溟次, 次大数址引讠内点址距, 次大数址引讠最大输出溟次, 主线址引讠显链长)
        args = mk_tuple(map(mk_tuple, args))
        sf._args = args
        sf._ok = False
        sf.validate()
    def __hash__(sf, /):
        return hash((type(sf), sf.缩写形式))
        return hash((type(sf), sf._args))
    def __eq__(sf, ot, /):
        if ot is sf:
            return True
        if not type(ot) is type(sf):
            return NotImplemented
        return ot.缩写形式 == sf.缩写形式
    #无用:__ascii__
    #.def __ascii__(sf, /):
    #.    return sf.to_stem_str_()
    def __str__(sf, /):
        return sf.to_stem_str_()
    def __repr__(sf, /):
        args = sf._args
        return f'乸递归婪溟链{args}'
    @cached_property
    def 缩写形式(sf, /):
        '-> 缩写形式/主线'
        #to_stem_str_
        缩写形式 = sf.主线
        #validate:
        if not 主线讠参数纟乸递归婪溟链扌(缩写形式) == sf._args:raise 000
        return 缩写形式
    @cached_property
    def 址距溟次形式(sf, /):
        '-> 址距溟次形式/次大数址引讠内点址距溟次/[(内点址距, 内点溟次)] # == [*zip(次大数址引讠内点址距, 次大数址引讠内点溟次)]'
        #to_dstn_zpow_pairs_-->to_dnzw_str_
        址距溟次形式 = 次大数址引讠内点址距溟次 = [*zip(sf.次大数址引讠内点址距, sf.次大数址引讠内点溟次)]
        if not sf.主线 == 主线巛次大数址引讠内点址距溟次扌(址距溟次形式):raise 000
        return 址距溟次形式
    @cached_property
    def 严序加链(sf, /):
        '-> 严序加链/[uint]'
        主线 = sf.主线
        us = [内点<<溟次 for 内点址引, 最大溟次 in enumerate(sf.次大数址引讠最大输出溟次) for 内点 in [主线[内点址引]] for 溟次 in range(1+最大溟次)]
        us.sort()
        us.append(主线[-1])
        严序加链 = tuple(us)
        return 严序加链
    @property
    def 主线(sf, /):
        return sf._args[0]
    @property
    def 次大数址引讠内点溟次(sf, /):
        return sf._args[1]
    @property
    def 次大数址引讠内点址距(sf, /):
        return sf._args[2]
    @property
    def 次大数址引讠最大输出溟次(sf, /):
        return sf._args[3]
    @property
    def 主线址引讠显链长(sf, /):
        return sf._args[4]
    def validate(sf, /):
        if sf._ok:
            return
        args = sf._args
        assert len(args) == 5
        (主线, 次大数址引讠内点溟次, 次大数址引讠内点址距, 次大数址引讠最大输出溟次, 主线址引讠显链长) = args
        assert len(主线)
        assert len(主线址引讠显链长) == len(主线)
        assert len(次大数址引讠内点溟次) == -1+len(主线)
        assert len(次大数址引讠内点址距) == -1+len(主线)
        assert len(次大数址引讠最大输出溟次) == -1+len(主线)
        check_all_([check_all_, [check_int_ge, 0]], args)

        assert 主线[0] == 1
        assert 主线址引讠显链长[0] == 0
        _次大数址引讠最大输出溟次 = [0]*(-1+len(主线))
        for k in range(1, len(主线)):
            靶值 = 主线[k]
            次大数址引 = k-1
            溟次 = 次大数址引讠内点溟次[次大数址引]
            内点址距 = 次大数址引讠内点址距[次大数址引]
            内点址引 = 次大数址引 -内点址距
            内点 = 主线[内点址引]
            次大数 = 主线[次大数址引]
            assert 靶值 == 次大数 + (内点<<溟次)
            内点溟次增量 = max(0, 溟次 - _次大数址引讠最大输出溟次[内点址引])
            _次大数址引讠最大输出溟次[内点址引] += 内点溟次增量
            assert 主线址引讠显链长[k] == 主线址引讠显链长[次大数址引] +1 +内点溟次增量
        assert 次大数址引讠最大输出溟次 == mk_tuple(_次大数址引讠最大输出溟次)
        sf.缩写形式#validate
        sf._ok = True
        sf.validate()

    @classmethod
    def 巛次大数址引讠内点址距溟次扌(cls, 次大数址引讠内点址距溟次, /):
        主线 = 主线巛次大数址引讠内点址距溟次扌(次大数址引讠内点址距溟次)
        return cls.巛主线扌(主线)
    @classmethod
    def 巛主线扌(cls, 主线, /):
        args = 主线讠参数纟乸递归婪溟链扌(主线)
        sf = cls(*args)
        return sf
    @classmethod
    def from_stem_str_(cls, s, /, *, validate=True):
        check_type_is(str, s)
        if not len(s) >= 3:raise ValueError(s)
        if not (s[:2] == '[1' and s[-1] == ']'):raise ValueError(s)
        主线 = tuple(int(s4u, 10) for s4u in s[1:-1].split('~'))
        sf = cls.巛主线扌(主线)
        if validate:
            if not (_s:=sf.to_stem_str_(validate=False)) == s:raise ValueError(s, _s)
        return sf
    def to_stem_str_(sf, /, *, validate=True):
        主线 = sf.缩写形式
        s = str(list(主线)).replace(', ', '~')
        if validate:
            #if not (_主线:=type(sf).from_stem_str_(s, validate=False).主线) == 主线:raise ValueError(sf, _主线, s)
            if not (_args:=type(sf).from_stem_str_(s, validate=False)._args) == sf._args:raise ValueError(sf._args, _args, s)
        return s
    @classmethod
    def from_dnzw_str_(cls, s, /, *, validate=True):
        check_type_is(str, s)
        if not len(s) >= 3:raise ValueError(s)
        if not ((s[:2] == '[-' and s[-1] == ']') or s == '[+]'):raise ValueError(s)
        #次大数址引讠内点址距溟次 = tuple(tuple(int(s4u, 10) for s4u in s4dz.split('^')) for s4dz in s[2:-1].split('-')) if not s == '[-]' else ()
        def _5_s4u(s4u, /):
            return 0 if not s4u else int(s4u, 10)
        def _5_s4dz(s4dz, /):
            #if not s4dz: return (0, 0)
            ss = s4dz.split('^')
            if not len(ss) == 2:
                ss.append('')
            if not len(ss) == 2:raise ValueError(s, s4dz)
            (d, z) = map(_5_s4u, ss)
            return (d, z)
        #次大数址引讠内点址距溟次 = tuple(_5_s4dz(s4dz) for s4dz in s[2:-1].split('-')) if not s == '[-]' else ()
        次大数址引讠内点址距溟次 = tuple(_5_s4dz(s4dz) for s4dz in s[2:-1].split('-')) if not s == '[+]' else ()
        sf = cls.巛次大数址引讠内点址距溟次扌(次大数址引讠内点址距溟次)
        if validate:
            if not (_s:=sf.to_dnzw_str_(validate=False)) == s:raise ValueError(s, _s)
        return sf
    def to_dnzw_str_(sf, /, *, validate=True):
        次大数址引讠内点址距溟次 = sf.址距溟次形式
        s = '-'.join(f'{d}^{z}' for d, z in 次大数址引讠内点址距溟次)
        s = f'[-{s}]'
        s = s.replace('^0', '')
        s = s.replace('-0', '-')
        s = '[+]' if not 次大数址引讠内点址距溟次 else s
        if validate:
            if not (_args:=type(sf).from_dnzw_str_(s, validate=False)._args) == sf._args:raise ValueError(sf._args, _args, s)
        return s
    @classmethod
    def from_xxx_strCT_(cls, fmt_case, /):
        check_type_is(str, fmt_case)
        match fmt_case:
            case 'stem_str' | '':
                from_xxx_strC_ = cls.from_stem_str_
            case 'dnzw_str':
                from_xxx_strC_ = cls.from_dnzw_str_
            case _:
                raise ValueError('unknown fmt_case:', fmt_case)
            #case
        from_xxx_strC_
        return from_xxx_strC_
    @classmethod
    def to_xxx_strCT_(cls, fmt_case, /):
        check_type_is(str, fmt_case)
        match fmt_case:
            case 'stem_str' | '':
                to_xxx_strC_ = cls.to_stem_str_
            case 'dnzw_str':
                to_xxx_strC_ = cls.to_dnzw_str_
            case _:
                raise ValueError('unknown fmt_case:', fmt_case)
            #case
        to_xxx_strC_
        return to_xxx_strC_
    def to_xxx_str_(sf, fmt_case, /):
        to_xxx_str_ = type(sf).to_xxx_strCT_(fmt_case)
        return to_xxx_str_(sf)

def 主线巛次大数址引讠内点址距溟次扌(次大数址引讠内点址距溟次, /):
    '[(内点址距, 内点溟次)] -> 主线'
    主线 = [1]
    for 次大数址引, (内点址距, 内点溟次) in enumerate(次大数址引讠内点址距溟次):
        内点址引 = 次大数址引 -内点址距
        内点 = 主线[内点址引]
        次大数 = 主线[次大数址引]
        靶值 = 次大数 + (内点<<内点溟次)
        主线.append(靶值)
    主线 = tuple(主线)
    return 主线
def 主线讠参数纟乸递归婪溟链扌(主线, /):
    主线 = 主线址引讠主线值 = m2u = mk_tuple(主线)
    assert 主线[0] == 1
    check_all_([check_int_ge, 0], 主线)
    主线值讠主线址引 = u2m = {u:m for m,u in enumerate(m2u)}
    次大数址引讠内点溟次 = []
    次大数址引讠内点址距 = []
    _次大数址引讠最大输出溟次 = [0]*(-1+len(主线))
    主线址引讠显链长 = [0]
    for k in range(1, len(主线)):
        靶值 = 主线[k]
        次大数址引 = k-1
        次大数 = 主线[次大数址引]
        内点溟化值 = 靶值 -次大数
        内点 = 内点溟化值
        777;溟次 = 0
        while None is (内点址引:=主线值讠主线址引.get(内点)):
            if not (内点 and 0==(内点&1)):
                raise ValueError('非 递归婪溟链.主线:', 主线)
            内点 >>= 1
            777;溟次 += 1
        内点址引
        assert 0 <= 内点址引 <= 次大数址引
        assert 1 <= 内点 <= 次大数
        assert 内点 == 主线[内点址引]
        assert 靶值 == 次大数 + (内点<<溟次)
        内点址距 = 次大数址引 -内点址引
        次大数址引讠内点溟次.append(溟次)
        次大数址引讠内点址距.append(内点址距)

        内点溟次增量 = max(0, 溟次 - _次大数址引讠最大输出溟次[内点址引])
        _次大数址引讠最大输出溟次[内点址引] += 内点溟次增量
        主线址引讠显链长.append(主线址引讠显链长[次大数址引] +1 +内点溟次增量)
    次大数址引讠内点溟次 = mk_tuple(次大数址引讠内点溟次)
    次大数址引讠内点址距 = mk_tuple(次大数址引讠内点址距)
    次大数址引讠最大输出溟次 = mk_tuple(_次大数址引讠最大输出溟次)
    主线址引讠显链长 = mk_tuple(主线址引讠显链长)

    args = (主线, 次大数址引讠内点溟次, 次大数址引讠内点址距, 次大数址引讠最大输出溟次, 主线址引讠显链长)
    return args
def 解读冫缩写集文本纟列表纟递归婪溟链扌(缩写集文本, /, *, fmt_case):
    '缩写集文本纟列表纟递归婪溟链/str -> [乸递归婪溟链]'
    return tuple(map(乸递归婪溟链.from_xxx_strCT_(fmt_case), 拆分冫缩写集文本纟列表纟递归婪溟链扌(缩写集文本)))
def 拆分冫缩写集文本纟列表纟递归婪溟链扌(缩写集文本, /):
    '缩写集文本纟列表纟递归婪溟链/str -> [缩写文本纟递归婪溟链/str]'
    列表纟缩写文本 = tuple([] if 缩写集文本 == '[]' else 缩写集文本.replace(':', ']:[').split(':'))
    return 列表纟缩写文本
def 合成冫缩写集文本纟序列纟递归婪溟链扌(序列纟缩写文本纟递归婪溟链, /):
    '序列纟缩写文本纟递归婪溟链/Iter 缩写文本纟递归婪溟链/str -> 缩写集文本纟列表纟递归婪溟链/str'
    s = ''.join(序列纟缩写文本纟递归婪溟链)
    缩写集文本 = '[]' if not s else s.replace('][', ':')
    return 缩写集文本
def 缩写集文本纟递归婪溟链巛严序加链扌(严序加链, /, *, fmt_case, to_raise_if_none=False):
    '严序加链 -> 缩写集文本纟递归婪溟链/str'
    it = 枚举冫缩写文本纟递归婪溟链巛严序加链扌(严序加链, fmt_case=fmt_case, to_raise_if_none=to_raise_if_none)
    #ls = sorted(it)
    缩写集文本 = 合成冫缩写集文本纟序列纟递归婪溟链扌(it)
    return 缩写集文本
def 枚举冫缩写文本纟递归婪溟链巛严序加链扌(严序加链, /, *, fmt_case, to_raise_if_none=False):
    '严序加链 -> Iter 缩写文本纟递归婪溟链/str'
    return map(乸递归婪溟链.to_xxx_strCT_(fmt_case), 枚举冫递归婪溟链巛严序加链扌(严序加链, to_raise_if_none=to_raise_if_none))
def 枚举冫递归婪溟链巛严序加链扌(严序加链, /, *, to_raise_if_none=False):
    '严序加链 -> Iter 递归婪溟链 | ^Error__addition_chain_has_no_greedy_zpow_recur_shortest_stem if to_raise_if_none  # [递归婪溟链 == 乸递归婪溟链(主线/[uint]{len>=1}, 次大数址引讠内点溟次/[uint]{len==-1+len(主线)}, 次大数址引讠内点址距/[uint], 次大数址引讠最大输出溟次/[uint], 主线址引讠显链长)][内点址距:=次大数址引-内点址引][若非主线则必支线:即溟化值]'
    L = len(严序加链)
    assert 严序加链[0] == 1
    k2jis = 严序加链讠址引讠列表纟双加数址引扌(严序加链)
    k2u = 严序加链
    主线值讠主线址引 = u2m = {1:0}
    内点溟化值讠内点主线址引辻溟次 = u2m_ez = {1:(0, 0)}
    主线 = 主线址引讠主线值 = m2u = [1]
    次大数址引讠内点溟次 = []
    次大数址引讠内点址距 = []
    次大数址引讠最大输出溟次 = []
    主线址引讠显链长 = [0]
    args = (主线, 次大数址引讠内点溟次, 次大数址引讠内点址距, 次大数址引讠最大输出溟次, 主线址引讠显链长)
    total = 0
    def recur_iter_(ok, k, /):
        nonlocal total
        assert k > 0
        if k == L:
            if ok:
                yield 乸递归婪溟链(*args)
                total += 1
            return

        uk = 严序加链[k]
        (j, i) = k2jis[k][-1]
        if j == i:
            #uk 作为 支线值/溟化值
            uj = k2u[j]
            assert uk == (uj<<1)
            (内点主线址引, 溟次) = 内点溟化值讠内点主线址引辻溟次[uj]
            内点溟化值讠内点主线址引辻溟次[uk] = (内点主线址引, 1+溟次)
            yield from recur_iter_(False, 1+k)
            del 内点溟化值讠内点主线址引辻溟次[uk]
        for j, i in reversed(k2jis[k]):
            #uk 作为 主线值
            if k2u[j] == 主线[-1]:
                (_j, _i) = (j, i)
            elif k2u[i] == 主线[-1]:
                (_j, _i) = (i, j)
            else:
                continue
            靶值 = uk
            次大数 = 主线[-1] # k2u[_j]
            内点溟化值 = k2u[_i]
            (内点主线址引, 溟次) = 内点溟化值讠内点主线址引辻溟次[内点溟化值]
            内点 = 主线[内点主线址引]
            assert 靶值 == 次大数 + (内点<<溟次)
            if not 内点 <= 次大数:raise 000
            次大数主线址引 = len(次大数址引讠内点溟次)
            内点址距 = 次大数主线址引 -内点主线址引
            assert 内点址距 >= 0
            if 内点 < 次大数 and 溟次 == 0 and 次大数 == (内点<<内点址距):
                # [靶值 == 内点*(1+2**内点址距)]
                # [靶值 == (次大数:=内点*2**内点址距) +(内点<<0)]
                # 忽略，因为已有:
                # [靶值 == (次大数:=内点) +(内点<<内点址距)]
                continue
            显链长纟次大数 = 主线址引讠显链长[次大数主线址引]
            靶值主线址引 = len(主线)


            主线值讠主线址引[uk] = 靶值主线址引
            内点溟化值讠内点主线址引辻溟次[uk] = (靶值主线址引, 0)
            主线.append(uk)
            次大数址引讠内点溟次.append(溟次)
            次大数址引讠内点址距.append(内点址距)
            次大数址引讠最大输出溟次.append(0)
            777;内点溟次增量 = max(0, 溟次 - 次大数址引讠最大输出溟次[内点主线址引])
            #xxx:assert not 内点溟次增量
            ##xxx:if 内点溟次增量:内点溟化值讠内点主线址引辻溟次.update...
            主线址引讠显链长.append(显链长纟次大数+1+内点溟次增量)
            777;次大数址引讠最大输出溟次[内点主线址引] += 内点溟次增量

            yield from recur_iter_(True, 1+k)
            777;次大数址引讠最大输出溟次[内点主线址引] -= 内点溟次增量
            主线址引讠显链长.pop()
            次大数址引讠最大输出溟次.pop()
            次大数址引讠内点址距.pop()
            次大数址引讠内点溟次.pop()
            主线.pop()
            del 内点溟化值讠内点主线址引辻溟次[uk]
            del 主线值讠主线址引[uk]

    #end-def recur_iter_(ok, k, /):
    def main0():
        return recur_iter_(True, 1)
    def main1():
        r = yield from main0()
        if 0 == total:raise Error__addition_chain_has_no_greedy_zpow_recur_shortest_stem(严序加链)
        return r
    main = main1 if to_raise_if_none else main0
    return main()
    #.u2j_ez = {}
    #.j = 1
    #.for j in range(1, L):
    #.    u = 严序加链[j]
    #.    if (u&1) == 0 and (j_ez:=u2j_ez.get(u>>1)):
    #.        溟化值 = u
    #.        (_j, ez) = j_ez
    #.        u2j_ez[u] = (_j, 1+ez)
    #.        次大数址引讠最大输出溟次 = [_j] += 1
    #.    else:
    #.        靶值 = u
    #.        次大数 = 主线[-1]
    #.    yield 乸递归婪溟链(主线, 次大数址引讠内点溟次, 次大数址引讠内点址距, 次大数址引讠最大输出溟次, 主线址引讠显链长)

def 严序加链讠最短缩写文本纟递归婪溟链扌(严序加链, /, *, fmt_case):
    '严序加链 -> 最短缩写文本纟递归婪溟链/str | ^Error__addition_chain_has_no_greedy_zpow_recur_shortest_stem # [fmt_case == ("stem_str" | "dnzw_str")]'
    it = 枚举冫缩写文本纟递归婪溟链巛严序加链扌(严序加链, fmt_case=fmt_case, to_raise_if_none=True)
        #^Error__addition_chain_has_no_greedy_zpow_recur_shortest_stem
    最短缩写文本 = min(it, key=len)
        #avoided: ^ValueError: min() arg is an empty sequence
    return 最短缩写文本
def 严序加链巛缩写文本纟递归婪溟链扌(缩写文本, /, *, fmt_case):
    '缩写文本纟递归婪溟链/str -> 严序加链'
    递归婪溟链 = 乸递归婪溟链.from_xxx_strCT_(fmt_case)(缩写文本)
    return 递归婪溟链.严序加链
严序加链巛最短缩写文本纟递归婪溟链扌 = 严序加链巛缩写文本纟递归婪溟链扌

__all__
from seed.math.power.addition_chain.shortest.rewrite3 import 枚举冫递归婪溟链巛严序加链扌, 枚举冫缩写文本纟递归婪溟链巛严序加链扌, 缩写集文本纟递归婪溟链巛严序加链扌, 解读冫缩写集文本纟列表纟递归婪溟链扌

from seed.math.power.addition_chain.shortest.rewrite3 import 乸递归婪溟链, 主线讠参数纟乸递归婪溟链扌

from seed.math.power.addition_chain.shortest.rewrite3 import 拆分冫缩写集文本纟列表纟递归婪溟链扌, 合成冫缩写集文本纟序列纟递归婪溟链扌

from seed.math.power.addition_chain.shortest.rewrite3 import 枚举冫递归婪溟链巛严序加链扌

from seed.math.power.addition_chain.shortest.rewrite3 import 严序加链讠最短缩写文本纟递归婪溟链扌, 严序加链巛缩写文本纟递归婪溟链扌#严序加链巛最短缩写文本纟递归婪溟链扌
#.def 严序加链讠最短缩写文本纟递归婪溟链扌(严序加链, /, *, fmt_case):
#.    '严序加链 -> 最短缩写文本纟递归婪溟链/str | ^Error__addition_chain_has_no_greedy_zpow_recur_shortest_stem # [fmt_case == ("stem_str" | "dnzw_str")]'

from seed.math.power.addition_chain.shortest.rewrite3 import *
