#__all__:goto
#__main__:goto
#cmds:goto
r'''[[[[[
e ../../python3_src/nn_ns/CJK/cjk_subsets/hanzi.py

py -m nn_ns.app.debug_cmd   nn_ns.CJK.cjk_subsets.hanzi -x



[[
deprecated:
    cjk_common_subset_2513_nontrivial_TS_286
    cjk_common_subset_1869_nontrivial_TS_238
    cjk_common_subset_2513_trivial_TS_2227/平凡繁简囗共享汉字字集
    cjk_common_subset_1869_trivial_TS_1631/平凡繁简囗初步缩减囗共享汉字字集
now using:
    cjk_common_subset_2513_trivial_TS_2230
    cjk_common_subset_1869_trivial_TS_1632
]]


字汇
    收集各种字汇，并直接列出，供人眼浏览、程序搜索
    注意:可能含空格、换行
        ，见『hz_sp_str2hz_str』
    注意:大多是无序的字集，但部分有序
        ，如：『汉字单字字频总表_cedict_12041』
        ，如：『按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字』
        ，如：『一百零六部平水韵韵目』
    注意:可能含重复汉字
        ，见『hz_sp_str2hz_set』
    注意:大多是不重复的字集，但部分有重复字
        如：『中华字经2003__重复字4000_不同字3980』


[[[
中华字经2003
    不记标题的内容:
        共4000个重复字
        共3980个不同字

通用规范汉字表2013
    *一级字表（3500字）
    *二级字表（3000字）
    *三级字表（1605字）
    （共计8105字）

GB2312-1980
    *共收录 6763 个汉字
        *一级汉字 3755 个
        *二级汉字 3008 个
        NOTE: GB2312::55区90-94未编码
            GB2312::汉字 = [16..87]*[1..94] - [55]*[90..94]
                total = (87-16+1)*94 - 5 = 6763
            6763=(88-16)*94-5
            3755=(56-16)*94-5
            3008=(88-56)*94
    *同时收录了包括拉丁字母、希腊字母、日文平假名及片假名字母、俄语西里尔字母在内的 682个字符
gbk
    共收入 21886 个汉字和图形符号，包括：
        *GB 2312 中的全部汉字、非汉字符号。
        *BIG5 中的全部汉字。
        *与 ISO 10646 相应的国家标准 GB 13000 中的其它 CJK 汉字
        #以上合计 20902 个汉字。
        *其它汉字、部首、符号，共计 984 个。
    view ../lots/NOTE/unicode/cjk/汉字区.txt
        20902 => [4E00..=9FA5] 一龥
        初版统合码:唯二汉字区:一龥豈鶴
            一龥:归并区
            豈鶴:兼容区
            view ../../python3_src/seed/text/unicode/constant.py


汉字单字字频总表_cedict_12041

cjk_common_subset_2513
    # cjk_part of (big5&cp949&gb2312&iso2022_jp)
    # 2513
    see:
        seed.text.charset_filter
        nn_ns.CJK.cjk_subsets.cjk_subsets__relationship
            cjk_subsets__relationship.py.result.txt
        nn_ns.CJK.cjk_subsets.cjk_common_subset
    =====
    py -m seed.text.charset_filter -o ~/tmp/cjk_d.txt -f > ~/tmp/cjk_pr2.txt
    py -m nn_ns.CJK.cjk_subsets.cjk_subsets__relationship -i ~/tmp/cjk_d.txt -o  ~/tmp/cjk_rel.txt -f -o2  ~/tmp/cjk_rel_more.txt -f2 > ~/tmp/cjk_rel_more__le.txt
    py -m nn_ns.CJK.cjk_subsets.cjk_common_subset


cjk_common_subset_1869
    =[def]= 交集 of:
        cjk_common_subset_2513
        中华字经2003__重复字4000_不同字3980
        通用规范汉字表2013_一级字3500
        gb2312_1980_一级汉字3755
        汉字单字字频总表_cedict_12041
    see:
        ._test_cjk_common_subset_2513


[[[
修正简繁字对集后囗副作用
    囗修正简繁字对集后囗副作用囗平凡自反共享汉字增加囗:goto
===
简繁字对集
简繁字对 数据有毛病
修正后，cjk_common_subset_2513_trivial_TS_2227 应当补上: [珊淙瑙]
===
grep '[珊淙瑙]' -r ../../python3_src/nn_ns/CJK/ -a -l

view  ../../python3_src/nn_ns/CJK/CJK_data/汉字繁简囗囗平凡自反囗唯一可逆.py
view  ../../python3_src/nn_ns/CJK/CJK_data/汉字繁简.py
view  ../../python3_src/nn_ns/CJK/CJK_data/raw/汉字繁简.py
view ../../python3_src/nn_ns/CJK/CJK_data/output/parse_繁简.py.out/简繁.txt
    简繁字对 数据有毛病
    修正后，cjk_common_subset_2513_trivial_TS_2227 应当补上: [珊淙瑙]
view ../../python3_src/nn_ns/CJK/CJK_data/raw/简繁字信息对比/简繁字信息对比.py.显示消除非平凡繁简属性字后的1869与2513.out.txt
view  ../../python3_src/nn_ns/CJK/cjk_subsets/hanzi.py
]]]

#进一步缩水，除去 非平凡繁简字
cjk_common_subset_2513_nontrivial_TS_286
    # [deprecated by 修正简繁字对集后囗副作用]
    =[def]= cjk_common_subset_2513 /-\ 非平凡繁简字
    == ....out.txt::cjk_common_subset_2513__TS_hz286
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/简繁字信息对比/简繁字信息对比.py.显示消除非平凡繁简属性字后的1869与2513.out.txt
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/简繁字信息对比/简繁字信息对比.py
        #非平凡繁简字 来源: 部分自己搜集+Unihan-ver13_0

cjk_common_subset_2513_trivial_TS_2230
    #new-ver after fixed 简繁字对集
    #2230比2227增加『珊淙瑙』
cjk_common_subset_2513_trivial_TS_2227
    # [deprecated by 修正简繁字对集后囗副作用]
    =[def]= cjk_common_subset_2513 \-\ 非平凡繁简字
    == cjk_common_subset_2513 - cjk_common_subset_2513_nontrivial_TS_286
    == ....out.txt::cjk_common_subset_2513__removed_TS_hz286__2227


cjk_common_subset_1869_nontrivial_TS_238
    # [deprecated by 修正简繁字对集后囗副作用]
    =[def]= cjk_common_subset_1869 /-\ 非平凡繁简字
    == cjk_common_subset_1869 /-\ cjk_common_subset_2513_nontrivial_TS_286
    == ....out.txt::cjk_common_subset_1869__TS_hz238


cjk_common_subset_1869_trivial_TS_1632
    #new-ver after fixed 简繁字对集
    #1632比1631增加『珊』
cjk_common_subset_1869_trivial_TS_1631
    # [deprecated by 修正简繁字对集后囗副作用]
    =[def]= cjk_common_subset_1869 \-\ 非平凡繁简字
    == cjk_common_subset_1869 - cjk_common_subset_1869_nontrivial_TS_238
    == ....out.txt::cjk_common_subset_1869__removed_TS_hz238__1631


释名:
    cjk_common_subset_2513/共享汉字字集
    cjk_common_subset_1869/初步缩减囗共享汉字字集
    cjk_common_subset_2513_trivial_TS_2230
        cjk_common_subset_2513_trivial_TS_2227/平凡繁简囗共享汉字字集
    cjk_common_subset_1869_trivial_TS_1632
        cjk_common_subset_1869_trivial_TS_1631/平凡繁简囗初步缩减囗共享汉字字集



#用汉字前几笔的笔顺码编码二进制
    #   8bit 256字 方案 没找到 <= cjk_common_subset_2513
    #   以下其他方案 <= cjk_common_subset_1869_trivial_TS_1631
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/用汉字表达二进制/结果速报.txt
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/用汉字表达二进制/repr_binary_by_hz_stroke_kind.py
    8bit 256字 方案没找到
    4bit 16字 方案很多
        4笔*1bit每笔 的 方案，选一:
            按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字 = '羽立六井太左共而木手父介仁少行血'
            #14_23__sp5
        2笔*2bit每笔 的 方案，选一:
            按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字 = '二大至丁乞反人川亡羊之祖口小光山'
            #1_3_4_2__sp5

    6bit 方案:
        6笔*1bit每笔 的 方案，选一:
            按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字 = '泣汗江洪浮浴沙派廊唐廉度底店府刑捧扶持描授扮拍拙茫芋苔茸草芥芹花膀旱是最昌晃昭易忿坐企斧肖竹敞盆信位停偏佳佐供僧伶件俗蜀伯悠循催'
            #14_23__sp5



#高稳定度汉字字集
    用于编码数据，要求:
        + 能被任何汉字编码方案所支持，不被自动替换成缺省字符
        + 任意组合不产生敏感词(日期)，不被屏蔽
        + 繁简唯一可逆(繁简择一)或平凡自反(同时繁简)，不被自动窜改
        + 无变体字(异体字、形近字、同义字、繁简字)，确保人工抄录误码率低
        + 若有可能，再除去 罕见字(罕用字/生僻字)/古今字/通假字/多音字/兼容字(即：是某个unicode字符正态规范分解后的原字)。


    * 第一版 86+256=342字:
        高稳定度汉字字集囗第一版囗高频八十六字
        高稳定度汉字字集囗第一版囗低频二百五十六字
        ====
        view ../../python3_src/script/char/common_CJK/[common_CJK]ReadMe.txt
        见『汉字单字字频总表_cedict_12041』
            搜:/[矣郡茵檄竺笙蒡嚆]
            86字 比 256字 高频
            字汇内部按频度由高至低排序

    * 第二版 3+256=259字:
        高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字
            #可用『爻勺竺』作为括号或转义符与分隔符(空格符/逗号)
        ====
        [[为什么又有第二版？
            后来才发现 第一版 包含『巳』，可见之前搜集到的形近字很不完整。
            以 第一版 为底本，进行删减。
            * 生僻字也无妨，但笔画不要太多
            * 字集 内部 不要含 形近字，或 大偏旁一样的字；外部 不要有 形近的常用字
            * 『病字框』看起来像广告，也去掉。
            * 保留 257 字以上，以方便转义提供带外信息。
        ]]
        ====
        view ../../python3_src/nn_ns/CJK/CJK_data/raw/用汉字编码数据/高稳定度汉字字集.py
            见:__doc__上方的『2/3个主要输出对象的解释』
        ====

    * 第三版 5+256=261字:
        高稳定度汉字字集囗第三版囗码序囗二百六十一字
            # 由于字数不充裕，不再试图除去 形近字，古今字
        ====
        [[为什么又有第三版？
            之前第一版的敏感词没有保存，又重新收集了。
        ]]
        ====




unihan_kIICore_levelA_common_hz_str__U13_0___2143
    =[def]= 交集 of:
        hz-set of level-A
        hz-set of any-source
    ######################
    view /sdcard/0my_files/unzip/e_book/unicode_13__Unihan/Unihan_IRGSources.txt
        # Unihan_IRGSources.txt
        # Date: 2020-02-18 18:27:33 GMT [JHJ]
        # Unicode version: 13.0.0
    view ../../python3_src/nn_ns/CJK/unicode/ucd_unihan/unihan/parse__kIICore8Unihan_IRGSources_txt.py
        view ../../python3_src/nn_ns/CJK/unicode/ucd_unihan/unihan/dump_load___parsed_result__of__kIICore8Unihan_IRGSources_txt.py
    view ../lots/NOTE/unicode/note4UnicodeStandard_14_0_annex/unicode_ver14_0_UAX31_UAX38摘要.txt
    ===
    kIICore
    Syntax        [ABC][GHJKMPT]{1,7}
    Description   Used for characters which are in IICore, the IRG-produced minimal set of required ideographs for East Asian use. A character is in IICore if and only if it has a value for the kIICore field.
    Each value consists of a letter (A, B, or C), indicating priority value, and one or more letters (G, H, J, K, M, P, or T), indicating source. The source letters are the same as used for IRG sources, except that "P" is used instead of "KP".



unihan_kUnihanCore2020_common_hz_str__U13_0___2573
    =[def]= 交集 of:
        hz-set of any-source
    ######################
    view /sdcard/0my_files/unzip/e_book/unicode_13__Unihan/Unihan_DictionaryLikeData.txt
        # Unihan_DictionaryLikeData.txt
        # Date: 2020-02-18 18:27:33 GMT [JHJ]
        # Unicode version: 13.0.0
    view ../../python3_src/nn_ns/CJK/unicode/ucd_unihan/unihan/parse__kUnihanCore20208Unihan_DictionaryLikeData_txt.py
        view ../../python3_src/nn_ns/CJK/unicode/ucd_unihan/unihan/dump_load___parsed_result__of__kUnihanCore20208Unihan_DictionaryLikeData_txt.py
    view ../lots/NOTE/unicode/note4UnicodeStandard_14_0_annex/unicode_ver14_0_UAX31_UAX38摘要.txt
    ===
    kUnihanCore2020
    Syntax          [GHJKMPT]{1,7}
    Description     Used for characters which are in the UnihanCore2020 set, the minimal set of required ideographs for East Asia. A character is in the UnihanCore2020 set if and only if it has a value for the kUnihanCore2020 property.

    The property value consists of one or more letters (G, H, J, K, M, P, or T), indicating source. The source letters are the same as used for IRG sources, except that P is used instead of the two-letter sequence KP.


一百零六部平水韵韵目
    view ../../python3_src/nn_ns/CJK/CJK_data/raw/一百零六部平水韵.txt
    ===
    韵目名下列字有点复杂:多音字+多繁一简=>一字多部
        因此，尚未整理
    ===
    可用作 序数:曾用于电报，表示月中第几日
        『元』:平水韵韵目-序号13-用于电报月中日序
        『筱』:平水韻韻目名，列上聲第十七，故舊時亦用作每月十七日的代稱。

    ===
    平水韵:两版:
      * 106部平水韵:上聲“迥”、“拯”並為一部；去聲“徑”、“征”並為一部
        #上声二十四迥
        #去声二十五径?『下平十蒸』才含『征』字
        =上平+下平+上声+去声+入声
        =15+15+29+30+17
        =106
      * 107部平水韵:上聲“迥”、“拯”不並
    ===




共享汉字字集牜简繁覆盖扩增
    =[def]= 共享汉字字集+简繁覆盖扩增字集
    ######################
    5455 # cjk_common_subset_TS_covered_extension_5455/共享汉字字集牜简繁覆盖扩增
        ==:
        + 2513 # cjk_common_subset_2513/共享汉字字集
                # cjk_part of (big5&cp949&gb2312&iso2022_jp)
        + 2942 # cjk_TS_covered_extension_of_cjk_common_subset_2942/简繁覆盖扩增字集纟共享汉字字集
                # 同一抽象字符 以繁体或简体出现在四个基本汉字编码中(big5&cp949&gb2312&iso2022_jp)
    ######################
    cp -iv script/收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地.py ../../python3_src/nn_ns/CJK/cjk_subsets/收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地-20241213.py
    view ../../python3_src/nn_ns/CJK/cjk_subsets/收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地-20241213.py
    ######################

]]]


=============
=============
from nn_ns.CJK.cjk_subsets.hanzi import (
vs__hz_sp_str8set
sorted_hz_str5set_intersect4hz_sp_str
sorted_hz_str5set_diff4hz_sp_str
hz_sp_str2hz_str
hz_sp_str2hz_set
hz_set2sorted_hz_str
filter_hzs_by_
)

from nn_ns.CJK.cjk_subsets.hanzi import (
中华字经2003__重复字4000_不同字3980
通用规范汉字表2013_一级字3500
通用规范汉字表2013_二级字3000
通用规范汉字表2013_三级字1605
gb2312_1980_一级汉字3755
gb2312_1980_二级汉字3008
汉字单字字频总表_cedict_12041
cjk_common_subset_2513
cjk_common_subset_1869
cjk_common_subset_2513_trivial_TS_2230
cjk_common_subset_1869_trivial_TS_1632
    cjk_common_subset_2513_trivial_TS_2227
    cjk_common_subset_1869_trivial_TS_1631
按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字
按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字
按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字
高稳定度汉字字集囗第一版囗高频八十六字
高稳定度汉字字集囗第一版囗低频二百五十六字
高稳定度汉字字集囗第一版囗降频囗三百四十二字
高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字
高稳定度汉字字集囗第三版囗码序囗二百六十一字
unihan_kIICore_levelA_common_hz_str__U13_0___2143
unihan_kUnihanCore2020_common_hz_str__U13_0___2573
一百零六部平水韵韵目_上平15_下平15_上声29_去声30_入声17__106
cjk_TS_covered_extension_of_cjk_common_subset_2942
cjk_common_subset_TS_covered_extension_5455
)

from nn_ns.CJK.cjk_subsets.hanzi import (
cjk_common_subset_2513
    共享汉字字集
cjk_common_subset_1869
    初步缩减囗共享汉字字集
cjk_common_subset_2513_trivial_TS_2230
    cjk_common_subset_2513_trivial_TS_2227
        平凡繁简囗共享汉字字集
cjk_common_subset_1869_trivial_TS_1632
    cjk_common_subset_1869_trivial_TS_1631
        平凡繁简囗初步缩减囗共享汉字字集
cjk_TS_covered_extension_of_cjk_common_subset_2942
    简繁覆盖扩增字集纟共享汉字字集
    已补全耂简繁对照纟简繁覆盖扩增字集纟共享汉字字集
cjk_common_subset_TS_covered_extension_5455
    共享汉字字集牜简繁覆盖扩增
)

from nn_ns.CJK.cjk_subsets.hanzi import (
按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字
    hz_initial_4strokes_as_4bits_by_grouping_14_23__sp5___digits_16
按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字
    hz_initial_2strokes_as_4bits_by_grouping_1_3_4_2__sp5___digits_16
按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字
    hz_initial_6strokes_as_6bits_by_grouping_14_23__sp5___digits_64
)

from nn_ns.CJK.cjk_subsets.hanzi import (
高稳定度汉字字集囗第一版囗高频八十六字
    stable_hz_set_ver1__high_86
高稳定度汉字字集囗第一版囗低频二百五十六字
    stable_hz_set_ver1__low_256
高稳定度汉字字集囗第一版囗降频囗三百四十二字
    stable_hz_set_ver1__reversed_freq__342

高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字
    stable_hz_set_ver2__excludeILL__reversed_freq__259
高稳定度汉字字集囗第三版囗码序囗二百六十一字
    stable_hz_set_ver3__sorted__261
)

from nn_ns.CJK.cjk_subsets.hanzi import (
cjk_common_subset_2513_nontrivial_TS_286
cjk_common_subset_1869_nontrivial_TS_238
)

from nn_ns.CJK.cjk_subsets.hanzi import (
一百零六部平水韵韵目_上平15_下平15_上声29_去声30_入声17__106
    一百零六部平水韵韵目_上平15
    一百零六部平水韵韵目_下平15
    一百零六部平水韵韵目_上声29
    一百零六部平水韵韵目_去声30
    一百零六部平水韵韵目_入声17
)


====
py -m nn_ns.app.debug_cmd   nn_ns.CJK.cjk_subsets.hanzi -x
py -m nn_ns.CJK.cjk_subsets.hanzi
py others/汉语/hanzi.py > ~/tmp/gb2312_and_cjk_common_set_1869.txt
py -m nn_ns.CJK.cjk_subsets.hanzi > /sdcard/0my_files/tmp/_.txt
view /sdcard/0my_files/tmp/_.txt
    see:_vs_()/_vss_()

=====cmds
py -m nn_ns.app.debug_cmd   nn_ns.CJK.cjk_subsets.hanzi
py -m nn_ns.app.adhoc_argparser__main__call8module   nn_ns.CJK.cjk_subsets.hanzi @fff =123 :string --kw:arg ++kw_ls:elem -flag_off +flag_on
py_adhoc_call   nn_ns.CJK.cjk_subsets.hanzi @_intersect_hzs_2573_vs_hzs_2143_vs_hzs_2513or1869
py -m nn_ns.app.doctest_cmd   nn_ns.CJK.cjk_subsets.hanzi:fff -v

=====
vim cmd:
    :s/.\{8}/\0\r/g
格式:
zzz_ddd = """
非尾行则每行八字
尾行不超八字
""" #""" zzz_ddd

from nn_ns.CJK.cjk_subsets.hanzi import hzs_2133, hzs_1755

#]]]]]'''

__all__ = """
    eq__hz_sp_str
    len__hz_sp_str
    check_len__hz_sp_str
    vs__hz_sp_str8set
    sorted_hz_str5set_intersect4hz_sp_str
    sorted_hz_str5set_diff4hz_sp_str
    hz_sp_str2hz_str
    hz_sp_str2hz_set
    hz_set2sorted_hz_str
    filter_hzs_by_

    中华字经2003__重复字4000_不同字3980
    通用规范汉字表2013_一级字3500
    通用规范汉字表2013_二级字3000
    通用规范汉字表2013_三级字1605
    gb2312_1980_一级汉字3755
    gb2312_1980_二级汉字3008
    汉字单字字频总表_cedict_12041
    cjk_common_subset_2513
    cjk_common_subset_1869
    cjk_common_subset_2513_trivial_TS_2230
    cjk_common_subset_1869_trivial_TS_1632
        cjk_common_subset_2513_trivial_TS_2227
        cjk_common_subset_1869_trivial_TS_1631
    按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字
    按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字
    按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字
    高稳定度汉字字集囗第一版囗高频八十六字
    高稳定度汉字字集囗第一版囗低频二百五十六字
    高稳定度汉字字集囗第一版囗降频囗三百四十二字
    高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字
    高稳定度汉字字集囗第三版囗码序囗二百六十一字
    unihan_kIICore_levelA_common_hz_str__U13_0___2143
    unihan_kUnihanCore2020_common_hz_str__U13_0___2573
    一百零六部平水韵韵目_上平15_下平15_上声29_去声30_入声17__106
    cjk_TS_covered_extension_of_cjk_common_subset_2942
    cjk_common_subset_TS_covered_extension_5455




cjk_common_subset_2513_nontrivial_TS_286
cjk_common_subset_1869_nontrivial_TS_238

cjk_common_subset_2513
    共享汉字字集
cjk_common_subset_1869
    初步缩减囗共享汉字字集
cjk_common_subset_2513_trivial_TS_2230
    cjk_common_subset_2513_trivial_TS_2227
        平凡繁简囗共享汉字字集
cjk_common_subset_1869_trivial_TS_1632
    cjk_common_subset_1869_trivial_TS_1631
        平凡繁简囗初步缩减囗共享汉字字集




按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字
    hz_initial_4strokes_as_4bits_by_grouping_14_23__sp5___digits_16
按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字
    hz_initial_2strokes_as_4bits_by_grouping_1_3_4_2__sp5___digits_16
按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字
    hz_initial_6strokes_as_6bits_by_grouping_14_23__sp5___digits_64




高稳定度汉字字集囗第一版囗高频八十六字
    stable_hz_set_ver1__high_86
高稳定度汉字字集囗第一版囗低频二百五十六字
    stable_hz_set_ver1__low_256
高稳定度汉字字集囗第一版囗降频囗三百四十二字
    stable_hz_set_ver1__reversed_freq__342

高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字
    stable_hz_set_ver2__excludeILL__reversed_freq__259
高稳定度汉字字集囗第三版囗码序囗二百六十一字
    stable_hz_set_ver3__sorted__261




unihan_kIICore_levelA_common_hz_str__U13_0___2143
    common__hzs_2143_vs_hzs_2513___2133
        common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133
            hzs_2133
        left_only__hzs_2143_vs_hzs_2513___10
        right_only__hzs_2143_vs_hzs_2513___380

    common__hzs_2143_vs_hzs_1869___1755
        common__hzs_2573_vs_hzs_2143_vs_hzs_1869___1755
            hzs_1755
        left_only__hzs_2143_vs_hzs_1869___388
        right_only__hzs_2143_vs_hzs_1869___114

unihan_kUnihanCore2020_common_hz_str__U13_0___2573
    common__hzs_2573_vs_hzs_2513___2512
        left_only__hzs_2573_vs_hzs_2513___61
        right_only__hzs_2573_vs_hzs_2513___1

    common__hzs_2573_vs_hzs_1869___1868
        left_only__hzs_2573_vs_hzs_1869___705
        right_only__hzs_2573_vs_hzs_1869___1

    common__hzs_2573_vs_hzs_2143___2137
        left_only__hzs_2573_vs_hzs_2143___436
        right_only__hzs_2573_vs_hzs_2143___6

    common__hzs_2573_vs_hzs_1755___1755
        left_only__hzs_2573_vs_hzs_1755___818
        right_only__hzs_2573_vs_hzs_1755___0



一百零六部平水韵韵目_上平15_下平15_上声29_去声30_入声17__106
    一百零六部平水韵韵目_上平15
    一百零六部平水韵韵目_下平15
    一百零六部平水韵韵目_上声29
    一百零六部平水韵韵目_去声30
    一百零六部平水韵韵目_入声17





文本纟繁简字对列表牜繁简唯一可逆牜基位面冫一臸龥牜过滤冫汉字相关基础编码_943繁简字对_1886
    hzTSpairs__hit_encodings_big5_cp949_gb2312_iso2022_jp__1886
文本纟繁简字对列表牜繁简唯一可逆牜基位面冫一臸龥_1959繁简字对_3918
    hzTSpairs__hit_region_ge4E00_le9FA5_20902__3918
文本纟汉字列表牜繁简平凡自反牜基位面冫一臸龥牜过滤冫汉字相关基础编码_2230
    cjk_common_region_of_encodings_big5_cp949_gb2312_iso2022_jp__trivial_TS__2230
文本纟汉字列表牜繁简平凡自反牜基位面冫一臸龥_14428
    cjk_region_ge4E00_le9FA5_20902__trivial_TS__14428




简繁覆盖扩增字集纟共享汉字字集
    cjk_TS_covered_extension_of_cjk_common_subset_2942
    已补全耂简繁对照纟简繁覆盖扩增字集纟共享汉字字集

共享汉字字集牜简繁覆盖扩增
    cjk_common_subset_TS_covered_extension_5455

""".split()#"""
    #hz_set2sorted_hz_str__by_reversed_freq
    #hz_set2freq_sorted_rng_ex
    #囗修正简繁字对集后囗副作用囗平凡自反共享汉字增加囗
    #_post_checks
#__all__
r"""
字串-有序囗可重复
字集-无序囗无重复字
def eq__hz_sp_str(lhs, rhs, /):
    比较字串囗忽略空格囗不排序
def len__hz_sp_str(hz_sp_str, /):
    字串大小#排除空格
def check_len__hz_sp_str(sz, hz_sp_str, /):
    断言字串大小
def _vss_(lhs_name, rhs_names__sp_str, /):
def _vs_(lhs_name, rhs_name, /):
    显示 异同
    仅内部使用
def vs__hz_sp_str8set(lhs, rhs, /):
    字集异同
def sorted_hz_str5set_intersect4hz_sp_strs_(hz_sp_str, /, *hz_sp_strs):
    字集交
def sorted_hz_str5set_intersect4hz_sp_str(lhs, rhs, /):
    字集交
def sorted_hz_str5set_diff4hz_sp_str(lhs, rhs, /):
    字集差
def hz_sp_str2hz_str(hz_sp_str):
    消除字串空格囗不排序
def hz_sp_str2hz_set(hz_sp_str):
    消除空格并转换为集合
def hz_set2sorted_hz_str(s):
    先排序
def hz_set2freq_sorted_rng_ex(hz_set):
    字集在频度表中的跨度以及不在其中的字符数
def hz_set2sorted_hz_str__by_reversed_freq(s):
    逆频度排序

def filter_hzs_by_(hz_set, hzs, /):
    字串只保留字集中的字符

#"""
_post_checks = []


def eq__hz_sp_str(lhs, rhs, /):
    #不排序
    return hz_sp_str2hz_str(lhs) == hz_sp_str2hz_str(rhs)
def vs__hz_sp_str8set(lhs, rhs, /):
    common = sorted_hz_str5set_intersect4hz_sp_str(lhs, rhs)
    left_only = sorted_hz_str5set_diff4hz_sp_str(lhs, rhs)
    right_only = sorted_hz_str5set_diff4hz_sp_str(rhs, lhs)
    return common, left_only, right_only
def _vss_(lhs_name, rhs_names__sp_str, /,*, name2var=None, mk_suffix=None, turnoff_print=False):
    kwargs = dict(name2var=name2var, mk_suffix=mk_suffix, turnoff_print=turnoff_print)
    for rhs_name in rhs_names__sp_str.split():
        _vs_(lhs_name, rhs_name, **kwargs)

def _vs_(lhs_name, rhs_name, /,*, name2var=None, mk_suffix=None, turnoff_print=False):
    #%s/_vs_('\(\w*\)', \(\w*\), \(\w*\))/_vs_('\1', '\2', '\3')/g
    #%s/_vs_('\(\w*\)', '\(\w*\)', '\(\w*\)')/_vs_('\2', '\3')/g
    if name2var is None:
        name2var = globals()
    lhs = name2var[lhs_name]
    rhs = name2var[rhs_name]
    del name2var
    if mk_suffix is None:
        def mk_suffix(lhs_name, rhs_name, /):
            szL_str = cut(lhs_name)
            szR_str = cut(rhs_name)
            check_len__hz_sp_str(int(szL_str), lhs)
            check_len__hz_sp_str(int(szR_str), rhs)
            suffix = f'__hzs_{szL_str}_vs_hzs_{szR_str}'
            return suffix
        def cut(name, /):
            _, sep, sz_str = name.rpartition('_')
            if not sep: raise TypeError
            if not int(sz_str) >= 0: raise TypeError
            return sz_str
    elif type(mk_suffix) is str:
        suffix = mk_suffix
        def mk_suffix(lhs_name, rhs_name, /):
            return suffix
    suffix = mk_suffix(lhs_name, rhs_name)
    (fnms, common, left_only, right_only) = ___vs___(suffix, lhs_name, rhs_name, lhs, rhs, turnoff_print=turnoff_print)
    return (fnms, common, left_only, right_only)


def ___vs___(suffix, lhs_name, rhs_name, lhs, rhs, /, *, turnoff_print):
    (common, left_only, right_only) = vs__hz_sp_str8set(lhs, rhs)
    if turnoff_print:
        def _print(*args, **kwargs):
            pass
    else:
        _print = print

    d = {**locals()}
    nms = 'common left_only right_only'.split()
    fnms = []
    for nm in nms:
        s = hz_set2sorted_hz_str(d[nm])
        full_name = f'{nm}{suffix}___{len(s)}'
        fnms.append(full_name)
        #_print(f'len({full_name})={len(s)}')
        _print(f'{full_name}={s!r}')
        _print(f'check_len__hz_sp_str({len(s)}, {full_name})')
    _print()
    _print('(_{}, _{}, _{}) = vs__hz_sp_str8set({}, {})'.format(*fnms, lhs_name, rhs_name))
    for full_name in fnms:
        _print(f'assert eq__hz_sp_str({full_name}, _{full_name})')
    _print()
    _print()
    _print()
    return fnms, common, left_only, right_only



def len__hz_sp_str(hz_sp_str, /):
    return len(hz_sp_str2hz_str(hz_sp_str))
def check_len__hz_sp_str(sz, hz_sp_str, /):
    if not sz == len__hz_sp_str(hz_sp_str):raise TypeError


def sorted_hz_str5set_intersect4hz_sp_strs_(hz_sp_str, /, *hz_sp_strs):
    s = hz_sp_str2hz_set(hz_sp_str)
    for _s in map(hz_sp_str2hz_set, hz_sp_strs):
        s &= _s
    intersect = hz_set2sorted_hz_str(s)
    return intersect
def sorted_hz_str5set_intersect4hz_sp_str(lhs, rhs, /):
    intersect = hz_set2sorted_hz_str(hz_sp_str2hz_set(lhs) & hz_sp_str2hz_set(rhs))
    return intersect
def sorted_hz_str5set_diff4hz_sp_str(lhs, rhs, /):
    diff = hz_set2sorted_hz_str(hz_sp_str2hz_set(lhs) - hz_sp_str2hz_set(rhs))
    return diff

def hz_sp_str2hz_str(hz_sp_str):
    '不排序，见『汉字单字字频总表_cedict_12041』'
    hz_str = ''.join(hz_sp_str.split())
    return hz_str
def hz_sp_str2hz_set(hz_sp_str):
    return set(hz_sp_str2hz_str(hz_sp_str))

def _gb2312_1980():
    from nn_ns.CJK.iter_gb2312_hanzi import iter_gb2312_hanzi
    chars_of_gb2312_1980 = ''.join(iter_gb2312_hanzi())
    assert len(chars_of_gb2312_1980) == 6763
    gb2312_1980_一级汉字3755 = chars_of_gb2312_1980[:3755]
    gb2312_1980_二级汉字3008 = chars_of_gb2312_1980[3755:]
    assert len(gb2312_1980_一级汉字3755) == 3755
    assert len(gb2312_1980_二级汉字3008) == 3008
    return gb2312_1980_一级汉字3755, gb2312_1980_二级汉字3008
if __name__ == "__main__":
    if 0: print(_gb2312_1980())
        #==>> gb2312_1980_一级汉字3755, gb2312_1980_二级汉字3008
    assert [*map(len, _gb2312_1980())] == [3755, 3008]



中华字经2003__重复字4000_不同字3980 = """
乾坤有序宇宙无疆
星辰密布斗柄指航
昼白夜黑日明月亮
风驰雪舞电闪雷响
云腾致雨露结晨霜
虹霓霞辉雾沉雹降
春生夏长秋收冬藏
时令应候寒来暑往
远古洪荒海田沧桑
陆地漂移板块碰撞
山岳巍峨湖泊荡漾
植被旷野岛撒汪洋
冰川冻土沙漠沃壤
木丰树森岩多滩广
鸟飞兽走鳞潜羽翔
境态和谐物种安详
父母爹娘没齿难忘
兄弟姐妹危困助帮
姑姨叔舅亲戚互访
侄男闺少哺育茁壮
夫妻相敬梦忆糟糠
隔屋邻舍遇事谦谅
伯公妪婆慈孝赡养
尊朋礼友仁义君郎
形分上下道合阴阳
幽冥杳渺天体著彰
凝气为精聚能以场
缩浓而质积微显量
化巨幻虚恍惚成象
强固凌弱柔亦制刚
终极必反存兴趋亡
唯实众名一理万方
炎黄二帝尧舜禅让
禹启世袭灭桀商汤
周武伐纣侯列各邦
秦皇集权汉刘楚项
鼎立割据乱晋八王
南北对峙腐朽隋炀
贞观政要五代续唐
陈桥兵变耻辱靖康
耶律完颜元建宋僵
朱轮太祖崇祯吊丧
清军入关大臣驻藏
粉碎叛卓犁域设将
台湾复归守卫边防
鸦片战争英占香港
戊戌维新社会改良
辛亥革命孙文思想
联盟抗倭国共两党
定都京师人民解放
中华初繁睡狮渐醒
玖久纪末千年始零
宏业盛昌妙策禀迎
左右兼顾总揽统领
内取稳进外交志同
阶梯过度切忌狠猛
六贼七害监视审听
戒贪须效践约宜恒
贬恶褒绩赏劝罚惩
操刃执斧塞涓救荧
势如突起抽薪熄平
途逢险兆消芽于萌
调息止纷贵在用衡
依法谋治官吏皆正
币帛钱钞攘夺其宗
企财盼利价值均等
务工开厂增富减穷
资产累计税率加乘
银行贷款储蓄倍宠
抵押拆借循例不停
供给需求市货充盈
销售买卖亏差余剩
债券股票博赌输赢
闻赚虽喜跌赔癫疯
诸子百家孔孟老庄
扁鹊灵医鲁班巧匠
蔡伦毕升鉴真玄奘
僧尼寂寞菩萨忍常
罗盘硝药针灸疗伤
拼牌拨珠围棋麻纲
易经论语史记达畅
河图洛书算术九章
西三红水聊儒瓶厢
诗词曲赋戏剧说唱
试管婴儿克隆遗传
细胞速冷脱氧核酸
脉冲数码几何规范
网络通讯程控遥感
驱逐舰艇洲际导弹
激光辐射捆绑火箭
声纳测距信号还原
谍报跟踪贫铀污染
奥运竞技淘汰筛选
跨跃短跑蹦跳撑竿
铁饼标枪垒足排篮
汽车拉力驾舢驶帆
刀锤棍棒钩爪杖鞭
动静迂回摔跤击拳
敦煌石窟长城伟墙
青铜甲骨缕衣纱裳
虎符越剑陶马俑葬
彩瓷宝瓮丝绸他乡
凡尔赛宫金字塔状
泰姬陵墓彼得教堂
自由女神希腊塑像
最后晚餐创造亚当
推贤荐材睹貌辨行
觉悟先知圣色从容
纯朴宽厚侠烈尽忠
耿直肃仪襟怀袒诚
谄媚狡猾机敏慧颖
懈怠懒惰拙笨碌庸
愚昧糊涂罕才至聪
羞涩拘束杰健悍雄
恭畏惧怕缄默持重
骄奢傲慢怯懦惶恐
猜疑诡秘威严毅勇
超逸独居恬淡匀宁
桃李杏柿汁鲜味爽
椰柚橙桔渴饮品尝
菠萝柑橘橄榄槟榔
梨枣苹楂荔栗榴棠
苍松寿柏垂柳毛杨
槐椿榆桦杉桂榕樟
棕榈柠檬枫棵紫檀
格林童话伊索寓言
莎翁托氏福摩探案
但丁歌德伽丘十谈
培根牛顿爱因斯坦
琵琶琴瑟锣镲铿锵
笙箫呜咽卧笛悠扬
筝音奔奋唢呐高亢
钟铃鸣脆喇叭歇晌
荆浩匡庐董源潇湘
米芾写意悲鸿骏昂
笔墨纸砚匾楣楹榜
楷隶篆刻碑帖草狂
休闲退优涣虑受逍
拒宾疏客忧谢欢招
把盏讲趣倚床读晓
游景筏渡迹绝喧嚣
茂冠蔽枝莽园出条
碧岭滴翠落叶飘摇
心底空透雅座去燥
挥毫主就佳句抒了
悬崖峭壁峰峦叠嶂
泉喷岚罩湍急瀑宕
峡沟潭渊溪涧流淌
池渠堰坝沼泽泥塘
灾涝溢泻汛潮浮涨
淮泄滞沽溅渗汀潢
汹涌澎湃惊涛骇浪
漩涡带波礁屿连江
亭榭楼阁寺庙殿廊
蓬门荜户丈室绿窗
府第别墅画栋雕梁
厅院踏步影屏幕障
承尘藻井篱笆柱桩
舷舵扶靠凭栏眺望
宿营扎寨枕戈待旦
岗哨戎诫挎锐披坚
帅旗挺拔训士率演
磐踞较劲擎帜呼喊
更迭撤离阻挡御拦
些许骚扰伪装遮掩
稍纵即逝竟忽瞬暂
迢递驭骑靶轰州县
耗损酬饲迈历委艰
趁却佯攻构筑壕堑
擒敌破阵调派遣返
垢卸焚址盔甩烬焰
遏追堵截伏剿全歼
另召崭旅蜕衰勿厌
碉堡摧毁拥挤逃窜
俘虏缴械胜败前沿
枉允肯否咀嚼凯宴
惨遭牺牲素裹席卷
坟棺尸闹魂魄寝眠
活着祈祷死则祭奠
您保阀阅我佑殡殓
檄悼撰讫佛陀绎传
廉奉殉职奖功颁衔
组织筹备抚恤申签
部属僚员涕泪潸然
彪炳铭册炫烁灿烂
省区署郊村镇屯店
耕耘耧耙播耪搅拌
农垦灌溉渔猎驳船
柴棚炊热牧畜粪烟
膜压窖湿肥予磷氮
穴浇尿深灰埋屎浅
禾苗缨穗蔓附藤缠
埂堤捡薯垄畦摘棉
蓖麸荸荠粟苞芝简
稻麦谷豆荞黍蔗豌
秕稗蓑稞秫秸稼秆
颗粒籽核株蕊茎杆
剪丫打杈嫁接插扦
瓜果蔬菜葱蒜韭姜
茴椒芹葵皮芥辣酱
芸苔芋笋葫芦瓢瓤
番茄蘑菇乳蛋醇酿
碘盐食醋兹卜甜糖
珍馐旨甘肴馔膏粱
葡萄美酒玉液琼浆
咖啡益智茗茶顺肠
点线面段球弧椭圆
菱锥棱角凸凹顶尖
竖撇捺折陡拱侧弦
冈洼型槽窄路绰圈
亩吨钧斤个拾佰仟
尺寸厘秒每只亿半
谣决淆或是非确断
翻译授课考究钻研
错误耽搁犹豫岂敢
校讹编辑页稿汇篇
故谜梗概版载登刊
专题删节普遍浏览
沐浴洁身梳妆乔扮
薄黛轻施靓耀矫莲
服绢饰佩缤绫绣缎
雉翎并勃婀娜妮曼
私恋旧侣好娃阿丹
赞叹称颂宛若娥仙
情投系姻欲净见缘
转识迷性苦乐恼烦
嘉偶婚配衷恳悦己
做媒介绍卿获娇媳
哥嫂咨询伙伴参议
爸妈恩准爷奶评批
叙述绵延缓迟寻觅
担抬扛搬偏僻串艺
炮震房宅宣沸弄里
铙钹咚呛乐吹轿娶
蝌蚪摆尾蛤蟆鼓囊
钓饵蚯蚓蠕虫蚂蟥
鹦鹉学舌蜜蜂穿忙
蝙蝠栖洞梧桐引凰
蜘蛛牵补螟蛉蛀粮
蜻蜓振翅鸠鹏张膀
鸥莺燕雀蝴蝶鸳鸯
鹌鹑鹁鸪蛙蝈螳螂
鲤鲫鲇鲢鲸鲨鱿蚌
狍獾獗猹蜷蛐螺螃
蚜蛾蝉蛹龟卵翼蝗
蚊蝇鼠蚁蛇蝎鳝蟒
蜈蚣毒腺蟋蟀蹬闯
鹿狈狐狸熊豹豺狼
猿啼猴吱鸵孵蜗躺
砂舟骆驼迅捷羚羊
狱牢禁卒司典刑宪
目的辩证裁判邪端
辞讼哭诉含屈伸冤
敞释矛盾剖层剥茧
朦胧伎俩仍留隙嫌
沥滤淀浊昭划界限
妨碍侦察贿赂仕宦
诅咒吓唬挑衅侮谩
讥讽诽谤浑噩督验
斟酌掺谎包庇捂瞒
陨堕棘阱殃及祠眷
检举查封逮捕魁顽
歹徒坏类狰狞嘴脸
作奸犯科缉拿协办
妖魔鬼怪凶煞酷阎
勒逼豪阔搜刮卑贱
拐架孩提坑蒙孕残
唆使怂恿敲诈欺骗
盗匪劫窃砧剁剐砍
恃傍苛杂横征暴敛
烧杀掠抢栽赃诬陷
宰虐淫霸痞劣刁蛮
狎昵娼妓蹂躏鬓鬟
猥亵妇寡屠戮毙斩
氓绅诱瘾倒置昏暗
伺婢躲避怨斥责谴
酗殴惹祸弊秽泛滥
偷漏假冒妄贩募捐
剃囚拷问傀儡敷衍
侥幸饶恕期告赦免
镣铐锒铛忏悔已憾
匆慌失措徐踱圃团
踌躇徘徊彷徨怖添
焦愁霉绪沦颓苟喘
虱蚤蛆蛔茅厕臭便
朝觐跪拜赎罪向善
龙睛凤眼秀眉斜弯
樱口怡笑胭脂融现
舒额弹腮惺眸镶嵌
嫦妞妩睫炯奕幌辫
敖鼻单翘坠耳双环
纤手藕臂软颈削肩
乌发比臀酥胸腰间
修腿负躯弓脚婷站
柬贴呈送族姥婶婿
赶赴邀请祝贺庆禧
叩首鞠躬随俗迁徙
叮嘱钦陪辈份矮低
庶孽继嗣昆仲甥姊
扭捏局促倔犟楞毖
栅苑濒旁斋扉紧闭
戴璧秉圭诙慰漫弥
吾你俺它咱们谁替
弘愿逞诺诛厄违逆
曙炬绚彤燃烛洽娱
巴巫宵寐牝牡胶漆
妊娠胚胎呕吐娩嬉
特殊贡献永享勋誉
胖瘦小囡嗅舔吮吸
坐摸滚爬泞汗淋漓
孺龄屁蹲绷衩溶溺
鞋袜衬裤缝纫缭敝
毡垫毯褥晴晾晒洗
褂袱肮渍挽袖濯涤
洒扫庭除擦抹桌椅
铺盖篷订粹粕丢弃
蹈矩墩凳晶莹玻璃
屡赊甭够勤俭勉励
壹贰摹仿叁肆韵谊
伍陆描绘柒捌譬喻
幼稚早窍玩耍练习
吟咏背诵熟似谱吕
韶努仗牍谆诲朝夕
头脑认念住校再析
夸诀逗倡哦欠所悉
付与酪膳喂哄乖嫡
藐蔑蠢哲懂谬惑殆
孜挚弗馁蹉跎窒肄
鸡鸭抱群猪仔满圈
驴骡啃坡犬狗护岸
鱼鳖虾蟹猫兔鹅蚕
旋绕鹰鸽哀孤鹤雁
厩驹匹鬃驯犊乍唤
雏猩攀梢雌猬隅诞
东街采购磅秤肉馅
仆役雇佣侍姆聘换
掌勺炉灶料堆厨馆
吞噎喋咬叼吃饥馋
烘焙烙炕烩炒灼涮
熏溜烤炸炖煮卤腌
焖爆燎烫烹蒸熬煎
烽焕泼沏酝酵醉酣
荤腥肺脯滑嫩肚肝
笼屉羔肘粘润糯丸
粳糕馍饺稠粥稀饭
饴粽馄饨油浸温馒
糜费羹炙什锦萍瓣
饿择粗糙饱剔腻咸
乞丐处讨馈馊饪饯
兰荷菊梅四季芬芳
奇花异卉艳丽荣秧
杜鹃泣血芙蓉吉祥
茉莉馥郁玫瑰刺芒
坪埔莱茵菲窥坞坊
蔷薇翩跹莆菏蔚茫
芭蕉蒲扇斑竹篾筐
藩茹蔼蓝赤芍榛橡
蒿苇蔫苫昙萤茸盎
蕴蒂荚芯蓓蕾琳琅
腔膛脏腑脾肾髓胆
唇嗓喉咙颅颊骸颧
脊椎腆腹臆盹眶睑
肛胯脐趾脖腋膝腕
胳膊臃弛胫肢抖颤
龋牙皱肤肪膘冗绽
憨傻痴呆聋哑瘫痪
疙瘩痘疹脓疮秃癣
癞疥搔痒疤痕愈痊
帧频催聩瘴疟殖阉
瘁痈痔痢瘪痹瘸疝
胁肋疼痛筋肌痉挛
胃胰溃疡膀胱菌沾
艾滋侵略瘟疫扩散
肿瘤癌症劳惫疲倦
警惕疾病诊恙预患
慷慨愉快狭隘惆怅
愤怒仇恨闷憋嘟囔
萎靡憔悴疚歉抑怏
怜悯惭愧怆恻凄凉
憎忿懊恢悄惦沮惝
忐忑怵悸惋忱惯央
誊蜡印刷赠寄邮件
本戳硬钉契函札笺
琐屑账簿济赐牒翰
钥匙纽扣兜袋帷帘
盒套箱柜瓦罐盂痰
缆缸皂具杯筷碟碗
帐幔靴帽整齐挂拴
壶锅盆桶器皿匣坛
笤帚垃圾矿蛰煤炭
夹裆袄袍篓臼灯伞
钎铰镑钮杠叉表链
乒乓晃瞳楔橱檩椽
珊瑚贝壳玛瑙碱矾
琉瑶玲珑睦瑞晕眩
箩纹簸箕溯篙暮栓
赘驮枷锁豁缺舶舨
犀鳍鳄鞘帕皑褐奄
砰磁砾碴裸垛坯砖
裙衫纶巾混纺绒絮
缀绉缚绦综纬绞缔
框展倩照镜示映姿
模样俊俏娴淑伶俐
潦澡漱浣飒冕踩履
睁瞧瞅看瞻睬眨眯
盯瞄瞥瞩羡慕妒嫉
盲瞽瞎瞪迄未谒颐
库仓巡逻重峪俯瞰
驿鞍骤遁刹那近垣
坎坷崎岖岔径蜿蜒
遵逾轨辙逛遨峻颠
辖琢篦参闸贮滨畔
阡陌寥廓租赁畴佃
泡沫膨胀岁恰乏旱
辟卦堪舆曾埠位般
亨爵彬斌胄裔隽娟
衙巷怃畜缰绳磕绊
霹雳贯霄基础淤淹
厦幢崩塌窑庵囤填
邑郭倾覆箍垮隧涵
泅泳涉滔渤澳淇涎
陋栈凋枢废窿畸檐
涯涸竭枯渣滓臊膻
凛冽埃墟炽囱竣煽
廷巢迸裂桨桅歪坍
泵谓唧筒矗曰耸屹
怎么晰咋辅佐答翊
莅临注到砌级乃陛
霎诠俄顷次可叫翌
笃录甚很紊奏芜鄙
暇疵兑玷吝啬阐惜
怔愕讶诧仅该姓惟
鹜窝暖禽晦朔旺汐
此这凑妥赅估俱既
兢晤谨慎茨遂蒺藜
钳锭镀锻熔铸冶炼
锯锉凿刨锹锄镐铲
铡镊键锚锋匕钝锨
镰舱锈蚀淬磨铆焊
呵叱咆哮吆喝吵骂
吩咐嘀咕叽哩哇啦
啰嗦唠叨吭哧嘁喳
咽唾咳嗽哎哟哼哈
啸吼嚎啕嘶嗡嘹哗
嘻嚷嗯嘿咿呀啊哪
啤咧唁呻嘲吻唉啥
哆咪啄吠嗤嗜呸啪
呗咦咣啷喽嗑咛呱
噢嘈啧呓喔嗒嘛嘎
掏挖掘抠揭拍抓按
揪掐卡握抡劈拧扳
搓揉揩拭拂撩拖掸
拢挟括搂扒挠找拣
抄捞撮捧抛扔掷掼
擂捣捶砸捅扑撬掀
撕拽挣扯搏捉揍撵
挪挨搭掖撂掉拄搀
携挫擞拯搞掂揖捍
掇掳拎攒扼搪捎摊
摈抨抉揣揠拟搡援
拗掰撼摄拈拇捻擅
搽抻摁拮掣夯轧碾
跷踊跛跺蹭踢蹋蹿
趴蹄躁踵趟讳谗谚
津沪渝陕滇陇蜀黔
粤闽厦圳泾渭浙赣
鄂毗皖徽冀偎邯郸
祁臻虞辽苏杭郑汴
澜沁漳汾泌沂浦汕
彝傣傈侗匈奴缅甸
之乎者也噫嘘兮矣
且又焉哉吧吗吁呢
夭午酉巳卯寅丑乙
丙庚壬癸干支今昔
盅舀辆届队副旬式
轴档幅艘仑朵茬剂
榨梭榷梆倘偿侨侈
簧猖矢噪昨贸逊迪
她愣纠沛某誓隐匿
窘迫耐奈罢黜瞭歧
彻肇硕祟篡阂勘诣
褪髦恪颇凫刽蘸铣
秩丞适藉韧汝澈熙
钾钠钙镁铝锌锡铅
钢锑锗钨铬镍铂钒
硼硅硫磺汞苯锰碳
氢氰氦氟氯氛氖氨
簇釜酶馏烯炔烃烷
硒砷溴镭酚酞酮醛
邓吴赵魏彭胡姚韩
崔巩尚任欧傅肖樊
曾蒋曹厉冯尤卢袁
薛勾聂寇莫沈瞿潘
赖裕触邹霍殷狄谭
邢贾萧庞娄丛黎栾
赫闰韦辜穆旭籍桓
窦龚邱郝况翟尉阮
仰冉惠靳邵牟欣婉
淳禄闵朗葛夷枚闫
甫稽澄臧拓跋轩辕
""" #""" 中华字经2003__重复字4000_不同字3980


通用规范汉字表2013_一级字3500 = """
一乙二十丁厂七卜
八人入儿匕几九刁
了刀力乃又三干于
亏工土士才下寸大
丈与万上小口山巾
千乞川亿个夕久么
勺凡丸及广亡门丫
义之尸己已巳弓子
卫也女刃飞习叉马
乡丰王开井天夫元
无云专丐扎艺木五
支厅不犬太区历歹
友尤匹车巨牙屯戈
比互切瓦止少曰日
中贝冈内水见午牛
手气毛壬升夭长仁
什片仆化仇币仍仅
斤爪反介父从仑今
凶分乏公仓月氏勿
欠风丹匀乌勾凤六
文亢方火为斗忆计
订户认冗讥心尺引
丑巴孔队办以允予
邓劝双书幻玉刊未
末示击打巧正扑卉
扒功扔去甘世艾古
节本术可丙左厉石
右布夯戊龙平灭轧
东卡北占凸卢业旧
帅归旦目且叶甲申
叮电号田由只叭史
央兄叽叼叫叩叨另
叹冉皿凹囚四生矢
失乍禾丘付仗代仙
们仪白仔他斥瓜乎
丛令用甩印尔乐句
匆册卯犯外处冬鸟
务包饥主市立冯玄
闪兰半汁汇头汉宁
穴它讨写让礼训议
必讯记永司尼民弗
弘出辽奶奴召加皮
边孕发圣对台矛纠
母幼丝邦式迂刑戎
动扛寺吉扣考托老
巩圾执扩扫地场扬
耳芋共芒亚芝朽朴
机权过臣吏再协西
压厌戌在百有存而
页匠夸夺灰达列死
成夹夷轨邪尧划迈
毕至此贞师尘尖劣
光当早吁吐吓虫曲
团吕同吊吃因吸吗
吆屿屹岁帆回岂则
刚网肉年朱先丢廷
舌竹迁乔迄伟传乒
乓休伍伏优臼伐延
仲件任伤价伦份华
仰仿伙伪自伊血向
似后行舟全会杀合
兆企众爷伞创肌肋
朵杂危旬旨旭负匈
名各多争色壮冲妆
冰庄庆亦刘齐交衣
次产决亥充妄闭问
闯羊并关米灯州汗
污江汛池汝汤忙兴
宇守宅字安讲讳军
讶许讹论讼农讽设
访诀寻那迅尽导异
弛孙阵阳收阶阴防
奸如妇妃好她妈戏
羽观欢买红驮纤驯
约级纪驰纫巡寿弄
麦玖玛形进戒吞远
违韧运扶抚坛技坏
抠扰扼拒找批址扯
走抄贡汞坝攻赤折
抓扳抡扮抢孝坎均
抑抛投坟坑抗坊抖
护壳志块扭声把报
拟却抒劫芙芜苇芽
花芹芥芬苍芳严芦
芯劳克芭苏杆杠杜
材村杖杏杉巫极李
杨求甫匣更束吾豆
两酉丽医辰励否还
尬歼来连轩步卤坚
肖旱盯呈时吴助县
里呆吱吠呕园旷围
呀吨足邮男困吵串
员呐听吟吩呛吻吹
呜吭吧邑吼囤别吮
岖岗帐财针钉牡告
我乱利秃秀私每兵
估体何佐佑但伸佃
作伯伶佣低你住位
伴身皂伺佛囱近彻
役返余希坐谷妥含
邻岔肝肛肚肘肠龟
甸免狂犹狈角删条
彤卵灸岛刨迎饭饮
系言冻状亩况床库
庇疗吝应这冷庐序
辛弃冶忘闰闲间闷
判兑灶灿灼弟汪沐
沛汰沥沙汽沃沦汹
泛沧没沟沪沈沉沁
怀忧忱快完宋宏牢
究穷灾良证启评补
初社祀识诈诉罕诊
词译君灵即层屁尿
尾迟局改张忌际陆
阿陈阻附坠妓妙妖
姊妨妒努忍劲矣鸡
纬驱纯纱纲纳驳纵
纷纸纹纺驴纽奉玩
环武青责现玫表规
抹卦坷坯拓拢拔坪
拣坦担坤押抽拐拖
者拍顶拆拎拥抵拘
势抱拄垃拉拦幸拌
拧拂拙招坡披拨择
抬拇拗其取茉苦昔
苛若茂苹苗英苟苑
苞范直茁茄茎苔茅
枉林枝杯枢柜枚析
板松枪枫构杭杰述
枕丧或画卧事刺枣
雨卖郁矾矿码厕奈
奔奇奋态欧殴垄妻
轰顷转斩轮软到非
叔歧肯齿些卓虎虏
肾贤尚旺具味果昆
国哎咕昌呵畅明易
咙昂迪典固忠呻咒
咋咐呼鸣咏呢咄咖
岸岩帖罗帜帕岭凯
败账贩贬购贮图钓
制知迭氛垂牧物乖
刮秆和季委秉佳侍
岳供使例侠侥版侄
侦侣侧凭侨佩货侈
依卑的迫质欣征往
爬彼径所舍金刹命
肴斧爸采觅受乳贪
念贫忿肤肺肢肿胀
朋股肮肪肥服胁周
昏鱼兔狐忽狗狞备
饰饱饲变京享庞店
夜庙府底疟疙疚剂
卒郊庚废净盲放刻
育氓闸闹郑券卷单
炬炒炊炕炎炉沫浅
法泄沽河沾泪沮油
泊沿泡注泣泞泻泌
泳泥沸沼波泼泽治
怔怯怖性怕怜怪怡
学宝宗定宠宜审宙
官空帘宛实试郎诗
肩房诚衬衫视祈话
诞诡询该详建肃录
隶帚屉居届刷屈弧
弥弦承孟陋陌孤陕
降函限妹姑姐姓妮
始姆迢驾叁参艰线
练组绅细驶织驹终
驻绊驼绍绎经贯契
贰奏春帮玷珍玲珊
玻毒型拭挂封持拷
拱项垮挎城挟挠政
赴赵挡拽哉挺括垢
拴拾挑垛指垫挣挤
拼挖按挥挪拯某甚
荆茸革茬荐巷带草
茧茵茶荒茫荡荣荤
荧故胡荫荔南药标
栈柑枯柄栋相查柏
栅柳柱柿栏柠树勃
要柬咸威歪研砖厘
厚砌砂泵砚砍面耐
耍牵鸥残殃轴轻鸦
皆韭背战点虐临览
竖省削尝昧盹是盼
眨哇哄哑显冒映星
昨咧昭畏趴胃贵界
虹虾蚁思蚂虽品咽
骂勋哗咱响哈哆咬
咳咪哪哟炭峡罚贱
贴贻骨幽钙钝钞钟
钢钠钥钦钧钩钮卸
缸拜看矩毡氢怎牲
选适秒香种秋科重
复竿段便俩贷顺修
俏保促俄俐侮俭俗
俘信皇泉鬼侵禹侯
追俊盾待徊衍律很
须叙剑逃食盆胚胧
胆胜胞胖脉胎勉狭
狮独狰狡狱狠贸怨
急饵饶蚀饺饼峦弯
将奖哀亭亮度迹庭
疮疯疫疤咨姿亲音
帝施闺闻闽阀阁差
养美姜叛送类迷籽
娄前首逆兹总炼炸
烁炮炫烂剃洼洁洪
洒柒浇浊洞测洗活
派洽染洛浏济洋洲
浑浓津恃恒恢恍恬
恤恰恼恨举觉宣宦
室宫宪突穿窃客诫
冠诬语扁袄祖神祝
祠误诱诲说诵垦退
既屋昼屏屎费陡逊
眉孩陨除险院娃姥
姨姻娇姚娜怒架贺
盈勇怠癸蚤柔垒绑
绒结绕骄绘给绚骆
络绝绞骇统耕耘耗
耙艳泰秦珠班素匿
蚕顽盏匪捞栽捕埂
捂振载赶起盐捎捍
捏埋捉捆捐损袁捌
都哲逝捡挫换挽挚
热恐捣壶捅埃挨耻
耿耽聂恭莽莱莲莫
莉荷获晋恶莹莺真
框梆桂桔栖档桐株
桥桦栓桃格桩校核
样根索哥速逗栗贾
酌配翅辱唇夏砸砰
砾础破原套逐烈殊
殉顾轿较顿毙致柴
桌虑监紧党逞晒眠
晓哮唠鸭晃哺晌剔
晕蚌畔蚣蚊蚪蚓哨
哩圃哭哦恩鸯唤唁
哼唧啊唉唆罢峭峨
峰圆峻贼贿赂赃钱
钳钻钾铁铃铅缺氧
氨特牺造乘敌秤租
积秧秩称秘透笔笑
笋债借值倚俺倾倒
倘俱倡候赁俯倍倦
健臭射躬息倔徒徐
殷舰舱般航途拿耸
爹舀爱豺豹颁颂翁
胰脆脂胸胳脏脐胶
脑脓逛狸狼卿逢鸵
留鸳皱饿馁凌凄恋
桨浆衰衷高郭席准
座症病疾斋疹疼疲
脊效离紊唐瓷资凉
站剖竞部旁旅畜阅
羞羔瓶拳粉料益兼
烤烘烦烧烛烟烙递
涛浙涝浦酒涉消涡
浩海涂浴浮涣涤流
润涧涕浪浸涨烫涩
涌悖悟悄悍悔悯悦
害宽家宵宴宾窍窄
容宰案请朗诸诺读
扇诽袜袖袍被祥课
冥谁调冤谅谆谈谊
剥恳展剧屑弱陵祟
陶陷陪娱娟恕娥娘
通能难预桑绢绣验
继骏球琐理琉琅捧
堵措描域捺掩捷排
焉掉捶赦堆推埠掀
授捻教掏掐掠掂培
接掷控探据掘掺职
基聆勘聊娶著菱勒
黄菲萌萝菌萎菜萄
菊菩萍菠萤营乾萧
萨菇械彬梦婪梗梧
梢梅检梳梯桶梭救
曹副票酝酗厢戚硅
硕奢盔爽聋袭盛匾
雪辅辆颅虚彪雀堂
常眶匙晨睁眯眼悬
野啪啦曼晦晚啄啡
距趾啃跃略蚯蛀蛇
唬累鄂唱患啰唾唯
啤啥啸崖崎崭逻崔
帷崩崇崛婴圈铐铛
铝铜铭铲银矫甜秸
梨犁秽移笨笼笛笙
符第敏做袋悠偿偶
偎偷您售停偏躯兜
假衅徘徙得衔盘舶
船舵斜盒鸽敛悉欲
彩领脚脖脯豚脸脱
象够逸猜猪猎猫凰
猖猛祭馅馆凑减毫
烹庶麻庵痊痒痕廊
康庸鹿盗章竟商族
旋望率阎阐着羚盖
眷粘粗粒断剪兽焊
焕清添鸿淋涯淹渠
渐淑淌混淮淆渊淫
渔淘淳液淤淡淀深
涮涵婆梁渗情惜惭
悼惧惕惟惊惦悴惋
惨惯寇寅寄寂宿窒
窑密谋谍谎谐袱祷
祸谓谚谜逮敢尉屠
弹隋堕随蛋隅隆隐
婚婶婉颇颈绩绪续
骑绰绳维绵绷绸综
绽绿缀巢琴琳琢琼
斑替揍款堪塔搭堰
揩越趁趋超揽堤提
博揭喜彭揣插揪搜
煮援搀裁搁搓搂搅
壹握搔揉斯期欺联
葫散惹葬募葛董葡
敬葱蒋蒂落韩朝辜
葵棒棱棋椰植森焚
椅椒棵棍椎棉棚棕
棺榔椭惠惑逼粟棘
酣酥厨厦硬硝确硫
雁殖裂雄颊雳暂雅
翘辈悲紫凿辉敞棠
赏掌晴睐暑最晰量
鼎喷喳晶喇遇喊遏
晾景畴践跋跌跑跛
遗蛙蛛蜓蜒蛤喝鹃
喂喘喉喻啼喧嵌幅
帽赋赌赎赐赔黑铸
铺链销锁锄锅锈锋
锌锐甥掰短智氮毯
氯鹅剩稍程稀税筐
等筑策筛筒筏答筋
筝傲傅牌堡集焦傍
储皓皖粤奥街惩御
循艇舒逾番释禽腊
脾腋腔腕鲁猩猬猾
猴惫然馈馋装蛮就
敦斌痘痢痪痛童竣
阔善翔羡普粪尊奠
道遂曾焰港滞湖湘
渣渤渺湿温渴溃溅
滑湃渝湾渡游滋渲
溉愤慌惰愕愣惶愧
愉慨割寒富寓窜窝
窖窗窘遍雇裕裤裙
禅禄谢谣谤谦犀属
屡强粥疏隔隙隘媒
絮嫂媚婿登缅缆缉
缎缓缔缕骗编骚缘
瑟鹉瑞瑰瑙魂肆摄
摸填搏塌鼓摆携搬
摇搞塘摊聘斟蒜勤
靴靶鹊蓝墓幕蓬蓄
蒲蓉蒙蒸献椿禁楚
楷榄想槐榆楼概赖
酪酬感碍碘碑碎碰
碗碌尴雷零雾雹辐
辑输督频龄鉴睛睹
睦瞄睫睡睬嗜鄙嗦
愚暖盟歇暗暇照畸
跨跷跳跺跪路跤跟
遣蜈蜗蛾蜂蜕嗅嗡
嗓署置罪罩蜀幌错
锚锡锣锤锥锦键锯
锰矮辞稚稠颓愁筹
签简筷毁舅鼠催傻
像躲魁衙微愈遥腻
腰腥腮腹腺鹏腾腿
鲍猿颖触解煞雏馍
馏酱禀痹廓痴痰廉
靖新韵意誊粮数煎
塑慈煤煌满漠滇源
滤滥滔溪溜漓滚溢
溯滨溶溺粱滩慎誉
塞寞窥窟寝谨褂裸
福谬群殿辟障媳嫉
嫌嫁叠缚缝缠缤剿
静碧璃赘熬墙墟嘉
摧赫截誓境摘摔撇
聚慕暮摹蔓蔑蔡蔗
蔽蔼熙蔚兢模槛榴
榜榨榕歌遭酵酷酿
酸碟碱碳磁愿需辖
辗雌裳颗瞅墅嗽踊
蜻蜡蝇蜘蝉嘛嘀赚
锹锻镀舞舔稳熏箕
算箩管箫舆僚僧鼻
魄魅貌膜膊膀鲜疑
孵馒裹敲豪膏遮腐
瘩瘟瘦辣彰竭端旗
精粹歉弊熄熔煽潇
漆漱漂漫滴漾演漏
慢慷寨赛寡察蜜寥
谭肇褐褪谱隧嫩翠
熊凳骡缩慧撵撕撒
撩趣趟撑撮撬播擒
墩撞撤增撰聪鞋鞍
蕉蕊蔬蕴横槽樱橡
樟橄敷豌飘醋醇醉
磕磊磅碾震霄霉瞒
题暴瞎嘻嘶嘲嘹影
踢踏踩踪蝶蝴蝠蝎
蝌蝗蝙嘿嘱幢墨镇
镐镑靠稽稻黎稿稼
箱篓箭篇僵躺僻德
艘膝膛鲤鲫熟摩褒
瘪瘤瘫凛颜毅糊遵
憋潜澎潮潭鲨澳潘
澈澜澄懂憔懊憎额
翩褥谴鹤憨慰劈履
豫缭撼擂操擅燕蕾
薯薛薇擎薪薄颠翰
噩橱橙橘整融瓢醒
霍霎辙冀餐嘴踱蹄
蹂蟆螃器噪鹦赠默
黔镜赞穆篮篡篷篱
儒邀衡膨雕鲸磨瘾
瘸凝辨辩糙糖糕燃
濒澡激懒憾懈窿壁
避缰缴戴擦藉鞠藏
藐檬檐檀礁磷霜霞
瞭瞧瞬瞳瞩瞪曙蹋
蹈螺蟋蟀嚎赡穗魏
簧簇繁徽爵朦臊鳄
癌辫赢糟糠燥懦豁
臀臂翼骤藕鞭藤覆
瞻蹦嚣镰翻鳍鹰瀑
襟璧戳孽警蘑藻攀
曝蹲蹭蹬巅簸簿蟹
颤靡癣瓣羹鳖爆疆
鬓壤馨耀躁蠕嚼嚷
巍籍鳞魔糯灌譬蠢
霸露霹躏黯髓赣囊
镶瓤罐矗
""" #""" 通用规范汉字表2013_一级字3500


通用规范汉字表2013_二级字3000 = """
乂乜兀弋孑孓幺亓
韦廿丏卅仄厄仃仉
仂兮刈爻卞闩讣尹
夬爿毋邗邛艽艿札
叵匝丕匜劢卟叱叻
仨仕仟仡仫仞卮氐
犰刍邝邙汀讦讧讪
讫尻阡尕弁驭匡耒
玎玑邢圩圬圭扦圪
圳圹扪圮圯芊芍芄
芨芑芎芗亘厍夼戍
尥乩旯曳岌屺凼囡
钇缶氘氖牝伎伛伢
佤仵伥伧伉伫囟汆
刖夙旮刎犷犸舛凫
邬饧汕汔汐汲汜汊
忖忏讴讵祁讷聿艮
厾阱阮阪丞妁牟纡
纣纥纨玕玙抟抔圻
坂坍坞抃抉㧐芫邯
芸芾苈苣芷芮苋芼
苌苁芩芪芡芟苄苎
苡杌杓杞杈忑孛邴
邳矶奁豕忒欤轫迓
邶忐卣邺旰呋呒呓
呔呖呃旸吡町虬呗
吽吣吲帏岐岈岘岑
岚兕囵囫钊钋钌迕
氙氚牤佞邱攸佚佝
佟佗伽彷佘佥孚豸
坌肟邸奂劬狄狁鸠
邹饨饩饪饫饬亨庑
庋疔疖肓闱闳闵羌
炀沣沅沔沤沌沏沚
汩汨沂汾沨汴汶沆
沩泐怃怄忡忤忾怅
忻忪怆忭忸诂诃诅
诋诌诏诒孜陇陀陂
陉妍妩妪妣妊妗妫
妞姒妤邵劭刭甬邰
纭纰纴纶纾玮玡玭
玠玢玥玦盂忝匦坩
抨拤坫拈垆抻劼拃
拊坼坻㧟坨坭抿坳
耶苷苯苤茏苫苜苴
苒苘茌苻苓茚茆茑
茓茔茕茀苕枥枇杪
杳枧杵枨枞枋杻杷
杼矸砀刳奄瓯殁郏
轭郅鸢盱昊昙杲昃
咂呸昕昀旻昉炅咔
畀虮咀呷黾呱呤咚
咆咛呶呣呦咝岢岿
岬岫帙岣峁刿迥岷
剀帔峄沓囹罔钍钎
钏钒钕钗邾迮牦竺
迤佶佬佰侑侉臾岱
侗侃侏侩佻佾侪佼
佯侬帛阜侔徂刽郄
怂籴瓮戗肼䏝肽肱
肫剁迩郇狙狎狍狒
咎炙枭饯饴冽冼庖
疠疝疡兖妾劾炜𬉼
炖炘炝炔泔沭泷泸
泱泅泗泠泺泖泫泮
沱泯泓泾怙怵怦怛
怏怍㤘怩怫怿宕穹
宓诓诔诖诘戾诙戽
郓衩祆祎祉祇诛诜
诟诠诣诤诧诨诩戕
孢亟陔妲妯姗帑弩
孥驽虱迦迨绀绁绂
驷驸绉绌驿骀甾珏
珐珂珑玳珀顸珉珈
拮垭挝垣挞垤赳贲
垱垌郝垧垓挦垠茜
荚荑贳荜莒茼茴茱
莛荞茯荏荇荃荟荀
茗荠茭茨垩荥荦荨
荩剋荪茹荬荮柰栉
柯柘栊柩枰栌柙枵
柚枳柞柝栀柢栎枸
柈柁枷柽剌酊郦甭
砗砘砒斫砭砜奎耷
虺殂殇殄殆轱轲轳
轶轸虿毖觇尜哐眄
眍𠳐郢眇眊眈禺哂
咴曷昴昱昵咦哓哔
畎毗呲胄畋畈虼虻
盅咣哕剐郧咻囿咿
哌哙哚咯咩咤哝哏
哞峙峣罘帧峒峤峋
峥贶钚钛钡钣钤钨
钫钯氡氟牯郜秕秭
竽笈笃俦俨俅俪叟
垡牮俣俚皈俑俟逅
徇徉舢俞郗俎郤爰
郛瓴胨胪胛胂胙胍
胗胝朐胫鸨匍狨狯
飑狩狲訇逄昝饷饸
饹胤孪娈弈奕庥疬
疣疥疭庠竑彦飒闼
闾闿阂羑迸籼酋炳
炻炽炯烀炷烃洱洹
洧洌浃洇洄洙涎洎
洫浍洮洵浒浔浕洳
恸恓恹恫恺恻恂恪
恽宥扃衲衽衿袂祛
祜祓祚诮祗祢诰诳
鸩昶郡咫弭牁胥陛
陟娅姮娆姝姣姘姹
怼羿炱矜绔骁骅绗
绛骈耖挈珥珙顼珰
珩珧珣珞琤珲敖恚
埔埕埘埙埚挹耆耄
埒捋贽垸捃盍荸莆
莳莴莪莠莓莜莅荼
莩荽莸荻莘莎莞莨
鸪莼栲栳郴桓桡桎
桢桤梃栝桕桁桧桅
栟桉栩逑逋彧鬲豇
酐逦厝孬砝砹砺砧
砷砟砼砥砣剞砻轼
轾辂鸫趸龀鸬虔逍
眬唛晟眩眙哧哽唔
晁晏鸮趵趿畛蚨蚜
蚍蚋蚬蚝蚧唢圄唣
唏盎唑崂崃罡罟峪
觊赅钰钲钴钵钹钺
钽钼钿铀铂铄铆铈
铉铊铋铌铍䥽铎氩
氤氦毪舐秣秫盉笄
笕笊笏笆俸倩俵偌
俳俶倬倏恁倭倪俾
倜隼隽倌倥臬皋郫
倨衄颀徕舫釜奚衾
胯胱胴胭脍胼朕脒
胺鸱玺鸲狷猁狳猃
狺逖桀袅饽凇栾挛
亳疳疴疸疽痈疱痂
痉衮凋颃恣旆旄旃
阃阄訚阆恙粑朔郸
烜烨烩烊剡郯烬涑
浯涞涟娑涅涠浞涓
浥涔浜浠浣浚悚悭
悝悒悌悛宸窈剜诹
冢诼袒袢祯诿谀谂
谄谇屐屙陬勐奘牂
蚩陲姬娠娌娉娲娩
娴娣娓婀畚逡绠骊
绡骋绥绦绨骎邕鸶
彗耜焘舂琏琇麸揶
埴埯捯掳掴埸埵赧
埤捭逵埝堋堍掬鸷
掖捽掊堉掸捩掮悫
埭埽掇掼聃菁萁菘
堇萘萋菽菖萜萸萑
棻菔菟萏萃菏菹菪
菅菀萦菰菡梵梿梏
觋桴桷梓棁桫棂啬
郾匮敕豉鄄酞酚戛
硎硭硒硖硗硐硇硌
鸸瓠匏厩龚殒殓殍
赉雩辄堑眭眦啧晡
晤眺眵眸圊喏喵啉
勖晞唵晗冕啭畦趺
啮跄蚶蛄蛎蛆蚰蛊
圉蚱蛉蛏蚴啁啕唿
啐唼唷啖啵啶啷唳
唰啜帻崚崦帼崮崤
崆赇赈赊铑铒铗铙
铟铠铡铢铣铤铧铨
铩铪铫铬铮铯铰铱
铳铵铷氪牾鸹秾逶
笺筇笸笪笮笠笥笤
笳笾笞偾偃偕偈傀
偬偻皑皎鸻徜舸舻
舴舷龛翎脬脘脲匐
猗猡猞猝斛猕馗馃
馄鸾孰庹庾痔痍疵
翊旌旎袤阇阈阉阊
阋阍阏羟粝粕敝焐
烯焓烽焖烷焗渍渚
淇淅淞渎涿淖挲淠
涸渑淦淝淬涪淙涫
渌淄惬悻悱惝惘悸
惆惚惇惮窕谌谏扈
皲谑裆袷裉谒谔谕
谖谗谙谛谝逯郿隈
粜隍隗婧婊婕娼婢
婵胬袈翌恿欸绫骐
绮绯绱骒绲骓绶绺
绻绾骖缁耠琫琵琶
琪瑛琦琥琨靓琰琮
琯琬琛琚辇鼋揳堞
搽揸揠堙趄揖颉塄
揿耋揄蛩蛰塆摒揆
掾聒葑葚靰靸葳葺
葸萼葆葩葶蒌萱戟
葭楮棼椟棹椤棰赍
椋椁椪棣椐鹁覃酤
酢酡鹂厥殚殛雯雱
辊辋椠辍辎斐睄睑
睇睃戢喋嗒喃喱喹
晷喈跖跗跞跚跎跏
跆蛱蛲蛭蛳蛐蛔蛞
蛴蛟蛘喁喟啾嗖喑
嗟喽嗞喀喔喙嵘嵖
崴遄詈嵎崽嵬嵛嵯
嵝嵫幄嵋赕铻铼铿
锃锂锆锇锉锏锑锒
锔锕掣矬氰毳毽犊
犄犋鹄犍嵇黍稃稂
筚筵筌傣傈舄牍傥
傧遑傩遁徨媭畲弑
颌翕釉鹆舜貂腈腌
腓腆腴腑腚腱鱿鲀
鲂颍猢猹猥飓觞觚
猱颎飧馇馊亵脔裒
痣痨痦痞痤痫痧赓
竦瓿啻颏鹇阑阒阕
粞遒孳焯焜焙焱鹈
湛渫湮湎湜渭湍湫
溲湟溆湲湔湉渥湄
滁愠惺愦惴愀愎愔
喾寐谟扉裢裎裥祾
祺谠幂谡谥谧遐孱
弼巽骘媪媛婷巯翚
皴婺骛缂缃缄彘缇
缈缌缑缒缗飨耢瑚
瑁瑜瑗瑄瑕遨骜韫
髡塬鄢趔趑摅摁蜇
搋搪搐搛搠摈彀毂
搦搡蓁戡蓍鄞靳蓐
蓦鹋蒽蓓蓖蓊蒯蓟
蓑蒿蒺蓠蒟蒡蒹蒴
蒗蓥颐楔楠楂楝楫
楸椴槌楯皙榈槎榉
楦楣楹椽裘剽甄酮
酰酯酩蜃碛碓硼碉
碚碇碜鹌辏龃龅訾
粲虞睚嗪韪嗷嗉睨
睢雎睥嘟嗑嗫嗬嗔
嗝戥嗄煦暄遢暌跬
跶跸跐跣跹跻蛸蜊
蜍蜉蜣畹蛹嗣嗯嗥
嗲嗳嗌嗍嗨嗐嗤嗵
罨嵊嵩嵴骰锗锛锜
锝锞锟锢锨锩锭锱
雉氲犏歃稞稗稔筠
筢筮筲筱牒煲敫徭
愆艄觎毹貊貅貉颔
腠腩腼腭腧塍媵詹
鲅鲆鲇鲈稣鲋鲐肄
鹐飕觥遛馐鹑亶瘃
痱痼痿瘐瘁瘆麂裔
歆旒雍阖阗阙羧豢
粳猷煳煜煨煅煊煸
煺滟溱溘漭滢溥溧
溽裟溻溷滗滫溴滏
滃滦溏滂滓溟滪愫
慑慊鲎骞窦窠窣裱
褚裨裾裰禊谩谪媾
嫫媲嫒嫔媸缙缜缛
辔骝缟缡缢缣骟耥
璈瑶瑭獒觏慝嫠韬
叆髦摽墁撂摞撄翥
踅摭墉墒榖綦蔫蔷
靺靼鞅靿甍蔸蔟蔺
戬蕖蔻蓿斡鹕蓼榛
榧榻榫榭槔榱槁槟
槠榷僰酽酶酹厮碡
碴碣碲磋臧豨殡霆
霁辕蜚裴翡龇龈睿
䁖睽嘞嘈嘌嘁嘎暧
暝踌踉蜞蜥蜮蝈蜴
蜱蜩蜷蜿螂蜢嘘嘡
鹗嘣嘤嘚嗾嘧罴罱
幔嶂幛赙罂骷骶鹘
锲锴锶锷锸锵镁镂
犒箐箦箧箍箸箬箅
箪箔箜箢箓毓僖儆
僳僭劁僮魃魆睾艋
鄱膈膑鲑鲔鲚鲛鲟
獐觫雒夤馑銮塾麽
瘌瘊瘘瘙廖韶旖膂
阚鄯鲞粿粼粽糁槊
鹚熘熥潢漕滹漯漶
潋潴漪漉漳漩澉潍
慵搴窨寤綮谮褡褙
褓褛褊谯谰谲暨屣
鹛嫣嫱嫖嫦嫚嫘嫡
鼐翟瞀鹜骠缥缦缧
缨骢缪缫耦耧瑾璜
璀璎璁璋璇奭髯髫
撷撅赭撸鋆撙撺墀
聩觐鞑蕙鞒蕈蕨蕤
蕞蕺瞢蕃蕲赜槿樯
槭樗樘樊槲醌醅靥
魇餍磔磙霈辘龉龊
觑瞌瞋瞑嘭噎噶颙
暹噘踔踝踟踒踬踮
踯踺踞蝽蝾蝻蝰蝮
螋蝓蝣蝼噗嘬颚噍
噢噙噜噌噔颛幞幡
嶙嶝骺骼骸镊镉镌
镍镏镒镓镔稷箴篑
篁篌篆牖儋徵磐虢
鹞膘滕鲠鲡鲢鲣鲥
鲧鲩獗獠觯馓馔麾
廛瘛瘼瘢瘠齑羯羰
𥻗遴糌糍糅熜熵熠
澍澌潸潦潲鋈潟潼
潺憬憧寮窳谳褴褟
褫谵熨屦嬉勰戮蝥
缬缮缯骣畿耩耨耪
璞璟靛璠璘聱螯髻
髭髹擀熹甏擞縠磬
颞蕻鞘颟薤薨檠薏
薮薜薅樾橛橇樵檎
橹樽樨橼墼橐翮醛
醐醍醚磲赝飙殪霖
霏霓錾辚臻遽氅瞟
瞠瞰嚄嚆噤暾蹀踹
踵踽蹉蹁螨蟒螈螅
螭螠螟噱噬噫噻噼
罹圜䦃镖镗镘镚镛
镝镞镠氇氆憩穑篝
篥篦篪篙盥劓翱魉
魈徼歙膳膦膙鲮鲱
鲲鲳鲴鲵鲷鲻獴獭
獬邂鹧廨赟瘰廪瘿
瘵瘴癃瘳斓麇麈嬴
壅羲糗瞥甑燎燠燔
燧濑濉潞澧澹澥澶
濂褰寰窸褶禧嬖犟
隰嬗颡缱缲缳璨璩
璐璪螫擤壕觳罄擢
薹鞡鞬薷薰藓藁檄
檩懋醢翳礅磴鹩龋
龌豳壑黻嚏嚅蹑蹒
蹊蟥螬螵疃螳蟑嚓
羁罽罾嶷黜黝髁髀
镡镢镣镦镧镩镪镫
罅黏簌篾篼簖簋鼢
黛儡鹪鼾皤魍龠繇
貘邈貔臌膻臆臃鲼
鲽鳀鳃鳅鳇鳊螽燮
鹫襄糜縻膺癍麋懑
濡濮濞濠濯蹇謇邃
襁檗擘孺隳嬷蟊鹬
鍪鏊鳌鬈鬃瞽鞯鞨
鞫鞧鞣藜藠藩醪蹙
礓燹餮瞿曛颢曜躇
蹚鹭蟛蟪蟠蟮鹮黠
黟髅髂镬镭镯馥簟
簪鼬雠艟鳎鳏鳐癞
癔癜癖糨蹩鎏懵彝
邋鬏攉攒鞲鞴藿蘧
蘅麓醮醯酃霪霭霨
黼嚯蹰蹶蹽蹼蹴蹾
蹿蠖蠓蟾蠊黢髋髌
镲籀籁齁魑艨鳓鳔
鳕鳗鳙麒鏖羸㸆瀚
瀣瀛襦谶襞骥缵瓒
攘蘩蘖醴霰酆矍曦
躅鼍巉黩黥黪镳镴
黧纂璺鼯臜鳜鳝鳟
獾孀骧瓘鼙醺礴颦
曩鳢癫麝夔爝灏禳
鐾羼蠡耱懿蘸鹳霾
氍饕躐髑镵穰饔鬻
鬟趱攫攥颧躜鼹癯
麟蠲蠹躞衢鑫灞襻
纛鬣攮囔馕戆爨齉
""" #""" 通用规范汉字表2013_二级字3000

通用规范汉字表2013_三级字1605 = """
亍尢彳卬殳𠙶毌邘
戋圢氕伋仝冮氿汈
氾忉宄𬣙讱扞圲圫
芏芃朳朸𨙸邨吒吖
屼屾辿钆仳伣伈癿
甪邠犴冱邡闫𬇕汋
䜣讻𬣞孖𬘓纩玒玓
玘玚刬𫭟坜坉扽𫭢
坋扺㧑毐芰芣苊苉
芘芴芠𫇭芤杕杙杄
杧杩尪尨轪𫐄坒芈
旴旵呙㕮岍𫵷岠岜
呇冏觃岙伾㑇伭佖
伲佁飏狃闶汧汫𣲘
𣲗沄沘𬇙汭㳇沇忮
忳忺𬣡祃诇邲诎诐
屃𫸩岊阽䢺阼妧妘
𨚕纮驲𫘜纻𬘘𫘝纼
玤玞玱玟邽邿坥坰
坬坽弆耵䢼𦭜茋苧
苾苠枅㭎枘枍矼矻
匼𬨂𬀩𬀪旿昇昄昒
昈咉咇咍岵岽岨岞
峂㟃囷𬬩钐钔钖牥
佴垈侁侹佸佺隹㑊
侂佽侘郈舠郐郃攽
肭肸肷狉狝饳忞於
炌炆泙沺泂泜泃泇
怊峃穸祋祊𫍣𬣳𬩽
鸤弢弨陑𬮿陎𬯀卺
乸妭姈𫰛迳叕𬳵驵
𬳶䌹驺𫠊绋绐砉耔
㛃玶珇珅𬍛珋玹珌
玿韨垚垯垙垲埏垍
耇鿍垎垴垟垞挓垵
垏拶荖荁荙荛茈茽
荄茺𬜬荓茳𦰡茛荭
㭕柷柃柊枹栐柖郚
剅䴓迺厖砆砑砄耏
奓䶮轵轷轹轺昺𪾢
昽盷咡咺昳昣哒昤
昫昡咥昪虷虸哃峘
耑峛𪨰峗峧帡钘𫓧
钜𬬮𬬱𬬭钪钬钭矧
秬俫舁俜俙俍垕衎
舣弇侴鸧䏡胠𦙶胈
胩胣朏飐訄饻庤疢
炣炟㶲洭洘洓洿㳚
泚浈浉洸洑洢洈洚
洺洨浐㳘洴洣恔宬
窀扂袆祏祐祕叚陧
陞娀姞姱姤姶姽枲
绖骃𬘡𬳽𬘩𫄧彖骉
恝珪珛珹琊玼珖𪟝
珽珦珫珒𬍤珢珕珝
𫭼埗垾垺埆垿埌埇
莰茝𬜯鄀莶莝䓖莙
栻桠𬂩桄梠栴梴栒
酎酏𫠆砵砠砫砬硁
恧翃郪𨐈辀辁𬌗剕
赀哢晅晊唝哳哱冔
晔晐晖畖蚄蚆𫑡帱
崁峿𪨶崄帨崀赆𬬸
钷𬬻𬬹𬬿𬭁眚甡笫
倻倴脩倮倕倞𫢸倓
倧衃虒舭舯舥瓞鬯
鸰脎朓胲虓鱽狴峱
狻眢𫗧勍痄疰痃竘
羖羓桊敉烠烔烶烻
𬊈涍浡浭浬涄涢涐
浰浟浛浼浲涘悈悃
悢𬒈宧窅窊窎扅扆
袪袗袯祧隺堲疍𨺙
陴烝砮㛚哿翀翂剟
𬳿𫄨绤骍𬘫䂮琎珸
珵琄琈琀珺掭堎堐
埼掎埫堌晢𫮃掞埪
壸㙍聍菝萚菥莿䓫
勚䓬萆菂菍菼萣䓨
菉䓛梼梽桲梾桯梣
梌桹敔厣硔鿎硙硚
硊硍勔䴕龁逴唪啫
翈㫰晙畤𬱖趼跂蛃
蚲𬟽蚺啴䎃崧崟崞
崒崌崡铏𫓯𫟹铕𫟼
铖铘铚铞铥铴牻牿
稆笱笯偰偡鸺偭偲
偁㿠鄅偓徛衒舳舲
鸼悆鄃瓻䝙脶脞脟
䏲鱾猇猊猄觖𠅤庱
庼庳痓䴔竫堃阌羝
羕焆烺焌淏𬇹淟淜
淴淯湴涴𬍡㥄惛惔
悰惙寁逭𬤇𫍯袼裈
祲𬤊𫍲谞艴弸弶𬯎
隃婞娵婼媖婳婍婌
婫婤婘婠𬘬𬘭𬴂𫘦
绹𫟅𬘯骕𫘧絜珷琲
琡琟琔琭堾堼揕㙘
堧喆堨塅堠絷𪣻𡎚
葜惎萳葙靬葴蒇蒈
鄚蒉蓇萩蒐葰葎鄑
蒎葖蒄萹棤棽棫椓
椑𬃊鹀椆棓棬棪椀
楗𬷕甦酦觌奡皕硪
欹詟𫐐辌棐龂𬹼黹
牚睎晫晪晱𧿹蛑畯
斝喤崶嵁𫶇崾嵅崿
嵚翙𫖮圌圐赑淼赒
鿏铹𬭊铽𨱇𫓶锊锍
锎𬭎锓犇颋稌筀筘
筜筥筅傃傉翛傒傕
舾畬𫖯脿腘䐃腙腒
𬱟鲃猰𫛭猯㺄馉凓
鄗𫷷廋廆鄌粢遆旐
𬮱焞𬊤欻𣸣溚溁湝
渰湓㴔渟溠渼溇湣
湑溞愐愃敩甯棨扊
裣祼婻媆媞㛹媓媂
媄毵矞𬴃𫘨缊缐骙
瑃瑓瑅瑆䴖瑖瑝瑔
瑀𤧛瑳瑂嶅瑑遘髢
塥堽赪摛塝搒搌蒱
蒨蓏蔀蓢蓂蒻蓣椹
楪榃榅楒楞楩榇椸
楙歅𬪩碃碏𬒔碈䃅
硿鄠辒𬨎𫐓龆觜䣘
暕鹍𫫇㬊暅跱蜐蜎
嵲赗骱锖𫓹锘锳锧
锪𬭚锫锬𬭛稑稙䅟
𬕂筻筼筶筦筤傺鹎
僇艅艉谼貆腽腨腯
鲉鲊鲌䲟𬶋𬶍鲏雊
猺飔觟𦝼馌裛廒瘀
瘅鄘鹒鄜麀鄣阘𫔶
煁煃煴煋煟煓滠溍
溹滆滉溦溵漷滧滘
滍愭慥慆塱𫌀裼禋
禔禘禒谫鹔𫖳愍嫄
媱戤勠戣𫘪𫘬缞耤
瑧𫞩瑨瑱瑷瑢斠摏
墕墈墐墘摴銎𡐓墚
撖𪤗靽鞁蔌蔈蓰蔹
蔊嘏榰榑槚𣗋槜榍
疐𬸘酺酾酲酴碶䃎
𬒗碨𥔲碹碥劂𫚖䴗
夥瞍鹖㬎跽蜾幖嶍
圙𨱏锺锼锽𬭤锾锿
镃镄镅馝鹙箨箖劄
僬僦僔僎槃㙦鲒鲕
𫚕鲖鲗鲘鲙𬶐𬶏𩽾
夐獍飗𬸚凘廑廙瘗
瘥瘕鲝鄫熇漹漖潆
漤潩漼漴㽏漈漋漻
慬窬窭㮾𬤝褕禛禚
隩嫕嫭嫜嫪𬙂㻬麹
璆漦叇墣墦墡劐薁
蕰蔃鼒槱鹝磏磉殣
慭霅暵暲暶踦踣䗖
蝘蝲蝤噇噂噀罶嶲
嶓㠇嶟嶒镆镈镋镎
𬭩镕稹儇皞皛䴘艎
艏鹟𩾃鲦鲪鲬橥觭
鹠鹡糇糈翦鹢鹣熛
潖潵㵐澂澛瑬潽潾
潏憭憕𬸣戭褯禤𫍽
嫽遹𬴊璥璲璒憙擐
鄹薳鞔黇𬞟蕗薢蕹
橞橑橦醑觱磡𥕢磜
豮𫟦𬺈𫠜鹾虤暿曌
曈㬚蹅踶䗛螗疁㠓
幪𪩘嶦𬭬𨱑𬭯馞穄
篚篯簉鼽衠盦螣縢
鲭鲯鲰鲺鲹𫗴亸癀
瘭𬸦羱糒燋熻燊燚
燏濩濋澪澽澴澭澼
憷憺懔黉嬛鹨翯𫄷
璱𤩽璬璮髽擿薿薸
檑櫆檞醨繄磹磻瞫
瞵蹐蟏㘎𬭳镤𬭶𫔍
镥镨𬭸𨱔𬭼𫔎矰穙
穜穟簕簃簏儦魋斶
艚𬸪谿䲠𬶟鲾𬶠鲿
鳁鳂鳈鳉獯䗪馘襕
襚𬶨螱甓嬬嬥𦈡𫄸
瓀釐鬶爇鞳鞮𬟁藟
藦藨鹲檫黡礞礌𥖨
蹢蹜蟫䗴嚚髃镮镱
酂馧簠簝簰鼫鼩皦
臑䲢鳑鳒鹱鹯癗𦒍
旞翷冁䎖瀔瀍瀌襜
䴙𬙊嚭㰀鬷醭蹯蠋
翾鳘儳儴鼗𬶭𩾌鳚
鳛麑麖蠃彟嬿鬒蘘
欂醵颥甗𨟠巇酅髎
犨𬶮𨭉㸌爔瀱瀹瀼
瀵襫孅骦𬙋耰𤫉瓖
鬘趯𬺓罍鼱鳠鳡鳣
爟爚灈韂糵蘼礵鹴
躔皭龢鳤亹籥鼷𫚭
玃醾齇觿蠼
""" #""" 通用规范汉字表2013_三级字1605


gb2312_1980_一级汉字3755 = """
啊阿埃挨哎唉哀皑
癌蔼矮艾碍爱隘鞍
氨安俺按暗岸胺案
肮昂盎凹敖熬翱袄
傲奥懊澳芭捌扒叭
吧笆八疤巴拔跋靶
把耙坝霸罢爸白柏
百摆佰败拜稗斑班
搬扳般颁板版扮拌
伴瓣半办绊邦帮梆
榜膀绑棒磅蚌镑傍
谤苞胞包褒剥薄雹
保堡饱宝抱报暴豹
鲍爆杯碑悲卑北辈
背贝钡倍狈备惫焙
被奔苯本笨崩绷甭
泵蹦迸逼鼻比鄙笔
彼碧蓖蔽毕毙毖币
庇痹闭敝弊必辟壁
臂避陛鞭边编贬扁
便变卞辨辩辫遍标
彪膘表鳖憋别瘪彬
斌濒滨宾摈兵冰柄
丙秉饼炳病并玻菠
播拨钵波博勃搏铂
箔伯帛舶脖膊渤泊
驳捕卜哺补埠不布
步簿部怖擦猜裁材
才财睬踩采彩菜蔡
餐参蚕残惭惨灿苍
舱仓沧藏操糙槽曹
草厕策侧册测层蹭
插叉茬茶查碴搽察
岔差诧拆柴豺搀掺
蝉馋谗缠铲产阐颤
昌猖场尝常长偿肠
厂敞畅唱倡超抄钞
朝嘲潮巢吵炒车扯
撤掣彻澈郴臣辰尘
晨忱沉陈趁衬撑称
城橙成呈乘程惩澄
诚承逞骋秤吃痴持
匙池迟弛驰耻齿侈
尺赤翅斥炽充冲虫
崇宠抽酬畴踌稠愁
筹仇绸瞅丑臭初出
橱厨躇锄雏滁除楚
础储矗搐触处揣川
穿椽传船喘串疮窗
幢床闯创吹炊捶锤
垂春椿醇唇淳纯蠢
戳绰疵茨磁雌辞慈
瓷词此刺赐次聪葱
囱匆从丛凑粗醋簇
促蹿篡窜摧崔催脆
瘁粹淬翠村存寸磋
撮搓措挫错搭达答
瘩打大呆歹傣戴带
殆代贷袋待逮怠耽
担丹单郸掸胆旦氮
但惮淡诞弹蛋当挡
党荡档刀捣蹈倒岛
祷导到稻悼道盗德
得的蹬灯登等瞪凳
邓堤低滴迪敌笛狄
涤翟嫡抵底地蒂第
帝弟递缔颠掂滇碘
点典靛垫电佃甸店
惦奠淀殿碉叼雕凋
刁掉吊钓调跌爹碟
蝶迭谍叠丁盯叮钉
顶鼎锭定订丢东冬
董懂动栋侗恫冻洞
兜抖斗陡豆逗痘都
督毒犊独读堵睹赌
杜镀肚度渡妒端短
锻段断缎堆兑队对
墩吨蹲敦顿囤钝盾
遁掇哆多夺垛躲朵
跺舵剁惰堕蛾峨鹅
俄额讹娥恶厄扼遏
鄂饿恩而儿耳尔饵
洱二贰发罚筏伐乏
阀法珐藩帆番翻樊
矾钒繁凡烦反返范
贩犯饭泛坊芳方肪
房防妨仿访纺放菲
非啡飞肥匪诽吠肺
废沸费芬酚吩氛分
纷坟焚汾粉奋份忿
愤粪丰封枫蜂峰锋
风疯烽逢冯缝讽奉
凤佛否夫敷肤孵扶
拂辐幅氟符伏俘服
浮涪福袱弗甫抚辅
俯釜斧脯腑府腐赴
副覆赋复傅付阜父
腹负富讣附妇缚咐
噶嘎该改概钙盖溉
干甘杆柑竿肝赶感
秆敢赣冈刚钢缸肛
纲岗港杠篙皋高膏
羔糕搞镐稿告哥歌
搁戈鸽胳疙割革葛
格蛤阁隔铬个各给
根跟耕更庚羹埂耿
梗工攻功恭龚供躬
公宫弓巩汞拱贡共
钩勾沟苟狗垢构购
够辜菇咕箍估沽孤
姑鼓古蛊骨谷股故
顾固雇刮瓜剐寡挂
褂乖拐怪棺关官冠
观管馆罐惯灌贯光
广逛瑰规圭硅归龟
闺轨鬼诡癸桂柜跪
贵刽辊滚棍锅郭国
果裹过哈骸孩海氦
亥害骇酣憨邯韩含
涵寒函喊罕翰撼捍
旱憾悍焊汗汉夯杭
航壕嚎豪毫郝好耗
号浩呵喝荷菏核禾
和何合盒貉阂河涸
赫褐鹤贺嘿黑痕很
狠恨哼亨横衡恒轰
哄烘虹鸿洪宏弘红
喉侯猴吼厚候后呼
乎忽瑚壶葫胡蝴狐
糊湖弧虎唬护互沪
户花哗华猾滑画划
化话槐徊怀淮坏欢
环桓还缓换患唤痪
豢焕涣宦幻荒慌黄
磺蝗簧皇凰惶煌晃
幌恍谎灰挥辉徽恢
蛔回毁悔慧卉惠晦
贿秽会烩汇讳诲绘
荤昏婚魂浑混豁活
伙火获或惑霍货祸
击圾基机畸稽积箕
肌饥迹激讥鸡姬绩
缉吉极棘辑籍集及
急疾汲即嫉级挤几
脊己蓟技冀季伎祭
剂悸济寄寂计记既
忌际妓继纪嘉枷夹
佳家加荚颊贾甲钾
假稼价架驾嫁歼监
坚尖笺间煎兼肩艰
奸缄茧检柬碱硷拣
捡简俭剪减荐槛鉴
践贱见键箭件健舰
剑饯渐溅涧建僵姜
将浆江疆蒋桨奖讲
匠酱降蕉椒礁焦胶
交郊浇骄娇嚼搅铰
矫侥脚狡角饺缴绞
剿教酵轿较叫窖揭
接皆秸街阶截劫节
桔杰捷睫竭洁结解
姐戒藉芥界借介疥
诫届巾筋斤金今津
襟紧锦仅谨进靳晋
禁近烬浸尽劲荆兢
茎睛晶鲸京惊精粳
经井警景颈静境敬
镜径痉靖竟竞净炯
窘揪究纠玖韭久灸
九酒厩救旧臼舅咎
就疚鞠拘狙疽居驹
菊局咀矩举沮聚拒
据巨具距踞锯俱句
惧炬剧捐鹃娟倦眷
卷绢撅攫抉掘倔爵
觉决诀绝均菌钧军
君峻俊竣浚郡骏喀
咖卡咯开揩楷凯慨
刊堪勘坎砍看康慷
糠扛抗亢炕考拷烤
靠坷苛柯棵磕颗科
壳咳可渴克刻客课
肯啃垦恳坑吭空恐
孔控抠口扣寇枯哭
窟苦酷库裤夸垮挎
跨胯块筷侩快宽款
匡筐狂框矿眶旷况
亏盔岿窥葵奎魁傀
馈愧溃坤昆捆困括
扩廓阔垃拉喇蜡腊
辣啦莱来赖蓝婪栏
拦篮阑兰澜谰揽览
懒缆烂滥琅榔狼廊
郎朗浪捞劳牢老佬
姥酪烙涝勒乐雷镭
蕾磊累儡垒擂肋类
泪棱楞冷厘梨犁黎
篱狸离漓理李里鲤
礼莉荔吏栗丽厉励
砾历利傈例俐痢立
粒沥隶力璃哩俩联
莲连镰廉怜涟帘敛
脸链恋炼练粮凉梁
粱良两辆量晾亮谅
撩聊僚疗燎寥辽潦
了撂镣廖料列裂烈
劣猎琳林磷霖临邻
鳞淋凛赁吝拎玲菱
零龄铃伶羚凌灵陵
岭领另令溜琉榴硫
馏留刘瘤流柳六龙
聋咙笼窿隆垄拢陇
楼娄搂篓漏陋芦卢
颅庐炉掳卤虏鲁麓
碌露路赂鹿潞禄录
陆戮驴吕铝侣旅履
屡缕虑氯律率滤绿
峦挛孪滦卵乱掠略
抡轮伦仑沦纶论萝
螺罗逻锣箩骡裸落
洛骆络妈麻玛码蚂
马骂嘛吗埋买麦卖
迈脉瞒馒蛮满蔓曼
慢漫谩芒茫盲氓忙
莽猫茅锚毛矛铆卯
茂冒帽貌贸么玫枚
梅酶霉煤没眉媒镁
每美昧寐妹媚门闷
们萌蒙檬盟锰猛梦
孟眯醚靡糜迷谜弥
米秘觅泌蜜密幂棉
眠绵冕免勉娩缅面
苗描瞄藐秒渺庙妙
蔑灭民抿皿敏悯闽
明螟鸣铭名命谬摸
摹蘑模膜磨摩魔抹
末莫墨默沫漠寞陌
谋牟某拇牡亩姆母
墓暮幕募慕木目睦
牧穆拿哪呐钠那娜
纳氖乃奶耐奈南男
难囊挠脑恼闹淖呢
馁内嫩能妮霓倪泥
尼拟你匿腻逆溺蔫
拈年碾撵捻念娘酿
鸟尿捏聂孽啮镊镍
涅您柠狞凝宁拧泞
牛扭钮纽脓浓农弄
奴努怒女暖虐疟挪
懦糯诺哦欧鸥殴藕
呕偶沤啪趴爬帕怕
琶拍排牌徘湃派攀
潘盘磐盼畔判叛乓
庞旁耪胖抛咆刨炮
袍跑泡呸胚培裴赔
陪配佩沛喷盆砰抨
烹澎彭蓬棚硼篷膨
朋鹏捧碰坯砒霹批
披劈琵毗啤脾疲皮
匹痞僻屁譬篇偏片
骗飘漂瓢票撇瞥拼
频贫品聘乒坪苹萍
平凭瓶评屏坡泼颇
婆破魄迫粕剖扑铺
仆莆葡菩蒲埔朴圃
普浦谱曝瀑期欺栖
戚妻七凄漆柒沏其
棋奇歧畦崎脐齐旗
祈祁骑起岂乞企启
契砌器气迄弃汽泣
讫掐恰洽牵扦钎铅
千迁签仟谦乾黔钱
钳前潜遣浅谴堑嵌
欠歉枪呛腔羌墙蔷
强抢橇锹敲悄桥瞧
乔侨巧鞘撬翘峭俏
窍切茄且怯窃钦侵
亲秦琴勤芹擒禽寝
沁青轻氢倾卿清擎
晴氰情顷请庆琼穷
秋丘邱球求囚酋泅
趋区蛆曲躯屈驱渠
取娶龋趣去圈颧权
醛泉全痊拳犬券劝
缺炔瘸却鹊榷确雀
裙群然燃冉染瓤壤
攘嚷让饶扰绕惹热
壬仁人忍韧任认刃
妊纫扔仍日戎茸蓉
荣融熔溶容绒冗揉
柔肉茹蠕儒孺如辱
乳汝入褥软阮蕊瑞
锐闰润若弱撒洒萨
腮鳃塞赛三叁伞散
桑嗓丧搔骚扫嫂瑟
色涩森僧莎砂杀刹
沙纱傻啥煞筛晒珊
苫杉山删煽衫闪陕
擅赡膳善汕扇缮墒
伤商赏晌上尚裳梢
捎稍烧芍勺韶少哨
邵绍奢赊蛇舌舍赦
摄射慑涉社设砷申
呻伸身深娠绅神沈
审婶甚肾慎渗声生
甥牲升绳省盛剩胜
圣师失狮施湿诗尸
虱十石拾时什食蚀
实识史矢使屎驶始
式示士世柿事拭誓
逝势是嗜噬适仕侍
释饰氏市恃室视试
收手首守寿授售受
瘦兽蔬枢梳殊抒输
叔舒淑疏书赎孰熟
薯暑曙署蜀黍鼠属
术述树束戍竖墅庶
数漱恕刷耍摔衰甩
帅栓拴霜双爽谁水
睡税吮瞬顺舜说硕
朔烁斯撕嘶思私司
丝死肆寺嗣四伺似
饲巳松耸怂颂送宋
讼诵搜艘擞嗽苏酥
俗素速粟僳塑溯宿
诉肃酸蒜算虽隋随
绥髓碎岁穗遂隧祟
孙损笋蓑梭唆缩琐
索锁所塌他它她塔
獭挞蹋踏胎苔抬台
泰酞太态汰坍摊贪
瘫滩坛檀痰潭谭谈
坦毯袒碳探叹炭汤
塘搪堂棠膛唐糖倘
躺淌趟烫掏涛滔绦
萄桃逃淘陶讨套特
藤腾疼誊梯剔踢锑
提题蹄啼体替嚏惕
涕剃屉天添填田甜
恬舔腆挑条迢眺跳
贴铁帖厅听烃汀廷
停亭庭挺艇通桐酮
瞳同铜彤童桶捅筒
统痛偷投头透凸秃
突图徒途涂屠土吐
兔湍团推颓腿蜕褪
退吞屯臀拖托脱鸵
陀驮驼椭妥拓唾挖
哇蛙洼娃瓦袜歪外
豌弯湾玩顽丸烷完
碗挽晚皖惋宛婉万
腕汪王亡枉网往旺
望忘妄威巍微危韦
违桅围唯惟为潍维
苇萎委伟伪尾纬未
蔚味畏胃喂魏位渭
谓尉慰卫瘟温蚊文
闻纹吻稳紊问嗡翁
瓮挝蜗涡窝我斡卧
握沃巫呜钨乌污诬
屋无芜梧吾吴毋武
五捂午舞伍侮坞戊
雾晤物勿务悟误昔
熙析西硒矽晰嘻吸
锡牺稀息希悉膝夕
惜熄烯溪汐犀檄袭
席习媳喜铣洗系隙
戏细瞎虾匣霞辖暇
峡侠狭下厦夏吓掀
锨先仙鲜纤咸贤衔
舷闲涎弦嫌显险现
献县腺馅羡宪陷限
线相厢镶香箱襄湘
乡翔祥详想响享项
巷橡像向象萧硝霄
削哮嚣销消宵淆晓
小孝校肖啸笑效楔
些歇蝎鞋协挟携邪
斜胁谐写械卸蟹懈
泄泻谢屑薪芯锌欣
辛新忻心信衅星腥
猩惺兴刑型形邢行
醒幸杏性姓兄凶胸
匈汹雄熊休修羞朽
嗅锈秀袖绣墟戌需
虚嘘须徐许蓄酗叙
旭序畜恤絮婿绪续
轩喧宣悬旋玄选癣
眩绚靴薛学穴雪血
勋熏循旬询寻驯巡
殉汛训讯逊迅压押
鸦鸭呀丫芽牙蚜崖
衙涯雅哑亚讶焉咽
阉烟淹盐严研蜒岩
延言颜阎炎沿奄掩
眼衍演艳堰燕厌砚
雁唁彦焰宴谚验殃
央鸯秧杨扬佯疡羊
洋阳氧仰痒养样漾
邀腰妖瑶摇尧遥窑
谣姚咬舀药要耀椰
噎耶爷野冶也页掖
业叶曳腋夜液一壹
医揖铱依伊衣颐夷
遗移仪胰疑沂宜姨
彝椅蚁倚已乙矣以
艺抑易邑屹亿役臆
逸肄疫亦裔意毅忆
义益溢诣议谊译异
翼翌绎茵荫因殷音
阴姻吟银淫寅饮尹
引隐印英樱婴鹰应
缨莹萤营荧蝇迎赢
盈影颖硬映哟拥佣
臃痈庸雍踊蛹咏泳
涌永恿勇用幽优悠
忧尤由邮铀犹油游
酉有友右佑釉诱又
幼迂淤于盂榆虞愚
舆余俞逾鱼愉渝渔
隅予娱雨与屿禹宇
语羽玉域芋郁吁遇
喻峪御愈欲狱育誉
浴寓裕预豫驭鸳渊
冤元垣袁原援辕园
员圆猿源缘远苑愿
怨院曰约越跃钥岳
粤月悦阅耘云郧匀
陨允运蕴酝晕韵孕
匝砸杂栽哉灾宰载
再在咱攒暂赞赃脏
葬遭糟凿藻枣早澡
蚤躁噪造皂灶燥责
择则泽贼怎增憎曾
赠扎喳渣札轧铡闸
眨栅榨咋乍炸诈摘
斋宅窄债寨瞻毡詹
粘沾盏斩辗崭展蘸
栈占战站湛绽樟章
彰漳张掌涨杖丈帐
账仗胀瘴障招昭找
沼赵照罩兆肇召遮
折哲蛰辙者锗蔗这
浙珍斟真甄砧臻贞
针侦枕疹诊震振镇
阵蒸挣睁征狰争怔
整拯正政帧症郑证
芝枝支吱蜘知肢脂
汁之织职直植殖执
值侄址指止趾只旨
纸志挚掷至致置帜
峙制智秩稚质炙痔
滞治窒中盅忠钟衷
终种肿重仲众舟周
州洲诌粥轴肘帚咒
皱宙昼骤珠株蛛朱
猪诸诛逐竹烛煮拄
瞩嘱主著柱助蛀贮
铸筑住注祝驻抓爪
拽专砖转撰赚篆桩
庄装妆撞壮状椎锥
追赘坠缀谆准捉拙
卓桌琢茁酌啄着灼
浊兹咨资姿滋淄孜
紫仔籽滓子自渍字
鬃棕踪宗综总纵邹
走奏揍租足卒族祖
诅阻组钻纂嘴醉最
罪尊遵昨左佐柞做
作坐座
""" #""" gb2312_1980_一级汉字3755


gb2312_1980_二级汉字3008 = """
亍丌兀丐廿卅丕亘
丞鬲孬噩丨禺丿匕
乇夭爻卮氐囟胤馗
毓睾鼗丶亟鼐乜乩
亓芈孛啬嘏仄厍厝
厣厥厮靥赝匚叵匦
匮匾赜卦卣刂刈刎
刭刳刿剀剌剞剡剜
蒯剽劂劁劐劓冂罔
亻仃仉仂仨仡仫仞
伛仳伢佤仵伥伧伉
伫佞佧攸佚佝佟佗
伲伽佶佴侑侉侃侏
佾佻侪佼侬侔俦俨
俪俅俚俣俜俑俟俸
倩偌俳倬倏倮倭俾
倜倌倥倨偾偃偕偈
偎偬偻傥傧傩傺僖
儆僭僬僦僮儇儋仝
氽佘佥俎龠汆籴兮
巽黉馘冁夔勹匍訇
匐凫夙兕亠兖亳衮
袤亵脔裒禀嬴蠃羸
冫冱冽冼凇冖冢冥
讠讦讧讪讴讵讷诂
诃诋诏诎诒诓诔诖
诘诙诜诟诠诤诨诩
诮诰诳诶诹诼诿谀
谂谄谇谌谏谑谒谔
谕谖谙谛谘谝谟谠
谡谥谧谪谫谮谯谲
谳谵谶卩卺阝阢阡
阱阪阽阼陂陉陔陟
陧陬陲陴隈隍隗隰
邗邛邝邙邬邡邴邳
邶邺邸邰郏郅邾郐
郄郇郓郦郢郜郗郛
郫郯郾鄄鄢鄞鄣鄱
鄯鄹酃酆刍奂劢劬
劭劾哿勐勖勰叟燮
矍廴凵凼鬯厶弁畚
巯坌垩垡塾墼壅壑
圩圬圪圳圹圮圯坜
圻坂坩垅坫垆坼坻
坨坭坶坳垭垤垌垲
埏垧垴垓垠埕埘埚
埙埒垸埴埯埸埤埝
堋堍埽埭堀堞堙塄
堠塥塬墁墉墚墀馨
鼙懿艹艽艿芏芊芨
芄芎芑芗芙芫芸芾
芰苈苊苣芘芷芮苋
苌苁芩芴芡芪芟苄
苎芤苡茉苷苤茏茇
苜苴苒苘茌苻苓茑
茚茆茔茕苠苕茜荑
荛荜茈莒茼茴茱莛
荞茯荏荇荃荟荀茗
荠茭茺茳荦荥荨茛
荩荬荪荭荮莰荸莳
莴莠莪莓莜莅荼莶
莩荽莸荻莘莞莨莺
莼菁萁菥菘堇萘萋
菝菽菖萜萸萑萆菔
菟萏萃菸菹菪菅菀
萦菰菡葜葑葚葙葳
蒇蒈葺蒉葸萼葆葩
葶蒌蒎萱葭蓁蓍蓐
蓦蒽蓓蓊蒿蒺蓠蒡
蒹蒴蒗蓥蓣蔌甍蔸
蓰蔹蔟蔺蕖蔻蓿蓼
蕙蕈蕨蕤蕞蕺瞢蕃
蕲蕻薤薨薇薏蕹薮
薜薅薹薷薰藓藁藜
藿蘧蘅蘩蘖蘼廾弈
夼奁耷奕奚奘匏尢
尥尬尴扌扪抟抻拊
拚拗拮挢拶挹捋捃
掭揶捱捺掎掴捭掬
掊捩掮掼揲揸揠揿
揄揞揎摒揆掾摅摁
搋搛搠搌搦搡摞撄
摭撖摺撷撸撙撺擀
擐擗擤擢攉攥攮弋
忒甙弑卟叱叽叩叨
叻吒吖吆呋呒呓呔
呖呃吡呗呙吣吲咂
咔呷呱呤咚咛咄呶
呦咝哐咭哂咴哒咧
咦哓哔呲咣哕咻咿
哌哙哚哜咩咪咤哝
哏哞唛哧唠哽唔哳
唢唣唏唑唧唪啧喏
喵啉啭啁啕唿啐唼
唷啖啵啶啷唳唰啜
喋嗒喃喱喹喈喁喟
啾嗖喑啻嗟喽喾喔
喙嗪嗷嗉嘟嗑嗫嗬
嗔嗦嗝嗄嗯嗥嗲嗳
嗌嗍嗨嗵嗤辔嘞嘈
嘌嘁嘤嘣嗾嘀嘧嘭
噘嘹噗嘬噍噢噙噜
噌噔嚆噤噱噫噻噼
嚅嚓嚯囔囗囝囡囵
囫囹囿圄圊圉圜帏
帙帔帑帱帻帼帷幄
幔幛幞幡岌屺岍岐
岖岈岘岙岑岚岜岵
岢岽岬岫岱岣峁岷
峄峒峤峋峥崂崃崧
崦崮崤崞崆崛嵘崾
崴崽嵬嵛嵯嵝嵫嵋
嵊嵩嵴嶂嶙嶝豳嶷
巅彳彷徂徇徉後徕
徙徜徨徭徵徼衢彡
犭犰犴犷犸狃狁狎
狍狒狨狯狩狲狴狷
猁狳猃狺狻猗猓猡
猊猞猝猕猢猹猥猬
猸猱獐獍獗獠獬獯
獾舛夥飧夤夂饣饧
饨饩饪饫饬饴饷饽
馀馄馇馊馍馐馑馓
馔馕庀庑庋庖庥庠
庹庵庾庳赓廒廑廛
廨廪膺忄忉忖忏怃
忮怄忡忤忾怅怆忪
忭忸怙怵怦怛怏怍
怩怫怊怿怡恸恹恻
恺恂恪恽悖悚悭悝
悃悒悌悛惬悻悱惝
惘惆惚悴愠愦愕愣
惴愀愎愫慊慵憬憔
憧憷懔懵忝隳闩闫
闱闳闵闶闼闾阃阄
阆阈阊阋阌阍阏阒
阕阖阗阙阚丬爿戕
氵汔汜汊沣沅沐沔
沌汨汩汴汶沆沩泐
泔沭泷泸泱泗沲泠
泖泺泫泮沱泓泯泾
洹洧洌浃浈洇洄洙
洎洫浍洮洵洚浏浒
浔洳涑浯涞涠浞涓
涔浜浠浼浣渚淇淅
淞渎涿淠渑淦淝淙
渖涫渌涮渫湮湎湫
溲湟溆湓湔渲渥湄
滟溱溘滠漭滢溥溧
溽溻溷滗溴滏溏滂
溟潢潆潇漤漕滹漯
漶潋潴漪漉漩澉澍
澌潸潲潼潺濑濉澧
澹澶濂濡濮濞濠濯
瀚瀣瀛瀹瀵灏灞宀
宄宕宓宥宸甯骞搴
寤寮褰寰蹇謇辶迓
迕迥迮迤迩迦迳迨
逅逄逋逦逑逍逖逡
逵逶逭逯遄遑遒遐
遨遘遢遛暹遴遽邂
邈邃邋彐彗彖彘尻
咫屐屙孱屣屦羼弪
弩弭艴弼鬻屮妁妃
妍妩妪妣妗姊妫妞
妤姒妲妯姗妾娅娆
姝娈姣姘姹娌娉娲
娴娑娣娓婀婧婊婕
娼婢婵胬媪媛婷婺
媾嫫媲嫒嫔媸嫠嫣
嫱嫖嫦嫘嫜嬉嬗嬖
嬲嬷孀尕尜孚孥孳
孑孓孢驵驷驸驺驿
驽骀骁骅骈骊骐骒
骓骖骘骛骜骝骟骠
骢骣骥骧纟纡纣纥
纨纩纭纰纾绀绁绂
绉绋绌绐绔绗绛绠
绡绨绫绮绯绱绲缍
绶绺绻绾缁缂缃缇
缈缋缌缏缑缒缗缙
缜缛缟缡缢缣缤缥
缦缧缪缫缬缭缯缰
缱缲缳缵幺畿巛甾
邕玎玑玮玢玟珏珂
珑玷玳珀珉珈珥珙
顼琊珩珧珞玺珲琏
琪瑛琦琥琨琰琮琬
琛琚瑁瑜瑗瑕瑙瑷
瑭瑾璜璎璀璁璇璋
璞璨璩璐璧瓒璺韪
韫韬杌杓杞杈杩枥
枇杪杳枘枧杵枨枞
枭枋杷杼柰栉柘栊
柩枰栌柙枵柚枳柝
栀柃枸柢栎柁柽栲
栳桠桡桎桢桄桤梃
栝桕桦桁桧桀栾桊
桉栩梵梏桴桷梓桫
棂楮棼椟椠棹椤棰
椋椁楗棣椐楱椹楠
楂楝榄楫榀榘楸椴
槌榇榈槎榉楦楣楹
榛榧榻榫榭槔榱槁
槊槟榕槠榍槿樯槭
樗樘橥槲橄樾檠橐
橛樵檎橹樽樨橘橼
檑檐檩檗檫猷獒殁
殂殇殄殒殓殍殚殛
殡殪轫轭轱轲轳轵
轶轸轷轹轺轼轾辁
辂辄辇辋辍辎辏辘
辚軎戋戗戛戟戢戡
戥戤戬臧瓯瓴瓿甏
甑甓攴旮旯旰昊昙
杲昃昕昀炅曷昝昴
昱昶昵耆晟晔晁晏
晖晡晗晷暄暌暧暝
暾曛曜曦曩贲贳贶
贻贽赀赅赆赈赉赇
赍赕赙觇觊觋觌觎
觏觐觑牮犟牝牦牯
牾牿犄犋犍犏犒挈
挲掰搿擘耄毪毳毽
毵毹氅氇氆氍氕氘
氙氚氡氩氤氪氲攵
敕敫牍牒牖爰虢刖
肟肜肓肼朊肽肱肫
肭肴肷胧胨胩胪胛
胂胄胙胍胗朐胝胫
胱胴胭脍脎胲胼朕
脒豚脶脞脬脘脲腈
腌腓腴腙腚腱腠腩
腼腽腭腧塍媵膈膂
膑滕膣膪臌朦臊膻
臁膦欤欷欹歃歆歙
飑飒飓飕飙飚殳彀
毂觳斐齑斓於旆旄
旃旌旎旒旖炀炜炖
炝炻烀炷炫炱烨烊
焐焓焖焯焱煳煜煨
煅煲煊煸煺熘熳熵
熨熠燠燔燧燹爝爨
灬焘煦熹戾戽扃扈
扉礻祀祆祉祛祜祓
祚祢祗祠祯祧祺禅
禊禚禧禳忑忐怼恝
恚恧恁恙恣悫愆愍
慝憩憝懋懑戆肀聿
沓泶淼矶矸砀砉砗
砘砑斫砭砜砝砹砺
砻砟砼砥砬砣砩硎
硭硖硗砦硐硇硌硪
碛碓碚碇碜碡碣碲
碹碥磔磙磉磬磲礅
磴礓礤礞礴龛黹黻
黼盱眄眍盹眇眈眚
眢眙眭眦眵眸睐睑
睇睃睚睨睢睥睿瞍
睽瞀瞌瞑瞟瞠瞰瞵
瞽町畀畎畋畈畛畲
畹疃罘罡罟詈罨罴
罱罹羁罾盍盥蠲钅
钆钇钋钊钌钍钏钐
钔钗钕钚钛钜钣钤
钫钪钭钬钯钰钲钴
钶钷钸钹钺钼钽钿
铄铈铉铊铋铌铍铎
铐铑铒铕铖铗铙铘
铛铞铟铠铢铤铥铧
铨铪铩铫铮铯铳铴
铵铷铹铼铽铿锃锂
锆锇锉锊锍锎锏锒
锓锔锕锖锘锛锝锞
锟锢锪锫锩锬锱锲
锴锶锷锸锼锾锿镂
锵镄镅镆镉镌镎镏
镒镓镔镖镗镘镙镛
镞镟镝镡镢镤镥镦
镧镨镩镪镫镬镯镱
镲镳锺矧矬雉秕秭
秣秫稆嵇稃稂稞稔
稹稷穑黏馥穰皈皎
皓皙皤瓞瓠甬鸠鸢
鸨鸩鸪鸫鸬鸲鸱鸶
鸸鸷鸹鸺鸾鹁鹂鹄
鹆鹇鹈鹉鹋鹌鹎鹑
鹕鹗鹚鹛鹜鹞鹣鹦
鹧鹨鹩鹪鹫鹬鹱鹭
鹳疒疔疖疠疝疬疣
疳疴疸痄疱疰痃痂
痖痍痣痨痦痤痫痧
瘃痱痼痿瘐瘀瘅瘌
瘗瘊瘥瘘瘕瘙瘛瘼
瘢瘠癀瘭瘰瘿瘵癃
瘾瘳癍癞癔癜癖癫
癯翊竦穸穹窀窆窈
窕窦窠窬窨窭窳衤
衩衲衽衿袂袢裆袷
袼裉裢裎裣裥裱褚
裼裨裾裰褡褙褓褛
褊褴褫褶襁襦襻疋
胥皲皴矜耒耔耖耜
耠耢耥耦耧耩耨耱
耋耵聃聆聍聒聩聱
覃顸颀颃颉颌颍颏
颔颚颛颞颟颡颢颥
颦虍虔虬虮虿虺虼
虻蚨蚍蚋蚬蚝蚧蚣
蚪蚓蚩蚶蛄蚵蛎蚰
蚺蚱蚯蛉蛏蚴蛩蛱
蛲蛭蛳蛐蜓蛞蛴蛟
蛘蛑蜃蜇蛸蜈蜊蜍
蜉蜣蜻蜞蜥蜮蜚蜾
蝈蜴蜱蜩蜷蜿螂蜢
蝽蝾蝻蝠蝰蝌蝮螋
蝓蝣蝼蝤蝙蝥螓螯
螨蟒蟆螈螅螭螗螃
螫蟥螬螵螳蟋蟓螽
蟑蟀蟊蟛蟪蟠蟮蠖
蠓蟾蠊蠛蠡蠹蠼缶
罂罄罅舐竺竽笈笃
笄笕笊笫笏筇笸笪
笙笮笱笠笥笤笳笾
笞筘筚筅筵筌筝筠
筮筻筢筲筱箐箦箧
箸箬箝箨箅箪箜箢
箫箴篑篁篌篝篚篥
篦篪簌篾篼簏簖簋
簟簪簦簸籁籀臾舁
舂舄臬衄舡舢舣舭
舯舨舫舸舻舳舴舾
艄艉艋艏艚艟艨衾
袅袈裘裟襞羝羟羧
羯羰羲籼敉粑粝粜
粞粢粲粼粽糁糇糌
糍糈糅糗糨艮暨羿
翎翕翥翡翦翩翮翳
糸絷綦綮繇纛麸麴
赳趄趔趑趱赧赭豇
豉酊酐酎酏酤酢酡
酰酩酯酽酾酲酴酹
醌醅醐醍醑醢醣醪
醭醮醯醵醴醺豕鹾
趸跫踅蹙蹩趵趿趼
趺跄跖跗跚跞跎跏
跛跆跬跷跸跣跹跻
跤踉跽踔踝踟踬踮
踣踯踺蹀踹踵踽踱
蹉蹁蹂蹑蹒蹊蹰蹶
蹼蹯蹴躅躏躔躐躜
躞豸貂貊貅貘貔斛
觖觞觚觜觥觫觯訾
謦靓雩雳雯霆霁霈
霏霎霪霭霰霾龀龃
龅龆龇龈龉龊龌黾
鼋鼍隹隼隽雎雒瞿
雠銎銮鋈錾鍪鏊鎏
鐾鑫鱿鲂鲅鲆鲇鲈
稣鲋鲎鲐鲑鲒鲔鲕
鲚鲛鲞鲟鲠鲡鲢鲣
鲥鲦鲧鲨鲩鲫鲭鲮
鲰鲱鲲鲳鲴鲵鲶鲷
鲺鲻鲼鲽鳄鳅鳆鳇
鳊鳋鳌鳍鳎鳏鳐鳓
鳔鳕鳗鳘鳙鳜鳝鳟
鳢靼鞅鞑鞒鞔鞯鞫
鞣鞲鞴骱骰骷鹘骶
骺骼髁髀髅髂髋髌
髑魅魃魇魉魈魍魑
飨餍餮饕饔髟髡髦
髯髫髻髭髹鬈鬏鬓
鬟鬣麽麾縻麂麇麈
麋麒鏖麝麟黛黜黝
黠黟黢黩黧黥黪黯
鼢鼬鼯鼹鼷鼽鼾齄
""" #""" gb2312_1980_二级汉字3008





汉字单字字频总表_cedict_12041 = """
的一不是了人在有
我他这为之来大以
个中上们到说国和
地也子时道出而要
于就下得可你年生
自会那后能对着事
其里所去行过家十
用发天如然作方成
者多日都三小军二
无同么经法当起与
好看学进种将还分
此心前面又定见只
主没公从知使部本
动现因开些理长明
样意已月正想实把
但相两民她力文等
外第王高问太头情
西机它回并间手四
关重应工性全门老
点身东由何向至物
战业被政内五儿及
入先己安或利很最
书制美山体什新话
名曰合加世平水常
果位信度产立声南
代走女言马金处便
通命特给数次海今
表原斯义各州化口
任真才几教官少司
德解神则必兵气打
员再论别听提万死
更比受百做尔即元
报直白总非建夫北
未张令反士师许条
变系计且认目光管
路接城活保结题却
指感难量务治取场
思电空边统件期克
帝亲复住请市六放
风资求史色形望传
八府眼领清决笑告
叫队强往区交武达
社权科九设李观记
改展字故品议象花
七完林基服带据界
云觉像院飞远收石
众车候类程转共千
式失流每该朝始连
术近格济干运怎步
台让江河识规拉切
极持若英争功深备
造阳快集布尽周宗
病华称罗爱导确呢
办节根击商陈火兴
京注虽杀父存臣准
广首乎具甚黄满容
单联调吃古算坐早
引须离证约母组房
曾似易随精视尚断
乃影除青初息守党
半县轻质语越况举
皇钱历留乐章照器
写团诸闻亦足余整
价号级参示支红阿
消图星落礼营增土
际致志夜需皆左究
汉念既送显置亚推
居列君包技线弟客
委终选龙势考右属
酒农片希破谓喜费
谈音查专止吗找食
装绝答敌害密研刘
依按久宝攻企案察
黑突倒局投衣愿省
欲率严待归医玉船
奇护卫岁律标罪吧
群春响仍某细承拿
施急职另敢跟讲防
独责较威苏双善校
友围仅纪族谁惊底
孩革维巴供斗降卷
姐封构站验苦差刻
益派紧料异例祖宫
乱素怕男效般段福
银晚宣户游香采修
娘木态够划续境米
假微试伤刚状兰诉
助征胜竟项继爷疑
印速齐低室退脸限
热田值怀郎纳氏景
执型欢毛免略批犯
否灵药射监织陆句
孙兄罢劳获旧网预
忙贵错树追临伯育
普诗副充永财适圣
血弹拜雷妇哪源遂
创胡习负策败宋御
讨富尼范球秋冲恩
哥寻恶停良股险波
刺述谢环莫脑草忽
侍静散判养积遣怪
耳镇登遇恐唐堂诏
著幸排简宁升检铁
角顾村读挥矣冷模
佛杨梦救阵哈暗买
督楚配痛授肯雨占
楼呼顺阴吾奏固皮
警甲担妈坚阶忠背
姓索穿吴凡吉激审
剑层洲脚乡沙托奉
沉亡康宜超谋演协
湖姑赵付班招夏掌
减伊妻鲁野释亮顿
录丁移危税座优烈
卡丽遗画屋您鱼慢
露啊端徒坏杂渐藏
压贼温卿帮松换侯
抗午郡洋席艺禁赶
牛申仙误钟块饭迎
货补博智仁款毕延
隐私谷附骑郑殿叶
虎载航控刑荣央概
庄岛脱介盖序秦庭
词睡召怒枪跑虑靠
味献曲笔雪份仪困
庆旁互灭梁园评短
川编探歌乘蒙鬼欧
洛烟尊休朋典架犹
徐秘逃核雄版勒泽
掉魏刀缺均摇喝敬
卖损卒括域迁测虚
逐毫避借辞牙额岸
赐予舍洞扬湾馆舰
鼓盛巨板材鲜输遍
肉含择秀毒篇兼婚
呀妹伦访骨陵弄诚
炮盘旅店销疾俄末
贤孝哭床吏健朱戏
票晋韩岂迹伏忘剧
奔顶油跳弃睛辛彼
厚练暴训丝纸珠尤
丈束唯嘴港吸孔弱
折灯震替诺翻塞梅
舞丹赞遭廷熟雅疗
婆庙厂库袭叔尝凤
侵赏抚忍醒默拥迫
绿页奥勇街昌缘累
玄轮抱窗抓废冰振
童丰玩宽萨夺杜焉
潜趣抵隆符乌役俱
伙炸塔罚茶坦彩曹
泰叹础途奶寒残寿
患奴晓恨悲猛圆缓
冬丧帅软握纵巡筑
饮崇贾洪耶操烧妙
赛摆尉宇麻稳惟粮
森绍陷杰偏孤违悉
毁援纯巧横迷爸旨
闲俗番季贝聚亿套
灾泪忧狂喊戴纷透
蒋析浪盟薄殊阻竞
旗闪柳姆扩允驾混
僧植哲穷乙埃旦伟
桥珍促嘉烦燕祭墙
径购拍尺伸鸟仲挂
币洗贫启距劝辰盗
努桌仆染厅针疏贸
荒裁迅阁惠迟沿享
闭侧拔贡凶捕唱措
丞抽课闹尾络杯衡
翼汝稍愈蓝颜邪瑞
丑宿壁羊芳售倾咱
冒瓦麦宾魔赤摩硬
署寺牌恰魂偷紫淮
弗菜莱涉驻狱孟昭
吹镜狗融拒渡骸惧
甘肃培冠彻井俊骂
触订赖怨搞仰恭隔
爵朗详译净枝繁侠
浮奋汇暂吕奖幽垂
耐津宪眉戒啦签邦
宰颇讯伴壮灰帐昨
厉籍贯贺惯挑鸡奈
伐偶惜胆陛淡旋沈
懂凭辈虫岳障倍仇
萧辩曼妖赋卢抬仿
债赴泉汽幕播恢竹
奸零潮呆朔刊禄桑
尸汤鸣幼悄撤斩炎
鼻箭慈荡泛郭缩扶
艾赠玛昏映腰晨豪
貌赫描岩袋胸池勤
祥隶穆粗裂荷凉症
汗贞彭敏寄租爆哀
润舒腿册轰掩祝祸
摸忆偿抢怜摄牧丙
绪逼傅乏堆庚辅瞧
尖董惑扰趋韦黎哉
佳返阅屈吐薛圈扫
驱墨碎吓估劲冯锦
慰肩醉剩逆盐邓递
粉牵辽遵陶翰寇悦
唤遥艘扎乾叛碰污
伍叙峰饰佩绕溃慌
糊匹伪腹挺幻辑撒
贴泥媒壬慧仔葬胞
乞亭尘码欣邻恋辆
焦嗣乔呈霍拟箱跃
仗莲覆锁羽咸铺陪
爬戊勿飘仓诛漫夷
悟撰愤辉滑幅廉宅
丘寅艇谕柔迪弥扑
撞寸胁荆蛋巳频唬
矿契腾插碍储锋龄
盾兽洁桃朕袁餐惨
绩儒馀谏磨搜拖勃
舟诊豫骗聪酸屯综
堡亏牢鉴凯昔颗殖
慎夕癸柱甫袖宴衰
琴铜苍菲液桂愚矛
励夹歇拾翠堪踪割
疲宙掠滚腊埋酉佐
欺卯亥捉妃谨蛇狄
贪厌蒂耍帕截蔡柏
券哩鸿敦溪蛮裕朵
匆秩庶猎猜沟邑涂
弘崔逊劫跌荐寨践
凝浅辖坡狼牲循肥
逢诱押坛玻侦忌恼
钦霞浑畏翁殷卧询
丢键兹躲跪饥郊揭
邮履枢彦霸悔蜀窃
慕凌戌抑桓械雾臂
拢卜葛浓祀愁贷脉
捷嫌阔鞋拨艰驶漂
齿椅斜墓届瓶燃狠
咬屏爹陕昆咐驰寂
辨丛疯稿辟岭剂辱
邀览帽尹腐寡悬敕
誉嫁稀削闷熙粒於
襄钢搭浙徽兆锡戈
豆俩纲耕浩宏扣妨
涌吟筹鼠娜躺鹿勋
扇斤抛碧妾熊崩疼
敲渔纠庞恕暖澳恒
逻弓挤添炼晃搬倘
盈湘肚猪卑苗泄柴
瑟瓜茂谦迈烂弯踏
梯锐赦茫讼拳耀衙
禅钻峡郁阙冤妄徙
虏耗轨吞淫虞杖携
脏汪舅斥嫂呵戚谥
吩斋宠羞吊嘛肠肝
轿雕湿琼娇昂弦顷
沃舆猫笼晕潘姻诣
勾碗姿绳狐肌渊雍
庸吨鼎喷姚勉毅赔
靖雇屡跨泣催卓擦
畜稽纹漏妥姊囊饶
芬穴抖姨披漠旱仕
滋乳舌绣滴扁浦俺
瘦扯竭惩枚丫僚涨
晶兮誓酬唇晴疫肿
胖擒拘粹戎煤蔽弊
饿欠聊禀舱肤痕缝
韵冀怖鹏痴填鲍绘
糖扭劣赢缴巾酷谅
扮贱疆鹰泊聘芝磁
诞焚侄菌缠拦朴厥
纽柯炉溜抄趁耻渴
衔档罕拼鞭娶蒲倚
秒匠夸咽岗逸伞傲
挣颠寓挖串蜂顽渠
啥牺翔屠巫窝兀辄
刷址歼挡肆谒函簿
悠昼饱艳骄灌娃寝
坠剥睁腔廊涛鹤罩
盆囚祠衍扔隋璃帘
烛赌凑冈菩龟媳眠
俘钩绵袍苟旬癌耸
狭诈陀姜後驳轩蕃
遮蓄樱玲衫匪挨巢
拆纤砍胎厮柜哦壳
擅铭婴铃嘱糟棋彪
尿杭硃茨厨叩愧饲
贬肖衷颤俯骤逮逾
暮庐裴媚捧畅黛喘
矩坊棍抹胃杆膀皱
爽莉氧谊柄栏盒孕
躬苑摘哼诵滩钞猿
猩傻卵拱塘毋冢绢
薪碑挽谭亨堤坟喂
妆枯眨盯颈婢盼棒
惶嚷愉肺棉禧隙霜
坑煌崖浴裤惹吻氛
臭吵恳捐闯翅懒胶
膜惺祈舜蜜募慨冻
喉泡鄙叉亩钗擢脆
洒喻瞪窦甜帛雀棺
矢莽斑拐浚矮姬滥
筒蓬硕瞬锅叠帖壶
纱薨垒魁摧虹枕茅
俭蝶麟剪凄颂豹俟
逝讶庵掘禽昧阎猴
澄匡塑吁脂伺匈雁
滞漆乖旺傍鸭弼倦
铸膝颁歧尧谎攀棵
粟劾仑祐瞒谐敛颖
倡鹅撸峻链戍歉奠
骚厢宦栽巷溢懿谱
裹陌宛裳缚煞胀骇
璇脊藤萍榜兔裙嗯
驴咒赚敝厘睿禹辏
钉咨焰筋遁玑芒芦
淳浸恍讽脖盲稷詹
蠢淋怯吼撑酌矗泼
葡枉沾窜哄竖阐琳
贰婿皋刹淌账粘淹
勘眷狮莎祷歪唉谬
躯憾栖挪犬刮裸邵
嘻钓摊蝗侨梗掏妮
娥剿秉堵菊瑶拓窄
斌脾爪戮钧馈暇杏
淑啸丸炭屁凰靡藉
瞎虔魄拂萄笃瘤佑
怠鸦睹贩怔雌斧窥
潭圳厦毙玫驿刃饼
卸搁冥绅框倪秃陇
羌嵩叮铮妓颍愣辜
砸揖恃晌剖莺褐蒸
劈哨兑缄呜壤撕咳
羡晏诬砖恤掷摔鸾
棠喃涕譬滨溶巩蚀
晰堕舶庇瓷啼虐桩
绑珊绥嘲瑰梳匿讳
涵篮喀妒敷耽哑桶
梢绛纬垣藩坎稣笛
晁贿焕喇暑掀膊栋
厄谴肢彰胤搏晦哎
笨钥旷兜咕帆株屑
躁谟赎惭僵涯荩轴
挫邢筵奎耿佣凿碌
绰娟蹈陡腺邱奚啡
捏涅瞻倩酰诡窍奢
诘挟窑盏诰匀谍淘
蚁汴魅踢藻娱栗怡
灿稻讫朽坤棚槐蕴
哟饷沧醇螺垄骆煮
拙桐芙衬沼馨甸畔
樊侮蹲蚕辣搅觅椎
驼嫩弧褚矫趟谣敞
霉蓉澹喧绸榻咏纺
蜡殆宵匙孽荫狡冶
迦谜腥鄂陋噢滔稼
幢罐绞沛熬膏哇肾
姥卦稚塌汲哗沮赂
坝捆挠咎磕遏赃嗽
梨彬芯侣谑苹捞叭
捣浊糕迄岑辐鞍嘿
灼璋敖俏遽恚邸鳎
咖伽裘啤晒闺拣嗟
懈忿旭讥赈浆跋愕
旌丐颐孰嫉螅婉畴
删寞韶渭瑜砂缕泌
闰灶霄徵逗沸咧裔
眩僻簇褒萌璧膨莹
酥蹄沫荽亟憎荧颊
霆陨踩牟锻烁斟汁
睦晖札篷腕鳞诫菱
痒鳌胳缅铎黜枣剌
蔑悼洽泻凳皓雯叱
膳诀湛衅叨茎沦牡
阮纾祚泳恪悖摹岐
鸳迭歹奕冕垫狸偃
襟诧翘肇逵拯噪漕
龋辕颉俾冉嗓嚼炒
攸竿虾铅贮栅邹匣
锤撇荨蔬偕缸浇鲸
佥拧搂嘶徊洌岚逛
燥渗溺胧豢镑尬粤
棘巍惮倭廖蛟檀孜
嵌臧毓澜钮揽汀倏
帷绶坪骁绮缀缎弩
蹦髦翟俸瘢瞥籓痪
嗜屿椋帜绒汹麽乍
祁禾廓僭皂叟哺夭
烤蛛蕉挹榴驯峭闵
畿琐伶慷檐靴杉惕
辍睢琦炕侈飨煎泾
樵瞄酿蝇醋喽癫俞
羁梭潞逞酋玺葱猓
凹扼涡絮窟澡欤秽
鞠麾曜晤萝佟缉甩
颓沂纂沁郝胥镖牒
绫苛汾埂豁谤祗埽
琛芽俚鞘矜掖煜呕
琢俨缔呐惫幌肴骏
渎笺锭缪诲聂绷毯
扒鸯撼炀蔚梧戟琅
悍闾甥鹊阀缆荀闽
粥嗅啵簦斛溯垃彝
尴迥圾瞅轼怼鸽隘
亢氐渺髓蔓阑氢穑
贻黯纶辇胄沐笠崎
粪霖芸碟兢椒迳鹃
棱鬓揉拚嚣徘袄挚
耆琉隅沪谩朦戳茵
腻疮垦檄碳蝉娄阜
蟹琏垮诙嘟觯趾幔
捡赍啪懦咦挛炳酣
狈恣铩箫嗡凛簧竺
榆圭窘笙揣斐伲咯
婶嫡绎梓鞅涩翊褂
袜釉迂悯扛侃罔饬
唷硫蠕厕祯氯琪纣
宸墟韬蕊耄捍萎涤
砦懊峨浣蠲潼凸棕
攘徇礁炯僖龚帧粲
酱忖臾栈桨唾芜翩
喔宥揪瘫孚曳咚赡
盔泗瑾熏侥聋渲篱
毡卤汰衮柬遐羲寥
钊拇镶匾膺昊吱炽
奄罹伎墅蓟庾渥肮
拷膛缮嘀濮佞氨闸
郢扈壕骠脯酝瓣拽
铀壑狩忒猾嗤洹漳
疤椭瑛夔绽摺槛锥
浏鬟氖凇锣幡蚊孺
犀擎蹋慑咋熄楷烫
怅丕拴磷圃涧肘堑
矶迩瞿淄槽袅缗岱
饵谗眯桧嘎鳍笏鄴
殴篡呻谪潇瑚葫琶
蕙鲤嫔谌驹晟赣苇
斡扳笆驸掣寐渤弛
爰沽甄猷恁榷谛刁
埔苔踉趴焘踱椤辙
雹垢稹蚂芍嫣蝴峙
殉俎崛拭蛙谘胪溅
嬉嗔弁犁噬蟆哮偈
嘘臻褥邕褪靶砰僮
迨咄娅觑擞驭痰暨
痹炊裨舷磐勺碱滕
嫖簪霎嗳谄堰诠腮
蟠橡彗搀馔紊迸噜
酢拗簟驮笥磺抡坞
颅禺悴臀嫦辔捶逋
钡恺谀惚髯盎珀秸
晔蛔屎佃吭杞钰夙
怂噶岔赁濠讹袱呃
恸攒拈殡笾杠胫筠
踌钝铝銮狻牍妫肪
涣溉枷糜麓胰蟾枭
葵剔贲铨谧骡掳薇
嬷乓氓忻钙窖谔婪
椿煽蜕蹙廪潦惰烹
偎疚撩砌睬咙躇磅
桀瘟虢胚绊诩芭锯
栓烙崭谙茄钏吝纨
涓逍绯湮薰毗傥瀛
滤熔讷笞鞫孛溥湟
淀聿赘橱匕钜抒衢
萃鹦郏茸渚佯嗦筛
酶峦掾濒娼觥捎绾
跄鹘忏鸠翌涿钤捻
窒烘韧鸥漱炙匮涫
楞冗纥蓦嗨蔼穹蛾
铲澈柩茜钺踵胺谖
弑跷忤蜘枫娴卞蠓
辂诮抟殃筷衾陟叁
侬刍搓箕郧琵熹蠼
吠镂菁昶辫穗镕醴
舵昙饺恬黔奂耙钵
嘈踊蛉忱墩撬杲菹
炫跻叽憔挝篆袒剃
诅涎璞觽撮硝萦恙
阖栾髻倌邺嗖锺骋
稠苯饕雉豕诤吮猝
樽吆沓藕淤橹觐匝
谯茹妪吒瘛涞阱殁
缢曙傩酵郓顼赉梵
蠹缙铡跸觞邯纭懋
廿钳谝汛寰橐眸猖
劭嚎戾蹑酪苞糙诽
屉捂羹擂埠歆曷犊
佬苤湃阉缨笋筝骥
瀑鹄焙媪儆诔溆豚
卉洼醮憋蛊祟谡砚
彤蟒琨熘翎甭檬霹
菇庖炬皎亵悸罄凋
蛭茉荼兖鬻珂畸鹉
乒皖啄呛渝繇肋眺
蓿蹬锄轧蠡籴粱谠
揆霓瑁唔笫铢韭眶
啬闱汶葜缰镏桢邠
柿呱秤腋杳愍雏妗
漓獭喙淆瓮墒筐缭
骼涸陂妞裰淙峤瘾
舫咀臼啃斫跤麝祔
俐骧邈燮荚痊渣迤
鹞砲锢琮诖踞沌磋
疹塾婷貂棣詈哆袂
岫恻滇燎堋掇渌厩
涟桔濉鄱邃嘤讪隧
纫雳愆蕖悚夤瞩锵
庠睾咭畹跛髂箍滦
萼瑕瓒腑竦亘赜阕
媛毂魇芮浔昵翱捅
黍搔鑫俦诃饯辎槭
疽佚糁痢暄癖荔圜
祺喳庑呷蹇獠翦菏
憬阂曦镌羔壹勖涔
掐湍僦蒜磬辗唧匏
髅莅苻茗蛹槊竣骈
泵隽珥橙掺芷荥萤
暧诋殓偌轸娑镐淖
怏搿斓诳蟀钪忡熳
芄磊浒孵忝雒沥壅
盥瘴嘁暹钠剽缥唆
舔氤蚴醯虬烬鳖呤
帚苌赀笈渍玳鹑颢
狒瓢蔷逡氲蝠颌哝
脓昱畋嵋茧臁踔隍
锌跏鬃燧咆瘸昕囱
砾扉诜鸨嗄昴煊瑙
拎罡藜疵烽迢猗爻
煨痉龛蹊贽沔挞盅
麒骞蕾诒橄咪洮轲
铠寤戬铣漾籽幄亳
诟锏婺犒诿妊狞骷
惋谚橘郸锈胛雠谮
睫弈馒曝哽阪淞洳
蟪厝噩谆啻闼嗝淇
瀚宕惴颔坍覃硅袤
唠惆晷琰恂镒蛞揩
旒憨醺疡彷憧逶莒
啜蚓峒馑肱藐獗癞
滓伢珑惘狎饔莘捱
裆鲇蜗胱窠蜃鞑魑
抨噗钍薯粢窈蕲韂
逖舛釜湫緝鹗帑鄜
碛挈俪芹仄蚪踝侔
馥叵拌狙荻骊啧啖
嬖焓皈蘸盂倔蛴橛
蜒喏恿葆蓖愫煲蠖
碇肛绚莞榭馍匚隼
燔弋袢蚤倨澎鞯玷
阼皿鋈哒浜朐瘠蚌
拊浼缶俣婵碾嶂邳
霁霭羰砺楫琬咔鹭
阆娠牖祉抉绦簸豺
沅蹂髡猥鲋鸵阋曛
蟮缯岷宓芪淅黝桅
伫诓咂绻臆缫绱钔
拮槌砥奘洵旃馐蹿
锚旄疙箴靼啾嗍筏
俅蚨骰蚩粑楹靳躔
徭箓杵秧嗷咫笪淦
孀牝馁筮蛑耘缤鹬
笳嗒奁卮馕蚣蚯蛩
坂鍪汕寮鸪晡婕捺
崽钿聆懵楣裎菟侗
湎毖瘩闳灏蛤诨瞑
镀坷簌煦攫氮痔苁
阄舨湄咴佗炜哧罴
莆嗉螂撂悌镯粜跣
艄髃碉炖趺褶诹喋
蘑楠衿徼灸疟橇怆
阏彀盍揍禘樟巅饴
醢祇龈刨谇逯腓魃
倬谶薮呶歙漪舐祜
羯邛愠璐嗬涑媲怦
逅轶铉翡逦罟惦偻
黠傀涝撵嗑窕衲镁
蜓殄岬菽颙郴乩璜
颛哂馅茏泓赓瞟瞳
曩漉娓悻勰阃钚笄
觊荃糠粼龊脐芤澶
濯嚓榈跺醪榄裾蹶
嗫瓯嵇芥岌阒嗥腚
裼跚墀荤俳妍霾穰
笮恽潢遑锷隗镆餍
袷鼐飧瘗殒鸩辘飒
鼾惬儡煳咛黏槁胍
娉鲈笸箸卣栩鸱笕
笤刈锍倜鄢洎蒿鲆
媸圩菔喟濡胙蚱羸
淝铿侏阍澧珏裟喑
孪髀剐筱嶷榔糯渖
舸涪炅娲夥蹭榛鼋
宄鹧暝袈滂弭棹蝎
摈痘驷抿焊赝胭颎
蜻刖蛰醫泸呗蚧囟
沱锜窿缟晾峪慵帻
锹鞴倮菸渫汞馋拄
藓肽诎栉翳魉讦虱
蛐蜷躏鳄顗榨瞰镉
鲨屹啮搪蟋虺閤捌
玮刎崧苫菀饨祫邙
叼闩俑鄯呓邾苡虿
蛄呸蒯锸畚扪甯缜
帏踅髟婊稔搐笊偾
碘阗潺硪蠛垡穀岖
黼骶嬗恫垛嗲苋瑗
沤畛鹨耷懔漩鼙珙
钅缁铰镰粕鄄梆翕
桦罱濂哚矍缣铐浯
虻竽蝌薏槟觇甬怿
釐胗甑坯郦嘣噎湓
妩谰腆淠烨飕蜈刽
萑缬赊疣泯氟痈獾
仞蠊讣葺馗柚憩罂
魍暌颦柑楔璨樯跎
祎浞樾椽苓涠隰萱
旆蜿墼胝鹆滁锨馄
婀匐凼樗胨畲霰臬
肓硎墉鹳槎殇旖钭
罅蹩嵬馊褫藥巽衹
芾抻掬茬芨闶鞣诶
瘪睽钌嗌饫阌龌臊
蚬钾荪謇缈腴蝙莩
蛳酚芰妲庥鐸攥峋
芟撺盱赭狰脩嚏艉
祧镣芩姗螃髁芏腌
陉飙郅褡粝溟魈艿
钛鞒泞籁鬯芗鳃娣
瘁苷甓蛎摒臃匦锰
鹩龆蘧阈旰戢齑肫
钣囿睑篓噫茁厣绡
焱绺舻敉岘嵊眈龉
蔗嵘琥鹫嬴裢吣溲
莼肷荟傣啐虼飓玖
诼庋秣榱攵箧縻鄣
喾萁捋笱匍薜饩焐
佼麋缵羚犍烊噤龅
眇苴徨搴剁膂鲂鸷
娩劬葑饽媾炔傧缌
碣卟榕嘧莸葭篙焖
堇盹锒撅乇愎灞瞽
讵雩浠鼍鞔黾藁膑
椰萋酆蹒隳阊抠浃
绐碓陲榇羝祛獬蜚
秆蓑夯厍谲杼掂芫
芡枞锶癯鋆嗾皙蕤
汜跫郃郯郾泠砀纛
镠迓圉嗵幺卅嶙禳
蟊醵沆洄蚋郗瞌町
裱鹾艮蓓睨鹚髌肜
诂戡箔湔亓锼跹皑
驺褰睐茔鼗赙耪咝
嫠鸬纮蚜粽栎蚰舀
凫饪淼铄砩蛱呒挎
摭柘蛀嗪趸嘏萸峄
崴酮禋崞鹜霏芋讴
踹钕伉蚝氪龇瞠鹪
濑錾蛆呔瓠龃衽虮
鏊绉鸢褴岢涮碜雎
舳榧靓骘衩貉癣窭
铛槿黥畈锲鹕跞侑
苄缃枋槲眙缡肄嵛
羧苣崾痫赳醭氦酗
昃氡綦殚餮莓囔氅
炷褛觌痞愦甙砧缛
枰觎旎懑锩癜殂熠
砣缒鹌颚黩洙渑硖
饧缇舂吡锉窳踰娌
跽怙藿鄞绌窬遄穸
髑腼栊戕琊杓氩袼
鳏疱珩矾垩汩髭暾
靥恹仝萘罘戛孥焯
呦痣冽疃乜蘅砭酺
煸僬鲎悛榘瘀窆麈
囤鲫菡慝荅绖瑭忑
忐悫琚劢锴垠孑骛
螳邬畀阡逭嫱旮晗
艚竑馓榉蚍赧槠嚅
璀菰姹筘祏敫镳骱
韫缦绲蟛愀胂鏖啕
邂桡崆梏鳅嘌胩纡
鲠廨璩楮遨耒谳螭
檎趿誊聒蹴莨旯耦
炱蛏圪箩糇搽缱杈
鸺缂觳跗遴汐铱蚶
鳗砉儋芑椴锊掸锖
窨龀胯峥熨孳圻槔
豌剜朊锫蘩鹁訾硗
窀鱿柰簋椁蛘苎沣
爨遘圮鞲缋坳磔姒
缑襁哐姣妣菪蘖闇
峁迕彘赟菅炝芎锎
篝烀怵瓴這镫羿崂
醚铬掰蕨裣經镭袴
佘嫘熵芊獯闿昝锿
骖蓼嬲媵闫逑薅嘹
锟裉跬艟鸶薷哙锛
蜥銎咿唏肭罾钋韪
醣泺蔺桎欹羟苊脍
锝咤嘞屐庀孢枳肼
艏氚硭钫畎馘砬楸
锕鲑卺舄慊肟砗褓
螟趱豳柠鸲搠艽姘
嫒襦葩蕹獐咻舁岵
摞罍妤佶邽欷舾掎
绀碴啷萆蛲蟑钯瞭
噙戆舯眚璁嘭杷昀
砝蝮烯诌掼篚獍鹱
過猬褊諡潍飏隹镛
磾畦贶黻砑耨讬瓤
枵颡噼铙阇澍遛骐
鸸裒荛稗呋嵯舴驽
鸹搦徂諲帔翥剡犄
镬霪裥犷綝彖絷锞
鎏鄩珞烷筇杪罨唑
嵝甏煅鲛頉啭棂矸
庹缧籼娆俜菥萜酊
疠骅拶绂沏酃垓姝
萏鹂薹崃钐鲧扃跖
怛颀泅菘榫鸫蜇祢
叻崮鐾聃龢铤跆阯
圄篾艨菖殛硐螫柙
郛骝尥岜蜴砻唁逄
堞揄溧荭镗潸砷觜
耜鬣坌莶孱碚哿屦
氰吖絜泮颧倥囹佾
疥枥埒酯體嫫酤镍
锪蜮蓍滹瘳钒尢唰
煺蹉菑痍锔栌枸刳
飚疸枇蚵侪苕適杌
趄婧镞绨痿踮鲅钲
翮與潴钇镎菝頠埙
蘼砹簠茯仵茕淬偬
汨楦镄鳝肀虡廛猊
谿囡傺滟痨帙苾谂
邝帼蝼酩骢衄纁郤
麂舡蹰芈趵樘痤忸
纻硼泷咣檠嵴菠悒
鲲撷崤箪聩泶锾呖
猕镈喵遒岿佻锇幞
仃陬炻酹觚殪砒堙
搡噔锓滏靛篦粞脔
咩鹣豨徕泱嫜洱滢
龠膘绔瓿镅窣荏悝
籥悭陽蒺鲟颋呙橥
劓陴邋類锘躅坻埭
擘揿锬瞋璺視艋馇
憷钹矧噘箝溱阢岽
鹈趼骃垅硌洧鲔唳
汊苒骜缍犟鞮怩崦
掊頵岣踽胴鬲赇掮
髋硇踣烩柞侩轭铖
颏桴螨镝痼鹇蝈眄
郜桠篑䜣蜊珉瘙縠
郄鹛鞶猢妯鹎蔫仨
荞珲膻貔鞬糗巯茱
狲箜擐鄠雱褙馏伧
楂蜍粳驩殳鉷苜轱
鞨摁骓桁蹀砘阚枨
髫芴礴踟溷靺腎纰
贳邴铂囫燠兕罽眦
篪忾痂趔鎗忪遹睇
苈幂梃钨莠喁钴荇
螽犴怄轺遢篌珈攴
溴泫圹筭窸麹榍疴
棰舭篁詧噱腱貊禫
狷舢锱骺勐囵醛啶
轳伥桉锃軿綎荠蔻
荜覈鐇膈脣柢鴈郿
牦铳嵫踯撙陔頔鄹
蓐瘿踬硒盩茑質怍
翚轵筌變怫锂潆纩
镢鲢胬摅蜉烃赆間
虛歃砟刭黃縯絺蚺
訇玢蔟蒨挲镪襕種
鼹屣褾陰讧祓徉佰
殍坼長隈枘掴椟鲵
䴙狃蔀蜢蹼垆瘼飐
驎腭稞襞結衎伛靸
䌷絁镊補醖捩忮棼
堠說栀鬈麇稜髹毳
唿砼糅鰲埸葳骀貅
秬翀鈇鏡桷忭蟽呲
妁祆碡秭鲶秵荦翙
茭郇絪喈怃睚籀佝
黉見颞開疖绁缏還
綯狯螯坫砜缞蒐闉
霑埴驗揶徜麸菴濞
磴筲較脲顒郕餗睃
秫铵瘘剀轹睥醍璎
諴刿哔谞點侉觋柝
祕題仟垭鳕溘屙绋
郫閟莜瘐禼捭浍镔
虓酎啁锽诐莳莪躐
鼬蘋莴瞀繻鲰菶醔
尻鲙僳邰鋹腸牯洫
庳風矽荑箐疝哞椹
钼蝣篥鳟茆麼禖圯
禩硷茴铍筦關醐唣
皤铏哓鋋扦痧蒌霈
跂饍猱漯蓚氘铧箠
菬儇鉏鲭脬赗逌論
娈矬堀豉箦樨箬傈
鲮肸紞鞞鳚狁骎茌
翛噌鳊谵阽箨燹鋐
翃鲀饟锑邗擀胼龁
赅麞幛禊钆筚蕞澌
祲捃騔珐埚鄗辚磻
讟筅祼揎蒹蜺輓頭
養铆擤蜣黢悱蓺翾
撄辀證螈鲱坨潋葚
嶝酾須醿躞缊邨酂
秕觏處進秾薤杩缳
眊栲脘耋蹯臱頫鲡
揲鷟遯銶芘黹悃鈒
茀埤矇鹋魆皴糈埏
蝻針耤楝戗轫診調
轘佤碲噍沭铌镧禃
廒硙蕡蹁戥醅細襈
鉨黧迮蟲觿瀣芃蹚
锆辊釭飲節檩眭錢
窴綮骍葎甾鲥瘵睍
譔縡痱馃蹻忉觖蓂
衒鄫酲夼縢鼉術襚
獒辋孬吲哜瘥蝽嚯
鸮埝铈郈稱酽郪鋬
藘腫泔麴螬雚鍮溽
蓁醑茇雊腙镡嘬瀹
魋篯緌韡魨觱锗讙
玎鳔攮鄘舣黟騑蝓
栳恝谫裀蓊恧顐閒
腦鳢啉瑷噻蜩矰檗
蒉黁劂疳蛸螣裡钎
葸狍柁騃鲐鄚仡網
邲氽挢霅镓柽糌塍
眬狴簏赒輶鹍诇哏
甍哌瞍酴篃臨賨磝
趑猃詟黓黙葶钽鹖
趫绠踧癃鹯麤颃註
蒍铗憝禇垲紅橼铋
犸禔錞翣輕雖鬷狺
鳜溻唢哕眰蜱薳镮
禜鏻睈戽駮羕胔溏
鲊齮虖觀隤襜蒱冼
铊饘蠃臟砮豊郐綖
眢繙盬飖鳷認祅褭
尕蔌戋铫聬辌袆鎚
泖袪阘漤裲統謩桤
襻鳙澉铦陁蒡磙酡
鹓靦塬垤骙绹铒轉
仫荸筴薙蹐鲚铑酐
覺詢請隱喱轾揸廑
脞疔轓辒鲃礩楗圬
氍蜾運糍皲礽牾瘅
蒴窅锧裛訚緩栝癔
鳇阨醌黡韐蕈矻陧
馂纔铯鯈組鮈垴睆
鹢磎盝羑貙邡睠誾
軏續難祊鷪蝾椠聱
爝彡铚腈磲贈純眱
筈羼顸蝥擗謝蚡鄮
跶鲷汔臜珧䞍钬痖
鼷繖軟頸荈毵蟥鹮
镟脶離睟纚褕酅衆
約枧紃褧罝輴駹鞓
蚃窋猡鲞門絙劁漶
脰滠桄腧氙維脽羖
軨颟岙赪趬邅雰餔
積簨粌線習趕鄀桕
瞢筢硁鐍韈蝄喹確
織韨蠙禛揠猁猞螓
瘌隩酖蟜鵰紹連脤
礶蹓柒蝝酳龂頍話
顯綍禨睒衖齁茈跼
誤絓狨縚薁簄蝰鲻
泐矞帱桫睎轝埕義
衛達響䶮迍闬醦碶
驵缲耖臑碻翫選膽
鰞鲦筸嚆鳣鞚脈貢
納閉綟駼囝鑨豇垧
鄡腠麑祹遠謵餧矁
莋惝餂硱仂碥隄瓞
糺唛脹謂遺騊矼諢
銛坩裯镨蓰罥罃辦
薿餽釂軋鄃馛汆毽
鮼剞糨艴鴥耎膋鈤
癀虙貋簝繄孓佴粋
躄鲌鍍預闟眛唼觫
蕰蓥骒邶訏坶簡縮
趯顧鯊镦鸑洇餬螋
苠耢劐蓠钷駃鳡鍊
鐩礿雝盻輗蜞鲝礅
墁麃粫諓蒇鮾睺翂
駉鬆訓貝秏禟鲽耇
酇醊洚隃礎鷇稌翜
釋鷥謜譊褷躜蠋譓
阓阛霨髽纴仳詠萬
砫鰽筆練總計訒語
鶒訹驲蹠垸迴襆冁
毹钘試隨鯐鼇霤鳂
腯貘鲳飗鲩祃褵茝
規髆矯鳐韮鰕碏螾
菻韻沲繐藚氇氆腩
磉鬏筥詯胠鸂礌議
薆藭馉鹠絡護鲿艸
蚄浈齎㧏檫觔瘰唪
絫覩豭筩跱騄鬘鹙
詳讀諠銲禴绬虸穜
蜑葙鏦貓眲資窎饎
躧觷礮犰玟翬葰冱
踖鑑騧籤踦記識駜
誖赕芚藟釴膎鈮髩
給跐菆袝聍鲴眮醲
碁骫範醁艍铟竅讓
騼䲡鱄鱖鮧鎯疬絅
胾鬂麀虒豂踘瘕齧
镵霣麕聝膠绤覛項
鶇黒餫盭膢韎鹥鷃
塄眵訔屺麖頞電鱲
頻眾膰覂設鎮陳鱧
絇讗鉶顥鼯鸻坭礓
钸窊螘貪柃诪賸膴
繼脫邊顟龍蒗紒蒢
镩鸰艈蝤黪瞷蕝顣
袗稂耑聴蓣箾褎騠
钖許車饳鮠鲖絰萯
謷麛茛酞脎蝟蕻閱
臌譁遝铕穄裈鼩粃
趦蒽釆顱階雜驚鶗
紬鱇禬蜼笴絻臝黈
鼛紥駆鹴荄堍铓褠
迯鄳鬐蚖貍該跅鄤
臥鲕竾級菙蓋責錯
釱鳑纼轜隮飶鼟銟
鵶埘镴罣肏絕莛镘
耵骕笭膿鄑腳雙魟
箰阬耠錔騕鬴魭鮔
鳀粡粣袛邘胲饾髳
篸迻臞褌褔葉討漭
險餘鐏纆逴睰筜觾
醳鎡鐉鍬鐻脒耧靜
篲靿礞眍癍螗禑貤
掭韺箢詣緅蕺菉諆
讱䦟铪膚臅莾虧髮
穟醡箙耔菃哳箖茼
尜麿鲣圊鴂蟭趷簳
詮醽顏鲏鴱鮊菼褘
韣攉狳鞦搛骟钶誌
髣鲒耰薑餱袿鏁盡
矟藴袃製詾載週鈺
閺陸縗肵詴赩颣鶂
鼒稾蒎騩聓臢蝀埯
鼢菧跊顝麄㭎阤穈
袠複鸧鼂袓膬秲穩
聽袀貴鄽鮮鴺鸴篨
睗矱筤荂葅賵鄏瀵
霡霿韝酏穨鞾蒒穉
鹡餦謏睕葴椐舲艁
袞貣茚鉁飔虵袥際
臛仉粊聲腘膩觸詻
諸辯靈麥顔綵緤荬
钁鮀簉踶铘龏篘镋
鮸籞瞇祋綈蝦雮蓏
訄鉤闍睊穫窾篠醨
龒臍茲稙羇藳袨覙
訉譄跁飛鳴沩芼鳈
繶諟踳鄅霃馌盵繦
艃蕆魞眖陠睏岈镙
镱稃筰聭袧襢詪販
軆苘飩蟫耱睪鷁綀
艖輧蕣铷硏粯絿興
袑讉陜雞駝駸鬱䦶
鈆霝鮟靷睮穠罳耏
芣蟟詶醓錡馺鸤礧
緭辿銇篴铻膹巛筼
搋檑秔轪稑紩膮鐮
蓛蜔觼鄰鈨霂鼏秅
譟蠔礤謄錧紟脀襮
讎瘃髢鍰觍邆稆鳆
碕膯華鍐閛鷫釦矔
脙茖蓴負邿腽順頊
鴽鸊秺訞睔穬罛翿
脡鋗鍭鹔磧荝釳隇
緊羶蹅耩贇茺郙鯋
䴔紵緺羗裩譌祤臿
矝箘糞縿聛葢螝訑
詼貼錄飯髤螵鴲軷
臶稓縓蹛鎛眴藊詽
鮿禥駚粎蜁饹絼簰
罇礙罼託蹡怊顑疰
艎莚銙餈禆葠號談
費蹨蹱輔鴣鴳鼫齼
钑雘靮茢躭糒紑臡
虩蚳褖郚雺肐覸鞉
韠飡鴋蕿謴䴘痦粺
趽饸譞趥筻麊麜粩
瞫箣粴紾蠜逷隊綱
鄷糵趨輳镥磿絲緰
聞閷頗鳉鹽龤禭遶
鍏䴖鷉鑛鮡稊籧紿
蠮訿遫遰郥郳鍉麷
睶磵箄箻籟訍谸豽
靽䥽眎缽袊霚謦铞
眳粦雲駰箅詵盦砢
磥缻蓮裋輵瞵髠顩
祂謹轎鴫簻紀纖艜
螕訙諝賰鄬鈧鉀閮
閴領禡粵粻岍谼襌
鲉眽綪缼腶讻輹桊
餤饦鬒鵩褍誗鏚碹
葊紏繸罶靹鮣窔萩
滗痃睅礉臉艕茞葷
謺豷貐騻鲪麗䦆飑
腄麰蹔鎌陼牿镤鯁
祪蒁鍩貎铼鹼趹簜
簬終綜蔂裝詺貏贆
跍輿邔釢銀鐘鴷鷹
麧禵纑訢鑢綼觝鞧
瞶箑舠茒訰輠鄪闑
霛馹鸃眡萐輣霙霦
鯌繍頧睖穊羀鰡繟
絽臎蛣坜銧鎰耥筍
緡茷螀輀鞡秠絃垌
躘轥鍧黮袽鈵飪鶄
黨齾績闆竷脻膫臇
舉藨蘇訛詞詷購跉
軓農鐑闅鞗騺鰜䴕
艦鯘隺蔎鯔鯮鱣箎
籝綧茪蓩藂虣輮蔹
鐕飂鱐稒篣艔蜋袎
酧鋘骦笰蔯痄菫袣
謿粐脧茣蓯藦鑕雟
鷱䥺窌蹟鱮麚瞆絏
袕袚轗鄟猹饤盤茍
蒟鈦齰缾貧禍翹脮
膶艑葍蓸袩訊評謨
趧蹆醆鍋鐣镃陣韽
馬髞鷿齺䜩縪莤鲯
笎逿鰨籛腒苨薶藋
虆螉觕謻豝轙靬鞂
鞹騂鶅鷮鼲礠裌謳
邟鉟飻骭魹鼕铇蒧
鵳磡醾潲鲼繌菒蓨
藧詝貗輈鄛鞄韥鯒
鴃颥醻靰肙苙褋遊
鋵鍼魫蔿隦礇買䥇
氕硟紤絹聯職臄菂
葌覠親訋課豐貛賴
贅輸遲頂鬅魚鯖鱾
鶝鷩鼜齡鋊笲舋磑
禗鱯簭縳繘荓蔕謣
貆陊籺羾翏艥茤譒
趍踠輙輬轀鞕駴簖
魶鳁鼱笹薀訂谉搌
鄦膦騾苽豗辻迋揞
鎭鲄鴹麆瘊脺蜎鴼
絟蝘閭骳鴿鶠蛚讞
閧鳓鹹粧稘窩箽縱
聖臏臒艢茐蓷藙衝
訌贀趤軒軔轂邥釙
鈩鑱閻饡駷鯗鵁鶎
麨諹鬛磜蕅蘘鯝鰁
瞾笵綆縰罻罿翽艓
蝃諰蹜蹝蹢韔騵齍
箶縌莝諐諕跀迱鞀
饠鸜碔翧褱釔鹀詥
躼锳祾穪簴脗蛡霘
鯏鶟龜稭虯藇蝺闚
雔眅簾粚繫聸膭萚
跡軃轕迒鉅驀骹薝
詭赑鋺隥饋鱵禿蠅
賈遞榀鄍磹礜禎粍
紙綒緣緯臈舊蒼螞
袌誘貞財賦違鄶釡
釤鈿鋼鍵闊隻飽驅
驖驘鯓齊齒罈詄鯆
穽鴞蚑襘鱤禂篹簁
緪胏膍蓻袙誀譣鄋
鉥鞙鞸韇駓駪驒驔
魠鵫鸐綷緃艅艛葧
輄迾鋄雭顡粏臐鋾
鐓楱鮄舖骯魖篰蔸
眥睄礡祦韰飭饐㳠
硚箯脨苼螑袵踡蒈
邇矙糀鳘鵄緍苧蚘
趩蹷遆鯙笍羜膵菭
葹薐訽譻轇遈鐄铔
饑麏臺蠚譢讈蹞軌
銳頃麅禠睋箹粶粷
緻苿莖藞藷蛢蠝詰
謬讚讝豬貫趶軅鄉
酁錆飢飼魰鰪鰫鳪
鷣麎黴繑瞡紘鏐鞻
鞟瞓絣鍱魾砅硰祴
竁箮罦羋耾膇芀蕫
蚔蚼衺觡豻貜跇輷
轊轛郰鐢鞢頀驓鳲
鷤黅睌矏硠秪窐綉
纊羓虄蜄衊衵賝辷
霌颿馎騳鵕䏝瞤瞮
螱馡磫臮筊袉褯鏰
陞镲鬑繒膼蓵虀裏
醜鍑鷲齻藑藬絛蘭
蚢髲繣纕翭蕳蛖衂
袟觭躩靉鮌鶚盇矺
磩礦纘翯蚿蜏誻蹹
錏鞿鯛鳰鼰逤鋸鑽
瞐矒笟粔緛聻脛莵
菢葞蕚蕷虝蟬蟻袦
講謥讕蹤鄿鈴鈶鋷
閃閰閶鞛髿鬄魜鯕
鱽鷷麡齽糱鎔稡羮
蔴蝑鱥莙鮻鱓鳤稏
竫簮粬萭蔇薉蘀衃
詡謞譺跦軶輤轞迲
遻邧郲鄁鄎醷釚鈷
颒驐鮆鰋鵙㖞䦷眂
眻矴硥硿碨祡秄笯
箵綇臽蒦蜯訬跕鉾
銂鍌顤饢魦鯑鴬鴯
譎眹秌篬胑蟨谽鳋
鼈矄镚踺磽艤蹾犋
颺鴨莻葨蒭蒷蓾貯
賮鈪猸鐐闒铥鴦鶃
鼪鴾佧齆藛蹎霫頳
祮稅篩糦繂翐肊胊
苶荳蕗蝍詩踆辵醰
陙靃韲飦餖鷖籂膱
菍菵蔣鍟餅髒簷軸
釘隸稖笇箒紗綔緒
縕罁羅脅脿膲臋葻
蕘詿賣趮跒跓軍邉
釠鉄鑴鞖顫顬飷駵
鶐鷽鸀䝼䴗糢艣輂
鼊脭艞霮龎鹟蒻貒
霩頨餚驆骣鮨鰉鲹
磶禕綌緆緉羱臲舝
芐荁蓽蟺裻觩謰譈
讘谹趠跲郱銋銍闤
禚騋騞鬌鰱鳺鶋鷞
麌眑硋碆祄秖稥縖
繈羫肹膸蕪蛒蛠蛺
褉覜觟譀譂蹮軭輭
錝鍙阹霔頟馯鮬鮽
鲺鴸鸗鹺龕龥磏蚏
監縋縫膟虗蜌誇謟
鯶込鴐眫聧脝艆茊
戤篼齄鷧麯磸祻禌
簥粭聠詖詤迺鏉鬋
魱鰰鶜齸龔籄聺襛
矎艒蠶郋録鑮鞎驈
蟓矅磈稛簃臕艐蘪
蛷蠏衕贠軐輖邌郵
醄醼鳒鶺鸇龓眕睘
瞼矂翉聦賲钃鼶綑
緲踐軡輾銷閣頁驟
铽矡硽碼禦禮稟竇
笐笗篂簢簯編繆繝
罋葯薖藮蘆蝿蠈袇
袐褨訴詫詬諄貨賢
贂贏跔輪遷釀鈾鑿
闄頌頎願騎鯚鱗鲗
鴮鴵鶕鼤䦂䲠籙蠥
藠饈纍簕趰饌蟢鷺
祩秹虰鏸餟籔鍚穋
簎簙粠紽綋繓罫聨
胉荺莦菤葽藾蘳蝚
袾褟襴蹍邞鄸鄾鋽
霒韘飱餲饙饛駬駭
骴鳦鴶鶖鶹鸋鸒硉
礲紴羻耭艌蕽蘴誷
趭趲跴躀輺鄨鎻鏬
鑅鑳韅驏髸髾鰦鵊
鷶黵齚齱㧐茙蟏鈚
睞筶籠綠肅鋕蔔糰
締羺腪蓇蓡飰磦繃
羵聫艂藯蝹諑謧鵀
麉麣軎訟礋築蒾遡
靣麐鼖穙簺胹脷襍
覅覗訕訝詨諥鋂霳
骻髪竚糷胵芖菞萗
蔦蛯訅釪鋫錥鍓馧
鰤禱競紳羷臓藫覓
跰鈍錫鏽饝紛遙羭
矘秶稈窇竝箛箷粸
紮緷縼聰脦蕛薢藖
蛬蛶蝸螐蠄蠌蠍袔
襲賀賹贁贌躍軘軙
軠辭釛釥鉃錈鍎鏆
鐵闀陻霧韌韷額顪
飸飺餁駕駣駶魸鰠
鰹鳛鴻鷴鼞鼮齋龑
䦃髧軧鉼騍禰輋隲
緵繿鴪閗犏鮍鯡鱀
碪礛稕窞籈粆紡紶
緧罬罭羃羒胈脠荍
蒩蕇蝡蝯螔螮襡讔
豦豵貕蹪軥迗鄇鄵
鎼鐀靧鞆頄頖顠顭
駧騤鬠魯鷕黰瞚砆
硜硾穭窙簂簛綕綘
罎羛腇舺葓蓪蓶蔪
蘤蛦蟕袯襂詃謌賿
跧蹃軖迌逈鄌鈗鈠
銕錉鏜鏾鐞锠閈隁
鞰騬鬺魌鮹鯇鰶鸕
黸瞈稐蘐衏趂酕釸
魀禣綿緼繨苲菄蓆
跘迏驄腃豀墚郞酦
鋻饏駞㧟秱縆莿衼
謪謱軈轷顓鯀鏘齏
礄蒞蠆誥鏕魳穵簼
趙韗矀磪穻竢籐縩
繋薾蜪襱誳讏趡郘
醎鑟辁闢鵲睩篺蜐
蹧隝鵂紖訪豎踥蹣
逕鏍缷铹盜睙矊礈
秳笖笣笧籌綄綊緹
繉繚罆罷羴翑聹脵
茻菚菦葘葦葲蔘蕼
藝藶虘螁蠻覍訜誠
諘謸譜讛豈贊塥輩
邫邼鄧鈣鈱錃鍛鍦
鐬鑾閯閿隂霠鞊鞏
韱韼頰顆顨飾馮駨
驌魵鰟鰬鰸鲬鴟鶆
鶊鸁鼑裏緜鈖鍥绗
騣簫瞂蕂鎪盨葋蠩
睉窪趌竤蓧詀礐荘
葇鈙颼鵣窫籋頺莕
蕁鑪鰧鰷眧瞉砠硩
磌礆穧窹筀筳粰紨
縏脢膞臩芧茠蓤蔈
薧蚆蛁蛫蛵螆蠉衱
衶褮譆赬赸趻躠輲
迧迶邚郔鄭醝鈭鈲
鋿鎿钀閨闠阺鞁饁
馲駠騉騝騲髱魧魪
鯠鯦鱁鴘鵴鵽鶬鶵
鼁鼨矐硍硲磖礔礟
禝稉穞窱笓粨羂翓
腷茰蓘蕯蘎蟉蠞裞
襒襯誧諅豲貃蹏軮
軵轑銉銔銞銢鋧鋲
鍗弪鎶鏋鐗鑡閦隖
霊霐霬鞐顇駦瘭骲
鬁鮐鯄鱠鳸鵷鹻黳
齖齨龗郎䦛䲢矨筯
糫苰蜳衠觹輆酘銿
閵韁颭餪鯾鱑麢眃
硈籆綶葾薦襖鏏鮁
鹐鹒繺馻磞篤纄荖
蓞蓳軛飆飮髼鴧䁖
眜礨紣藗蛻蜆蟼褑
襶諈賯贋逓鄺騽笀
絾鲾褲蜨蠭蠾醃驙
鳠齣盞眆硊碃箇糓
耈膆膕艷葖蓱蔲薋
薠蟂衋襫訆譅譸貑
郀鉐鎴阸陗韍驡髥
鶡磭繴羉藣転錗鐎
鐤鐨靭鞺饆騙驊黋
臘芵賜迆錐顎鴰腂
臗祿裓矚硣礀礊祰
窮竄竸簍簞簤簽粓
紝絨綏繜翆聣聵脕
脟脼腗茽荊菐菕菨
萊蓙蔥蕜藍藢蘿虃
蛥螚螤蠎蠗蠟蠣袘
襪襾訃詸諉諛諮譃
譯譽貦賳輥輰逇遜
酀釟鉂銊銘銜鋭鎖
鎲鐧閬閳闃陝韓韴
頋頤頹顳飳餀餃餆
餵馳駛驁驇驕鬀鱉
鳩鴴鶈鷳鼘䲟酨鏂
鐷鯅粛輐輘邏鋅䓖
箥盿瞕肻覥鐰鑰隣
詒鎝饜鎋鮰鳾鷦黿
釿縧鉽骔鮋鴒鶲矕
碈竀篎籊籯籿絩緎
緘縒繗翨聳肂脪腢
膷荎菋菛葝蓫藄蘦
虤螇蟘蠰袡裧褞覑
覕訧諗謍譐讇跠軜
輢邍邤郠鋱錀錇鍘
鏄阞陑陒牮雈雴顈
駫駽騢騱驋鬵魩魷
鮦鯉鯷鰢鱨鼽鴠鴩
鵔鵻鶉鶌鶛鸅麔鼣
齵睳矓矖砎砙砞碄
祽禶秈穅穾窛窡笒
筟箺綁緾縸繠繥繰
罉罏羍翋翝舥舼艗
菈菗菷蓜蔮蕢藔藸
虉虦螄蠁衜袏袹襗
襵覔諞謫謭譡譮豮
貀賶賽赥跿踑躃軯
轒邜鄈釄釗鈓鈳鉌
鉡鉧銚鋠鍖鍞鎁鎫
鏠鐈鐝鐫鐶鑬鑻镼
隑隞靫鞜韯颽飜飹
餭駖駻驉髐髨鬊鬜
鮚鯱鰑鰣鶀鷯鷻鷾
鸝黚黦鼚鼝齃齘齴
龣眤礵窵筓籖縴翲
膁菾萠薈蟇蠧觺鍾
駾鴏㑳盕砛硄磃禢
稸窼竏筽籇籒緄纗
肣膗蒃蒘蠪鷭鸼縜
脜蕌蠷褏踫蹽軉鑵
鴜籲繀聜臯薂蚈蟿
褦覐訐誴駳魣鶫齛
秊襬闕穯褹盫簑糴
罵艧鍸鬖黇㩳眣碅
磳礒穱紭綅聟肞腬
艼蕟藺蚒蛜蝕蹳躶
轋鈸鏭鑘鑣鑷雋鞝
骩骾鬙鬚鬽鬿鱻鶍
齯穃穛竂篟綂緐翈
耡膥艩苃莁蕧虈虋
蜫蜽裶詅貿賱蹌輻
郟鈰銑鍔闛餉騛鳳
鵋鶢鶳鷼鸍齢碀磚
繳耊葏誕誡賄鏢鏤
鑄頷騇鴉礱祳齗矃
礂稄稇簹紋紓絞緦
緶縷繕繞羈翢脳艙
莊莢葔蔞薔藰虜螖
螡蟯蟳蠒覚覟訣誰
諏諱謽譫賓賞賺贄
贉趪跈踴軇軣輝邁
釣鈉鈽銓鋤錦錨鍤
鐖鐳鑲镻閾靵頒顕
顛館饅饒駐駡騁騫
騷驑髕鰵鴭鵝麩齦
齲龝䲣䴓竌縂翖輨
銅銦錣鴢祶盌瞏稴
県砏磯臖譗鳿萵蔊
貲踄驢鶸鼥螦鉔鏱
葟螧鑀髴鮭鴓盢蘁
蘂鯂盉箋荙螠蟧雑
鬶魽鮅鮪鯵鰿鱂鵟
盷眿硯硻稯稰筿篞
簲籡糔絖繛繡罊翪
肬胻脄膉芛芺茥茦
菎菺萴萶葐葒葥蒚
蒤蒰蓲蔏蔜蔩蕀蕭
蕸薕藆藲蘜蘱蘵蚅
蜤蜬蜰蠀蠑蠦蠯蠸
衈袲袸袺裷襋覄詌
諵謘謼譥谺貥贙踒
踕躆輁輱轃迊迬遧
鄥鄻鈏銈銖鋯鍠鏌
閞陭隒隿靲鞇鞈韙
韾頲飄餕餰饓馽駩
駯鰝鰭鱦鵃鵅鵌鵛
鵵鶔鶞鶤鷬麍麙黕
鼵謯睜瞝矆矠磘磤
磼礃礏礹祑禒穇穚
窉笁箉箚箳簱粇糤
糲紪紲紼綥緟緽縃
繅繊繲繷缿羢翍翷
胇胣脃腏艝芠芢苪
茓茘茡荋葄葼蓒蔆
蕏藡虥虷蛨蛼蜅蝐
蝳螊蟞蟩蟱蠵衉褢
襔觻詉諙謮譛讖豖
豜豤贓赮趉蹸軕軚
軞茳輚輞轄轖迡迣
迼逘撖逨郍郩鄲酓
醹釁釃釽鈌鈼銗銡
銥銯鋍鋜錅錍錻鍜
鍢鍣鎞鎷鏇鏳鏹鐋
鐥鐭鑍鑐鑖钂闈闓
阰陿隚雽霋霕霵靾
鞌頾顜飣飫餻饖饞
馪駏騟髛髷魝魢魬
魮魴鮓鯤鰅鰈鵤鶷
鷨鼴鼿齇齳㑇㤘䎬
矤硸穼竃竼笡篅絔
絯縺聥肕膾葪蚉蚮
蜧蜲螙蟁蠂誂誎誐
謈豏踜踷踼躈躊轣
遱郖醈銆錬鏣阥靆
鞳頚頼颕駔騭鬝魡
鱕鴡鶙鹝鹵黌齅縲
趚駈盠盳盽眏睧碦
碸礘祘禤秙秢稧稬
稲竒籜籶糂糉綡緗
縁縞繤繧繬纃纉纒
罯耴肍腨舦艊蒕蓃
蔱蘔踨躉躱韆篭腣
赲瞜碠簘腵覇醱銝
鐴餇碭碽絍蒄衟詗
讌籣鍳鵬茿莂薃谻
賚篛絭豠辢鼄鼅瞣
禞窯篳粖絶罙耮膄
舃艫艭艶荢蓗蕋蘓
蚾蝨衘袬讜趝跾踀
踸躛軬銌鋎鎸閔膪
颩駋鯩鯬鰌鲓鸘盓
矵砪硂碒磣穐笉紂
紻綹縈繯纀腀苅菳
萈蒑蓔蓕蔙薗藀蘌
螥裺褣褸詇詐諧謚
豧貮賡赹赽踃躻躿
酼醕醥銒鎍鎘鏿鐿
鑊靄靱鞪韟顀飀飥
餒馿驦髉鬉鬸魛鵏
鵨鵼鷵鸓鸖黶禪筣
箏糧紐緱臚詛誽諂
賂輽鈕鐲颱髏眀祙
觓鈡衸謡閏盪碩磄
禐秼穢笜筂箞箤箿
篜籬紇紺絆絳綗綴
緞縣縹繩纏罰聡聾
芻菓菣葮蔁蕦蕵藵
蜠螢褜覊覯訡訮証
諒諦諺謀謠讍貸貽
賅賊蹖軀軻輒輦轟
醞鈂鉍鉛鋇鋒鋰錠
鏈鏟閑閹闌闡陮頓
頜顴餌餓饻馴駥騰
騿驥鬢鬧魺鰻鱌鱺
鳶鶓鶩鶴麵緋羠鎇
閽鷘黺荮笿翸肧蜸
賁鯽眞睴粿薭虲覵
鋪颵餼驂砤礑窤竈
聶蕒説驛骿碵絒萢
蔄躦錋糮肰蒪蟅銫
関鴙鵪齜眘瞞羙躒
颻鬳魒睱睻磠縀縛
襽豰賷頦魿鮇鮎鮘
鯨硞硵碞礥禓穖穲
笚笢筄筡箈篔篧簩
籵糪紸絘絤緁纋缹
罞罺羬羳耟腍芅苀
苖苬苵茩荵莃莐莣
莥萉萒萰萹萿蒛蒠
蒫蒮蓭蔖蔠蔤蔧蔨
蕍蕬蕮薡薽藃藅藈
藽蘬蘮蘾虭蚇蚚蚞
蚥蚸蚹蚻蛂蛅蛈蜙
蝁蝒蝭螏螜螪螰螷
螸蟔蟦蟴蟷蠨褅褽
襓襭襺覭觙觛觤觲
詍誃謑譋譑豥貄貾
跜躗躨軤輫轏轐轚
逜遾鄐鄝醙鉹錚錭
鍫鎺鏃鑸閍陓隉雂
雓靻鞃顁顅飤飵餄
餥饇馰駢駺騜騥騴
驍驠驨髵髺魥鮂鮑
鮥鮵鯞鰼鱊鱴鳭鳱
鳻鳼鳽鴀鴄鴔鴗鵒
鵗鵧鶑鶨鶭鶶鷊鷋
鷏鷑鷒鷜鷢麮黭鼆
鼭鼳鼸齂齝䱷眒睓
睼瞛矌矑砨硡硶碝
碮碯磓磢磮磱祱禈
禉秮秴秷稁稢穳窏
窚竧竳竵竻筧篈篖
篢篽籅籏籹粄粈紕
紦紱絚緀緢緥緮緸
縤繵缐罀罠羦翞耞
聮肈肔胒胘脁脥脴
腝膤舓艡芓茟荴荹
荾葈葤蒣蓌蓢蔅蕥
薥蘡蘥虁虂虇蚛蛪
蛽蜹蝢蝪螛裑裦裭
裿褻襐襝襸襼覉覘
覞覴訖詋誑諔諚諣
謶謾譝譿讁讋讐讑
谾豃豙豯貚貟貭貹
賟賻贍贒贔蹕蹗蹘
蹫躢軄軝輡迚迵郺
酄釓釕釩釬鈋鈎鈘
鈟鈫鈯鈻鉝銄銏銤
鋀鋡鋴錂錖錟鍂鍨
鎳鏴鐁鐜鐟鐠鐦鑉
鑺钄閌閖閸闂闙闦
陱険隀隟雥雦雸雿
靊靔韒韸韹頑頣顄
顉顖顙顮顰顲飌飿
铴餝餴馝駊駍駎駟
騀騆騪驃驝驞骪髇
髬鬩魻鮱鮷鯃鯍鯢
鯳鰖鰩鰳鰺鰾鱳鳥
鳧鳵鴊鴤麘麪黫鼡
鼧鼼齀齕齶龐㱮䅟
䙌盧眪瞔矉矹秇竛
篋篏簅簆簵籫籰粙
続縙羆羏翗聅聐肁
胓腞膐臠舎芔萕萡
蒀蔵蕠蕩藪蘗蘙蘛
虊蛧蝖蝲蠬衭褝襇
覡覻覼諊謢豋貰賔
贜跙跮蹵轁逎遬邷
醶釯鈃鉦銽鋟鍝鑤
闘阭阾陖隠靎靤鞵
鞽頝顚颹饄駌騅騘
骮鬎鬗鬡鰥鱏鶏鶯
鶽鷄鷸鸆黐齓﨧砯
磰秞肗芲芿蒳蜶蟵
褆觰趐趓躝陏靘飋
黤
""" #""" 汉字单字字频总表_cedict_12041


cjk_common_subset_2513 = """
一丁七万丈三上下
不丑且丕世丘丙丞
中串丸丹主乃久之
乍乎乏乖乘乙九乞
也乳乾了予事二于
云互五井些亡亢交
亥亦亨享京亭亮人
什仁仄仇今介仍仔
仕他仗付仙仝仟代
令以仰仲件价任企
伉伊伍伎伏伐休伯
伴伶伸伺似伽佃但
位低住佐佑何余佚
佛作佩佯佰佳佶使
侃侈例侍侏侑供依
侮侯侵便促俄俊俎
俑俗俚保俟信修俯
俳俸俺倍倒候倚借
倡倦倨倪倬倭偃假
偈偏偕做停健偶傀
傅傍催傲像僖僚僧
僭僻儒儡兀允元兄
充兆先光克免兜兢
入全八公六兮共兵
其具典兼冀再冒冕
冗冠冥冬冶冷冽凄
准凋凌凝凡凰凶凸
凹出函刀刃分切刈
刊刎刑列初判利刮
到制刷券刺刻剃削
剌前剔剖剩剪副割
剽剿劈力功加劣助
努劫劾勃勇勉勒勘
募勤勺勾勿包匈匍
匏匐匕化北匙匠匡
匣匪匹匿十千升午
卉半卑卒卓南博卜
卞占卦卯印危卵卷
卿厄厘厚原厥去又
叉及友反叔取受叛
口古句叩只叫召叭
可台叱史右司吃各
合吉吊同名后吏吐
向君吝吟吠否吩含
吸吹吻吼吾呈告周
呱味呵呻呼命咀咆
和咎咐咨咫咬咳咸
咽哀品哄哈哉哥哨
哭哮哲哺唆唇唐唯
唱唾啄商啖啼喀善
喇喉喊喘喙喜喝喧
嗅嗔嗜嗟嗣嗤嗽嗾
嘉嘲嘴嘶器噫嚆嚼
囚四回因困囹固圃
圄圈土在圭地圻址
均坊坎坐坑坡坤坦
坪垂型垓垠垢垣埃
埋城域埠埴培基堀
堂堆堡堤堪堰堵塑
塔塘塞塾境墅墓墟
墨壁壅壑壕壤士壬
壹夏夕外夙多夜大
天太夫夭央失夷奄
奇奈奉奎奏契奔奕
套奚奠奢女奴奸好
如妃妄妊妓妖妙妥
妨妹妻妾姆始姐姑
姓委姚姜姨姻姿威
娃娑娘娜娟娠娥娩
娶娼婆婉婚婢媒媚
媛嫁嫂嫉嫌嫡嫦嫩
嬉嬖孀子孑孔孕字
存孚孜孝孟季孤孩
孰孱孵孺宅宇守安
宋完宏宕宗官宙定
宛宜客宣室宥宦宰
害宴宵家宸容宿寂
寄寅密寇富寐寒寓
寞察寡寤寥寨寮寸
寺封射尉尊小少尖
尤就尸尹尺尻尼尾
尿局居屈屋屎屑展
屠履屯山屹岐岑岩
岫岬岱岳岷岸峙峨
峰峻崇崎崔崖崩嵋
嵌嵩嵬嵯嶝巍川州
巡工左巧巨巫差己
已巳巴巷巽巾市布
帆希帑帖帙帛帝席
常帽幄幅幌幕幡幢
干平年幸幻幼幽庄
庇床序底店庚府庠
度座庭庵庶康庸廉
廊廓廖廛延廷建弁
弄弊式弓引弗弘弛
弟弦弧弩弱弼彖彗
形彩彪彬彭彰影彷
役彼往征待徇徊律
後徐徒得徘徙御徨
循微徽心必忌忍忖
志忘忙忠快念忽忿
怏怒怖怜思怠怡急
性怨怪怯恁恂恃恍
恐恕恙恢恣恤恨恩
恪恬恭息恰悉悌悍
悔悖悚悛悟悠患悲
悴悸悼情惑惚惜惟
惠惰想惶惹惺愁愆
愈愉愍愎意愕愚感
愧愿慈慊慌慕慝慢
慧慨慰慷憎憔憧憩
憬憾懈懊懋懦懿戈
戊戌戍戎成我戒或
戚戟戡截戮戴房所
扁扇扈扉手才打托
扮扶批扼承技抄抉
把抑抒投抗折披抱
抵抹押抽拂拇拈拉
拌拍拐拒拓拔拗拘
拙招拜括拭拮拯拱
拳拷拾拿持指按挑
挫振挺挽捉捌捏捐
捕捧据捷捺捻授掉
掌排掖掘掠探接控
推掩措揄揆描提揖
握援揶搏搜搬搭摘
摩摸摺撒撞撤播撮
撰擅操擒擘擢擦攀
攘攫支收攸改攻放
政故效敏救敖敞敢
散敦敬敲整敷文斌
斐斑斗料斛斜斟斡
斤斥斧斫斯新方於
施旁旅旋旌族旒旗
日旦旨早旬旭旱旺
昆昊昌明昏易昔星
映春昧昨昭是昴昶
晁晃晏晟晤晦晨普
景晴晶智暄暇暑暖
暗暝暮暴暹暾曙曜
曝曦曰曲曳更曷曹
曼曾替最月有朋服
朔朕朗望朝期朦木
未末本札朱朴机朽
杆杉李杏材村杓杖
杜杞束杭杯杰杳杵
杷松板枇枉枋析枕
林枚果枝枯枳架枷
枸柄柏某柑染柔柚
柝柩柬柯柱柳柴栓
栖栗校株核根格栽
桀桁桂桃案桎桐桑
桓桔桶梁梅梏梓梗
梢梧梨梭梯械梳梵
棉棋棍棒棕棘棚棠
森棹棺椅植椎椒椰
椽椿楔楚楞楠楫楮
楷楸楹榕榛榜榧榴
榻槁槌槐槽槿樊樗
樟模樵樽橄橘橙橡
檀檄檎檗欠次欣欲
欺款歇歌止正此武
歪死殃殄殆殉殊殖
段殷殿毅毋母毒毓
比毛毫氏民氓水永
汀汁求汐汕汗汝汞
江池汨汪汰汲汽汾
沁沂沃沈沌沐沓沙
沛沫沮河沸油治沼
沽沾沿泄泉泊泌泓
法泗泛泡波泣泥注
泯泰泳洋洌洗洙洛
洞津洪洲洵活洽派
流浙浚浣浦浩浪浮
浴海浸涅消涌涎涓
涕涯液涵淀淅淆淇
淋淑淘淙淞淡淫淮
深淳混淹添渚渠渡
渣渤渥渫渭港游渺
湃湍湖湘湛湟湫湮
源溜溟溢溥溪溯溶
溺滂滋滑滓滔滴漂
漆漏演漕漠漫漱潘
潭潮潺潼澄澎澳澹
激濂濠濡濯瀑瀚瀛
灌火灰灸灼炊炎炒
炙炬炭炯炳炸烈烙
烹烽焉焙焚焦然煌
煎煤煦照煮煽熄熊
熏熔熙熟熬熹燃燎
燔燕燥燧燮爆爪爬
爰爵父爻爽片版牌
牒牙牛牝牟牡牢牧
物牲特犀犁犬犯狂
狄狎狐狗狙狡狩狸
狼猊猖猛猜猝猥猩
猷猾猿獗玄率玉王
玖玩玲玳珀珂珊珍
珞珠珥班球琅理琉
琢琥琳琴琵琶瑁瑕
瑙瑚瑛瑜瑞瑟瑾璃
璋璞璧瓜瓠瓢瓣瓦
瓮瓷甄甑甘甚生甥
用甫甬田由甲申男
甸町界畏畔留畛畜
略畦番畸畿疆疋疏
疑疝疥疫疲疳疵疸
疹疼疽疾痂病症痍
痒痔痕痘痛痢痰痴
痼瘟瘠瘢瘤癌癖癸
登白百的皆皇皎皓
皮皿盂盆盈益盒盛
盟目盲直相盾省眄
眈眉看眠眩眷眸眺
眼睛睡督睦睫睹睾
睿瞑瞥瞬瞰瞳瞻瞿
矗矛矜矢矣知矩短
矮石砂砒砥砦砧破
硅硝硫硬硼碇碌碎
碑碗碣碧磁磅磊磋
磐磨磬礁示社祀祁
祈祉祖祗祚祝神祠
祥票祭祺禁福禧禳
禹禽禾秀私秉秋科
秒秕秘租秤秦秧秩
移稀程稍稔稗稚稠
稷稻稼稽稿穆穗穰
穴究穹空穿突窄窈
窒窕窘窟立站竟章
竣童竭端竹竺竿笏
笑笙笛笞笠符第等
筋筌筏筐筑筒答策
筮筵箔箕算箝管箭
箱箴箸篁篆篇簇簧
簪簿籍米粉粒粕粗
粘粟粥粱粲粳粹精
糊糖糟糠系紊素索
紫累絮繁纂纛缶缸
缺罐罔罕罪置署罹
羊羌美羔羚羞群羲
羸羹羽翁翅翊翌翔
翕翠翡翩翰翼耀老
考者耆而耐耕耗耘
耳耶耽耿聆聊聘聚
聿肄肆肇肉肋肌肖
肛肝股肢肥肩肪肯
肱育肴肺胃胄背胎
胚胛胞胡胤胥胱胴
胸能脂脆脊脯脾腋
腐腑腔腕腥腰腱腹
腺腿膀膈膊膏膜膝
膣膨膳膺臀臂臆臣
臧自臭至致臻臼臾
舅舌舍舒舛舜舞舟
航舫般舵舶舷船艇
艮良色艾芋芍芒芙
芝芟芥芬芭芯花芳
芸芹芽苑苒苔苗苛
苞苟苡若苦英茂范
茄茅茉茗茨茫茯茱
茴茵茶茸茹荀草荏
荒荷荻莉莎莞莪莫
莽菁菅菊菌菖菜菩
菰菱菲菽萃萄萌萍
萎萱萸落著葛葡董
葫葬葵葺蒙蒜蒡蒲
蒸蒿蓄蓉蓍蓑蓬蓼
蔑蔓蔗蔚蔡蔬蔽蕃
蕉蕨薄薇薛薨薪薯
藉藏藕藜藤藩藻虎
虐虔虞虹蚊蚌蚓蚣
蚤蚩蛇蛋蛔蛙蛛蛟
蛤蛭蛾蜀蜂蜃蜈蜘
蜚蜜蝎蝗蝴蝶螂融
螟螳螺蟠蟹蟾蠢血
行衍街衙衡衢衣表
衫衰衲衷衾衿袁袂
袈袋袍袒袖被裁裂
裔裕裙裟裨裳裴裸
褐褒褓褥褪褶襁襄
襟西要覃覆角解言
誓警譬谷豁豆豌豕
豚象豪豫豹豺貂貊
貌赤赦赫走赳赴起
超越趣足趺趾跋跌
跏跛距跣跨路跳踊
踏踞踵蹂蹄蹇蹈蹉
蹊蹙蹴蹶躁躇身躬
辛辜辣辨辰辱迂迅
迎近返迦迪迫迭述
迷追退送逃逅逆逋
逍透逐逑途逗通逝
逞速造逡逢逮逵逸
逼逾遁遂遇遍遐遑
道遣遭遮遵遽避邀
邂邃邑那邦邪邯邱
邵邸郁郊郡部郭都
鄂鄙酉酊酋酌配酎
酒酢酩酪酬酵酷酸
醇醉醋醍醒醯醴醵
采釉里重野量金釜
阜阡阪阮防阻阿陀
陂附陋陌降限陛陟
院除陪陵陶陷隅隆
隋隍隔隘隙障隧雀
雁雄雅集雇雉雌雍
雎雕雨雪零雷雹需
霆震霓霖霜霞霰露
霹靖非靡面革靴鞋
鞍鞠鞫鞭音韶食餐
首香馥馨骨骸髓高
鬼魁魂魃魄魅魏魔
鹿麒麓麝麟麻麾黍
黎黔默黛黜鼎鼓鼠
鼻
""" #""" cjk_common_subset_2513

class _globals:
    _idx2hz = hz_sp_str2hz_str(汉字单字字频总表_cedict_12041)
    _hz2idx = {hz:i for i,hz in enumerate(_idx2hz)}
def hz_set2sorted_hz_str__by_reversed_freq(s):
    hz2idx = _globals._hz2idx
    return ''.join(sorted(s, key=hz2idx.__getitem__))
def hz_set2sorted_hz_str(s):
    return ''.join(sorted(s))
_set2str = hz_set2sorted_hz_str
def _test_cjk_common_subset_2513():
    hz_set_nms = """
        中华字经2003__重复字4000_不同字3980
        通用规范汉字表2013_一级字3500
        gb2312_1980_一级汉字3755
        汉字单字字频总表_cedict_12041
        """.split()
        #通用规范汉字表2013_二级字3000
        #通用规范汉字表2013_三级字1605
        #gb2312_1980_二级汉字3008
        #cjk_common_subset_2513

    cjk_common_subset = hz_sp_str2hz_set(cjk_common_subset_2513)
    assert len(cjk_common_subset) == 2513

    g = globals()
    r = cjk_common_subset
    for hz_set_nm in hz_set_nms:
        rhs = hz_sp_str2hz_set(g[hz_set_nm])
        r &= rhs
        try:
            assert cjk_common_subset <= rhs
        except AssertionError:
            print(f"not cjk_common_subset_2513 <= {hz_set_nm!s}")
            diff = _set2str(cjk_common_subset - rhs)
            print("   ", len(diff))
            #print(diff)
            continue
            raise
    return _set2str(r)

if __name__ == "__main__":
    c = _test_cjk_common_subset_2513()
    if 0:
        # ==>> cjk_common_subset_1869
        print(f"cjk_common_subset_{len(c)}")
        print(c)
    assert len(c) == 1869

    r"""
not cjk_common_subset_2513 <= 中华字经2003__重复字4000_不同字3980
    430
not cjk_common_subset_2513 <= 通用规范汉字表2013_一级字3500
    602
not cjk_common_subset_2513 <= gb2312_1980_一级汉字3755
    488
not cjk_common_subset_2513 <= 汉字单字字频总表_cedict_12041
    2
    #"""


cjk_common_subset_1869 = """
一丁七万丈三上下
不丑且世丘丙中串
丸丹主乃久之乍乎
乏乖乘乙九乞也乳
乾了予事二于云互
五井些亡亢交亥亦
享京亭亮人什仁仇
今介仍仔他仗付仙
代令以仰仲件价任
企伊伍伏伐休伯伴
伶伸伺似佃但位低
住佐佑何余佛作佩
佳使侈例侍供依侮
侯侵便促俄俊俗保
信修俯俺倍倒候倚
借倡倦假偏做停健
偶傅傍催傲像僚僧
僻儒允元兄充兆先
光克免兜兢入全八
公六共兵其具典兼
冀再冒冗冠冬冶冷
凄准凌凝凡凰凶凸
凹出函刀刃分切刊
刑列初判利刮到制
刷券刺刻剃削前剔
剖剩剪副割剿劈力
功加劣助努劫勃勇
勉勒勘募勤勺勾勿
包匈化北匙匠匣匪
匹匿十千升午卉半
卑卒卓南博卜占卯
印危卵卷卿厘厚原
去又叉及友反叔取
受叛口古句只叫召
叭可台史右司吃各
合吉吊同名后吏吐
向君吝吟吠否吩含
吸吹吻吼吾呈告周
味呵呻呼命和咐咨
咬咳咸咽哀品哄哈
哉哥哨哭哮哲哺唆
唇唐唯唱唾啄商啼
善喇喉喊喘喜喝喧
嗅嗜嗽嘉嘲嘴嘶器
嚼囚四回因困固圃
圈土在地址均坊坎
坐坑坡坤坦坪垂型
垢埃埋城域埠培基
堂堆堡堤堪堰堵塑
塔塘塞境墅墓墟墨
壁壤士壬壹夏夕外
多夜大天太夫央失
夷奇奈奉奏契奔套
奠奢女奴奸好如妄
妓妖妙妥妨妹妻姆
始姐姑姓委姚姜姨
姻姿威娃娘娜娟娥
娶婆婉婚媒媚嫁嫂
嫉嫌嫩子孔孕字存
孝孟季孤孩孵宅宇
守安宋完宏宗官宙
定宛宜客宣室宦宰
害宴宵家容宿寂寄
寅密寇富寒寓寞察
寡寥寨寸寺封射尉
尊小少尖尤就尸尺
尼尾尿局居屈屋屎
屑展屠履屯山屹岩
岳岸峨峰峻崇崎崔
崖崩嵌巍川州巡工
左巧巨巫差己已巳
巴巷巾市布帆希帖
帝席常帽幅幌幕幢
干平年幸幻幼幽庄
庇床序底店庚府度
座庭庶康庸廉廊廓
延廷建弄弊式弓引
弗弘弛弟弦弧弱形
彩彪彬彭彰影役彼
往征待徊律徐徒得
徘御循微徽心必忌
忍志忘忙忠快念忽
忿怒怖怜思怠急性
怨怪怯恃恍恐恕恢
恤恨恩恬恭息恰悉
悍悔悟悠患悲悼情
惑惜惟惠惰想惶惹
愁愈愉意愚感愧愿
慈慌慕慢慧慨慰慷
憎憾懈懊懦戈戊戌
戎成我戒或戚截戴
房所扁扇手才打托
扮扶批扼承技抄把
抑抒投抗折披抱抵
抹押抽拂拇拉拌拍
拐拒拓拔拘拙招拜
括拭拯拱拳拷拾拿
持指按挑挫振挺挽
捉捌捏捐捕捧据捷
捻授掉掌排掘掠探
接控推掩措描提握
援搏搜搬搭摘摩摸
撒撞撤播撮撰擅操
擒擦攀支收改攻放
政故效敏救敞敢散
敦敬敲整敷文斌斑
斗料斜斟斤斥斧斯
新方施旁旅旋族旗
日旦旨早旬旭旱旺
昆昌明昏易昔星映
春昧昨昭是晃晦晨
普景晴晶智暇暑暖
暗暮暴曙曰曲更曹
曼曾替最月有朋服
朗望朝期木未末本
朱朴机朽杆杉李杏
材村杖杜束杭杯杰
松板枉析枕林枚果
枝枯架柄柏某柑染
柔柬柱柳柴栓栖栗
校株核根格栽桂桃
案桐桑桔桶梁梅梗
梢梧梨梭梯械梳棉
棋棍棒棕棘棚棠森
棺椅植椎椒椰椿楚
楷榜榴槐槽樟模橙
橡檀欠次欣欲欺款
歇歌止正此武歪死
殃殉殊殖段殷殿毅
母毒比毛毫氏民氓
水永汁求汗汝汞江
池汪汰汽沁沃沈沙
沛沫沮河沸油治沼
沽沾沿泄泉泊泌法
泛泡波泣泥注泰泳
洋洗洛洞津洪洲活
洽派流浙浦浩浪浮
浴海浸消涌涕涯液
涵淀淆淋淑淘淡淫
淮深淳混淹添渠渡
渣渤港游渺湃湖湘
源溜溢溪溯溶溺滋
滑滔滴漂漆漏演漠
漫漱潘潭潮澄澎澳
激瀑灌火灰灸灼炊
炎炒炬炭炸烈烙烹
焉焚焦然煌煎煤照
煮煽熄熊熏熔熙熟
熬燃燕燥爆爪爬爵
父爽片版牌牙牛牡
牢牧物牲特犀犁犬
犯狂狐狗狡狸狼猖
猛猜猩猾猿玄率玉
王玖玩玲珊珍珠班
球琅理琉琢琳琴瑞
瑟璃瓜瓢瓣瓦瓷甘
甚生甥用甫田由甲
申男甸界畏畔留畜
略番畸疆疏疑疫疲
疹疼疾病症痒痕痘
痛痢痰痴瘟瘤癌癸
登白百的皆皇皮皿
盆盈益盒盛盟目盲
直相盾省眉看眠眷
眼睛睡督睦睫睹瞬
瞳瞻矗矛矢矣知矩
短矮石砂破硅硝硫
硬碌碎碑碗碧磁磅
磨礁示社祈祖祝神
祥票祭禁福禹禽禾
秀私秉秋科秒秘租
秤秦秧秩移稀程稍
稚稠稻稼稽稿穆穗
穴究空穿突窄窒窘
窟立站竟章竣童竭
端竹竿笑笛符第等
筋筏筐筑筒答策箕
算管箭箱篇簇簧簿
籍米粉粒粗粘粟粥
粱粹精糊糖糟糠系
紊素索紫累絮繁缸
缺罐罕罪置署羊美
羔羚羞群羹羽翁翅
翔翠翰翼耀老考者
而耐耕耗耘耳耽耿
聊聘聚肆肇肉肋肌
肖肛肝股肢肥肩肪
肯育肺胃背胎胚胞
胡胸能脂脆脊脯脾
腋腐腔腕腥腰腹腺
腿膀膊膏膜膝膨臀
臂臣自臭至致臼舅
舌舍舒舞舟航般舵
舶船艇良色艾芋芒
芝芥芬芭芯花芳芹
芽苑苔苗苛苞苟若
苦英茂范茄茅茫茵
茶茸草荒荷莉莫莽
菊菌菜菩菱菲萄萌
萍萎落著葛葡董葫
葬葵蒙蒜蒲蒸蓄蓉
蓬蔑蔓蔗蔚蔡蔬蔽
蕉薄薛薪薯藉藏藕
藤藻虎虐虹蚊蚌蚤
蛇蛋蛙蛛蛤蛾蜀蜂
蜘蜜蝎蝗蝴蝶融螺
蟹蠢血行衍街衙衡
衣表衫衰衷袁袋袍
袖被裁裂裕裙裳裸
褐褒褥褪襟西要覆
角解言誓警譬谷豁
豆豌象豪豫豹豺貌
赤赦赫走赴起超越
趣足趾跋跌距跨路
跳踊踏蹄蹈躁身躬
辛辜辣辨辰辱迂迅
迎近返迪迫迭述迷
追退送逃逆透逐途
逗通逝逞速造逢逮
逸逼逾遂遇遍道遣
遭遮遵避邀邑那邦
邪郁郊部郭都鄂鄙
酉酌配酒酪酬酵酷
酸醇醉醋醒采里重
野量金防阻阿附陋
陌降限院除陪陵陶
陷隅隆隋隔隘隙障
隧雀雁雄雅集雇雌
雕雨雪零雷雹需震
霜霞露霹靖非靡面
革靴鞋鞍鞠鞭音食
餐首香骨髓高鬼魁
魂魄魏魔鹿麻黎黔
默鼎鼓鼠鼻
""" #""" cjk_common_subset_1869

def hz_set2freq_sorted_rng_ex(hz_set):
    hz2idx = _globals._hz2idx
    out = 0
    m = len(hz2idx)
    M = -1
    for hz in hz_set:
        may_idx = hz2idx.get(hz)
        if may_idx is None:
            out += 1
        else:
            idx = may_idx
            m = min(m, idx)
            M = max(M, idx)
    M += 1
    return (m,M), out

if __name__ == "__main__":
    if 0:print(hz_set2freq_sorted_rng_ex(hz_sp_str2hz_set(cjk_common_subset_1869)))
    assert ((0, 5489), 0) == hz_set2freq_sorted_rng_ex(hz_sp_str2hz_set(cjk_common_subset_1869))
        #1869 频度 竟然 分布在 前5489，不怎么常用...





r'''
^(\w* = ".*")$
^\(\w\+\)$\n^(\(\w*\) = "\(.*\)")$
.,$s/^\(\w\+\)$\n^(\(\w*\) = "\(.*\)")$/# \2 =>\r\1 = """\r\3\r""" # \1\r/


^[^\x00-\xff]
s/.\{8}/\0\r/g
#'''

# cjk_common_subset_2513__TS_hz286 =>
cjk_common_subset_2513_nontrivial_TS_286 = """
万三丑乃乘乾了于
云仇他仙仝价佑余
佛佩修俯借像克冬
凄准凋凌凶出刮制
剃剩剿劈助劫勤匡
匹千升卜占卷厄厘
原只台吃合吊同后
向周呱呵呼和咨咸
咽哄哲唇啖喧嗔回
困圈圭址坑坤堤夫
夭奔奸妊姜娘宴家
寸尸尺局岩岳峨崎
嵩巨布席幡幢干幸
庄床庵弦彗彩彷征
後御志念怜恤惠愈
愍愧愿戚才托抄折
抵拂拈拐拓拜挽据
捻搜摺效斗斤於旋
旗昆暖暗曲札朱朴
机杆村杯杰松板果
枳栖栗核案梁棋棹
楞槁模欣欲殷毋沈
沓沾泄泛注浚浩涌
淀淋淙淡淫混游渺
溜溪演澄澹灌照熏
燕犬狸猛珊球琅瑙
璃瓮留疋症痒痴眺
睾硅磐祗秋秘移稻
穗端筋筑答箝管簪
粗糊糟系累罐耀考
肴胄背胡脊腥致舍
芸苟范菰菱著蒙蓑
蔑薯藉藤蛔蝎表襁
覆谷豆象踊迎迭退
逾郁酬酸醯采里阪
陷雇雕面麻鼠
""" #""" cjk_common_subset_2513_nontrivial_TS_286




#new:cjk_common_subset_2513_trivial_TS_2230
# cjk_common_subset_2513__removed_TS_hz286__2227 =>
cjk_common_subset_2513_trivial_TS_2227 = """
一丁七丈上下不且
丕世丘丙丞中串丸
丹主久之乍乎乏乖
乙九乞也乳予事二
互五井些亡亢交亥
亦亨享京亭亮人什
仁仄今介仍仔仕仗
付仟代令以仰仲件
任企伉伊伍伎伏伐
休伯伴伶伸伺似伽
佃但位低住佐何佚
作佯佰佳佶使侃侈
例侍侏侑供依侮侯
侵便促俄俊俎俑俗
俚保俟信俳俸俺倍
倒候倚倡倦倨倪倬
倭偃假偈偏偕做停
健偶傀傅傍催傲僖
僚僧僭僻儒儡兀允
元兄充兆先光免兜
兢入全八公六兮共
兵其具典兼冀再冒
冕冗冠冥冶冷冽凝
凡凰凸凹函刀刃分
切刈刊刎刑列初判
利到刷券刺刻削剌
前剔剖剪副割剽力
功加劣努劾勃勇勉
勒勘募勺勾勿包匈
匍匏匐匕化北匙匠
匣匪匿十午卉半卑
卒卓南博卞卦卯印
危卵卿厚厥去又叉
及友反叔取受叛口
古句叩叫召叭可叱
史右司各吉名吏吐
君吝吟吠否吩含吸
吹吻吼吾呈告味呻
命咀咆咎咐咫咬咳
哀品哈哉哥哨哭哮
哺唆唐唯唱唾啄商
啼喀善喇喉喊喘喙
喜喝嗅嗜嗟嗣嗤嗽
嗾嘉嘲嘴嘶器噫嚆
嚼囚四因囹固圃圄
土在地圻均坊坎坐
坡坦坪垂型垓垠垢
垣埃埋城域埠埴培
基堀堂堆堡堪堰堵
塑塔塘塞塾境墅墓
墟墨壁壅壑壕壤士
壬壹夏夕外夙多夜
大天太央失夷奄奇
奈奉奎奏契奕套奚
奠奢女奴好如妃妄
妓妖妙妥妨妹妻妾
姆始姐姑姓委姚姨
姻姿威娃娑娜娟娠
娥娩娶娼婆婉婚婢
媒媚媛嫁嫂嫉嫌嫡
嫦嫩嬉嬖孀子孑孔
孕字存孚孜孝孟季
孤孩孰孱孵孺宅宇
守安宋完宏宕宗官
宙定宛宜客宣室宥
宦宰害宵宸容宿寂
寄寅密寇富寐寒寓
寞察寡寤寥寨寮寺
封射尉尊小少尖尤
就尹尻尼尾尿居屈
屋屎屑展屠履屯山
屹岐岑岫岬岱岷岸
峙峰峻崇崔崖崩嵋
嵌嵬嵯嶝巍川州巡
工左巧巫差己已巳
巴巷巽巾市帆希帑
帖帙帛帝常帽幄幅
幌幕平年幻幼幽庇
序底店庚府庠度座
庭庶康庸廉廊廓廖
廛延廷建弁弄弊式
弓引弗弘弛弟弧弩
弱弼彖形彪彬彭彰
影役彼往待徇徊律
徐徒得徘徙徨循微
徽心必忌忍忖忘忙
忠快忽忿怏怒怖思
怠怡急性怨怪怯恁
恂恃恍恐恕恙恢恣
恨恩恪恬恭息恰悉
悌悍悔悖悚悛悟悠
患悲悴悸悼情惑惚
惜惟惰想惶惹惺愁
愆愉愎意愕愚感慈
慊慌慕慝慢慧慨慰
慷憎憔憧憩憬憾懈
懊懋懦懿戈戊戌戍
戎成我戒或戟戡截
戮戴房所扁扇扈扉
手打扮扶批扼承技
抉把抑抒投抗披抱
抹押抽拇拉拌拍拒
拔拗拘拙招括拭拮
拯拱拳拷拾拿持指
按挑挫振挺捉捌捏
捐捕捧捷捺授掉掌
排掖掘掠探接控推
掩措揄揆描提揖握
援揶搏搬搭摘摩摸
撒撞撤播撮撰擅操
擒擘擢擦攀攘攫支
收攸改攻放政故敏
救敖敞敢散敦敬敲
整敷文斌斐斑料斛
斜斟斡斥斧斫斯新
方施旁旅旌族旒日
旦旨早旬旭旱旺昊
昌明昏易昔星映春
昧昨昭是昴昶晁晃
晏晟晤晦晨普景晴
晶智暄暇暑暝暮暴
暹暾曙曜曝曦曰曳
更曷曹曼曾替最月
有朋服朔朕朗望朝
期朦木未末本朽杉
李杏材杓杖杜杞束
杭杳杵杷枇枉枋析
枕林枚枝枯架枷枸
柄柏某柑染柔柚柝
柩柬柯柱柳柴栓校
株根格栽桀桁桂桃
桎桐桑桓桔桶梅梏
梓梗梢梧梨梭梯械
梳梵棉棍棒棕棘棚
棠森棺椅植椎椒椰
椽椿楔楚楠楫楮楷
楸楹榕榛榜榧榴榻
槌槐槽槿樊樗樟樵
樽橄橘橙橡檀檄檎
檗欠次欺款歇歌止
正此武歪死殃殄殆
殉殊殖段殿毅母毒
毓比毛毫氏民氓水
永汀汁求汐汕汗汝
汞江池汨汪汰汲汽
汾沁沂沃沌沐沙沛
沫沮河沸油治沼沽
沿泉泊泌泓法泗泡
波泣泥泯泰泳洋洌
洗洙洛洞津洪洲洵
活洽派流浙浣浦浪
浮浴海浸涅消涎涓
涕涯液涵淅淆淇淑
淘淞淮深淳淹添渚
渠渡渣渤渥渫渭港
湃湍湖湘湛湟湫湮
源溟溢溥溯溶溺滂
滋滑滓滔滴漂漆漏
漕漠漫漱潘潭潮潺
潼澎澳激濂濠濡濯
瀑瀚瀛火灰灸灼炊
炎炒炙炬炭炯炳炸
烈烙烹烽焉焙焚焦
然煌煎煤煦煮煽熄
熊熔熙熟熬熹燃燎
燔燥燧燮爆爪爬爰
爵父爻爽片版牌牒
牙牛牝牟牡牢牧物
牲特犀犁犯狂狄狎
狐狗狙狡狩狼猊猖
猜猝猥猩猷猾猿獗
玄率玉王玖玩玲玳
珀珂珍珞珠珥班理
琉琢琥琳琴琵琶瑁
瑕瑚瑛瑜瑞瑟瑾璋
璞璧瓜瓠瓢瓣瓦瓷
甄甑甘甚生甥用甫
甬田由甲申男甸町
界畏畔畛畜略畦番
畸畿疆疏疑疝疥疫
疲疳疵疸疹疼疽疾
痂病痍痔痕痘痛痢
痰痼瘟瘠瘢瘤癌癖
癸登白百的皆皇皎
皓皮皿盂盆盈益盒
盛盟目盲直相盾省
眄眈眉看眠眩眷眸
眼睛睡督睦睫睹睿
瞑瞥瞬瞰瞳瞻瞿矗
矛矜矢矣知矩短矮
石砂砒砥砦砧破硝
硫硬硼碇碌碎碑碗
碣碧磁磅磊磋磨磬
礁示社祀祁祈祉祖
祚祝神祠祥票祭祺
禁福禧禳禹禽禾秀
私秉科秒秕租秤秦
秧秩稀程稍稔稗稚
稠稷稼稽稿穆穰穴
究穹空穿突窄窈窒
窕窘窟立站竟章竣
童竭竹竺竿笏笑笙
笛笞笠符第等筌筏
筐筒策筮筵箔箕算
箭箱箴箸篁篆篇簇
簧簿籍米粉粒粕粘
粟粥粱粲粳粹精糖
糠紊素索紫絮繁纂
纛缶缸缺罔罕罪置
署罹羊羌美羔羚羞
群羲羸羹羽翁翅翊
翌翔翕翠翡翩翰翼
老者耆而耐耕耗耘
耳耶耽耿聆聊聘聚
聿肄肆肇肉肋肌肖
肛肝股肢肥肩肪肯
肱育肺胃胎胚胛胞
胤胥胱胴胸能脂脆
脯脾腋腐腑腔腕腰
腱腹腺腿膀膈膊膏
膜膝膣膨膳膺臀臂
臆臣臧自臭至臻臼
臾舅舌舒舛舜舞舟
航舫般舵舶舷船艇
艮良色艾芋芍芒芙
芝芟芥芬芭芯花芳
芹芽苑苒苔苗苛苞
苡若苦英茂茄茅茉
茗茨茫茯茱茴茵茶
茸茹荀草荏荒荷荻
莉莎莞莪莫莽菁菅
菊菌菖菜菩菲菽萃
萄萌萍萎萱萸落葛
葡董葫葬葵葺蒜蒡
蒲蒸蒿蓄蓉蓍蓬蓼
蔓蔗蔚蔡蔬蔽蕃蕉
蕨薄薇薛薨薪藏藕
藜藩藻虎虐虔虞虹
蚊蚌蚓蚣蚤蚩蛇蛋
蛙蛛蛟蛤蛭蛾蜀蜂
蜃蜈蜘蜚蜜蝗蝴蝶
螂融螟螳螺蟠蟹蟾
蠢血行衍街衙衡衢
衣衫衰衲衷衾衿袁
袂袈袋袍袒袖被裁
裂裔裕裙裟裨裳裴
裸褐褒褓褥褪褶襄
襟西要覃角解言誓
警譬豁豌豕豚豪豫
豹豺貂貊貌赤赦赫
走赳赴起超越趣足
趺趾跋跌跏跛距跣
跨路跳踏踞踵蹂蹄
蹇蹈蹉蹊蹙蹴蹶躁
躇身躬辛辜辣辨辰
辱迂迅近返迦迪迫
述迷追送逃逅逆逋
逍透逐逑途逗通逝
逞速造逡逢逮逵逸
逼遁遂遇遍遐遑道
遣遭遮遵遽避邀邂
邃邑那邦邪邯邱邵
邸郊郡部郭都鄂鄙
酉酊酋酌配酎酒酢
酩酪酵酷醇醉醋醍
醒醴醵釉重野量金
釜阜阡阮防阻阿陀
陂附陋陌降限陛陟
院除陪陵陶隅隆隋
隍隔隘隙障隧雀雁
雄雅集雉雌雍雎雨
雪零雷雹需霆震霓
霖霜霞霰露霹靖非
靡革靴鞋鞍鞠鞫鞭
音韶食餐首香馥馨
骨骸髓高鬼魁魂魃
魄魅魏魔鹿麒麓麝
麟麾黍黎黔默黛黜
鼎鼓鼻
""" #""" cjk_common_subset_2513_trivial_TS_2227




# cjk_common_subset_1869__TS_hz238 =>
cjk_common_subset_1869_nontrivial_TS_238 = """
万三丑乃乘乾了于
云仇他仙价佑余佛
佩修俯借像克冬凄
准凌凶出刮制剃剩
剿劈助劫勤匹千升
卜占卷厘原只台吃
合吊同后向周呵呼
和咨咸咽哄哲唇喧
回困圈址坑坤堤夫
奔奸姜娘宴家寸尸
尺局岩岳峨崎巨布
席幢干幸庄床弦彩
征御志念怜恤惠愈
愧愿戚才托抄折抵
拂拐拓拜挽据捻搜
效斗斤旋旗昆暖暗
曲朱朴机杆村杯杰
松板果栖栗核案梁
棋模欣欲殷沈沾泄
泛注浩涌淀淋淡淫
混游渺溜溪演澄灌
照熏燕犬狸猛珊球
琅璃留症痒痴硅秋
秘移稻穗端筋筑答
管粗糊糟系累罐耀
考背胡脊腥致舍苟
范菱著蒙蔑薯藉藤
蝎表覆谷豆象踊迎
迭退逾郁酬酸采里
陷雇雕面麻鼠
""" #""" cjk_common_subset_1869_nontrivial_TS_238




#new:cjk_common_subset_1869_trivial_TS_1632
# cjk_common_subset_1869__removed_TS_hz238__1631 =>
cjk_common_subset_1869_trivial_TS_1631 = """
一丁七丈上下不且
世丘丙中串丸丹主
久之乍乎乏乖乙九
乞也乳予事二互五
井些亡亢交亥亦享
京亭亮人什仁今介
仍仔仗付代令以仰
仲件任企伊伍伏伐
休伯伴伶伸伺似佃
但位低住佐何作佳
使侈例侍供依侮侯
侵便促俄俊俗保信
俺倍倒候倚倡倦假
偏做停健偶傅傍催
傲僚僧僻儒允元兄
充兆先光免兜兢入
全八公六共兵其具
典兼冀再冒冗冠冶
冷凝凡凰凸凹函刀
刃分切刊刑列初判
利到刷券刺刻削前
剔剖剪副割力功加
劣努勃勇勉勒勘募
勺勾勿包匈化北匙
匠匣匪匿十午卉半
卑卒卓南博卯印危
卵卿厚去又叉及友
反叔取受叛口古句
叫召叭可史右司各
吉名吏吐君吝吟吠
否吩含吸吹吻吼吾
呈告味呻命咐咬咳
哀品哈哉哥哨哭哮
哺唆唐唯唱唾啄商
啼善喇喉喊喘喜喝
嗅嗜嗽嘉嘲嘴嘶器
嚼囚四因固圃土在
地均坊坎坐坡坦坪
垂型垢埃埋城域埠
培基堂堆堡堪堰堵
塑塔塘塞境墅墓墟
墨壁壤士壬壹夏夕
外多夜大天太央失
夷奇奈奉奏契套奠
奢女奴好如妄妓妖
妙妥妨妹妻姆始姐
姑姓委姚姨姻姿威
娃娜娟娥娶婆婉婚
媒媚嫁嫂嫉嫌嫩子
孔孕字存孝孟季孤
孩孵宅宇守安宋完
宏宗官宙定宛宜客
宣室宦宰害宵容宿
寂寄寅密寇富寒寓
寞察寡寥寨寺封射
尉尊小少尖尤就尼
尾尿居屈屋屎屑展
屠履屯山屹岸峰峻
崇崔崖崩嵌巍川州
巡工左巧巫差己已
巳巴巷巾市帆希帖
帝常帽幅幌幕平年
幻幼幽庇序底店庚
府度座庭庶康庸廉
廊廓延廷建弄弊式
弓引弗弘弛弟弧弱
形彪彬彭彰影役彼
往待徊律徐徒得徘
循微徽心必忌忍忘
忙忠快忽忿怒怖思
怠急性怨怪怯恃恍
恐恕恢恨恩恬恭息
恰悉悍悔悟悠患悲
悼情惑惜惟惰想惶
惹愁愉意愚感慈慌
慕慢慧慨慰慷憎憾
懈懊懦戈戊戌戎成
我戒或截戴房所扁
扇手打扮扶批扼承
技把抑抒投抗披抱
抹押抽拇拉拌拍拒
拔拘拙招括拭拯拱
拳拷拾拿持指按挑
挫振挺捉捌捏捐捕
捧捷授掉掌排掘掠
探接控推掩措描提
握援搏搬搭摘摩摸
撒撞撤播撮撰擅操
擒擦攀支收改攻放
政故敏救敞敢散敦
敬敲整敷文斌斑料
斜斟斥斧斯新方施
旁旅族日旦旨早旬
旭旱旺昌明昏易昔
星映春昧昨昭是晃
晦晨普景晴晶智暇
暑暮暴曙曰更曹曼
曾替最月有朋服朗
望朝期木未末本朽
杉李杏材杖杜束杭
枉析枕林枚枝枯架
柄柏某柑染柔柬柱
柳柴栓校株根格栽
桂桃桐桑桔桶梅梗
梢梧梨梭梯械梳棉
棍棒棕棘棚棠森棺
椅植椎椒椰椿楚楷
榜榴槐槽樟橙橡檀
欠次欺款歇歌止正
此武歪死殃殉殊殖
段殿毅母毒比毛毫
氏民氓水永汁求汗
汝汞江池汪汰汽沁
沃沙沛沫沮河沸油
治沼沽沿泉泊泌法
泡波泣泥泰泳洋洗
洛洞津洪洲活洽派
流浙浦浪浮浴海浸
消涕涯液涵淆淑淘
淮深淳淹添渠渡渣
渤港湃湖湘源溢溯
溶溺滋滑滔滴漂漆
漏漠漫漱潘潭潮澎
澳激瀑火灰灸灼炊
炎炒炬炭炸烈烙烹
焉焚焦然煌煎煤煮
煽熄熊熔熙熟熬燃
燥爆爪爬爵父爽片
版牌牙牛牡牢牧物
牲特犀犁犯狂狐狗
狡狼猖猜猩猾猿玄
率玉王玖玩玲珍珠
班理琉琢琳琴瑞瑟
瓜瓢瓣瓦瓷甘甚生
甥用甫田由甲申男
甸界畏畔畜略番畸
疆疏疑疫疲疹疼疾
病痕痘痛痢痰瘟瘤
癌癸登白百的皆皇
皮皿盆盈益盒盛盟
目盲直相盾省眉看
眠眷眼睛睡督睦睫
睹瞬瞳瞻矗矛矢矣
知矩短矮石砂破硝
硫硬碌碎碑碗碧磁
磅磨礁示社祈祖祝
神祥票祭禁福禹禽
禾秀私秉科秒租秤
秦秧秩稀程稍稚稠
稼稽稿穆穴究空穿
突窄窒窘窟立站竟
章竣童竭竹竿笑笛
符第等筏筐筒策箕
算箭箱篇簇簧簿籍
米粉粒粘粟粥粱粹
精糖糠紊素索紫絮
繁缸缺罕罪置署羊
美羔羚羞群羹羽翁
翅翔翠翰翼老者而
耐耕耗耘耳耽耿聊
聘聚肆肇肉肋肌肖
肛肝股肢肥肩肪肯
育肺胃胎胚胞胸能
脂脆脯脾腋腐腔腕
腰腹腺腿膀膊膏膜
膝膨臀臂臣自臭至
臼舅舌舒舞舟航般
舵舶船艇良色艾芋
芒芝芥芬芭芯花芳
芹芽苑苔苗苛苞若
苦英茂茄茅茫茵茶
茸草荒荷莉莫莽菊
菌菜菩菲萄萌萍萎
落葛葡董葫葬葵蒜
蒲蒸蓄蓉蓬蔓蔗蔚
蔡蔬蔽蕉薄薛薪藏
藕藻虎虐虹蚊蚌蚤
蛇蛋蛙蛛蛤蛾蜀蜂
蜘蜜蝗蝴蝶融螺蟹
蠢血行衍街衙衡衣
衫衰衷袁袋袍袖被
裁裂裕裙裳裸褐褒
褥褪襟西要角解言
誓警譬豁豌豪豫豹
豺貌赤赦赫走赴起
超越趣足趾跋跌距
跨路跳踏蹄蹈躁身
躬辛辜辣辨辰辱迂
迅近返迪迫述迷追
送逃逆透逐途逗通
逝逞速造逢逮逸逼
遂遇遍道遣遭遮遵
避邀邑那邦邪郊部
郭都鄂鄙酉酌配酒
酪酵酷醇醉醋醒重
野量金防阻阿附陋
陌降限院除陪陵陶
隅隆隋隔隘隙障隧
雀雁雄雅集雌雨雪
零雷雹需震霜霞露
霹靖非靡革靴鞋鞍
鞠鞭音食餐首香骨
髓高鬼魁魂魄魏魔
鹿黎黔默鼎鼓鼻
""" #""" cjk_common_subset_1869_trivial_TS_1631



def _test_zzz_ddd_nontrivial_TS_ddd():
    _2513 = hz_sp_str2hz_set(cjk_common_subset_2513)
    _1869 = hz_sp_str2hz_set(cjk_common_subset_1869)
    _2227 = hz_sp_str2hz_set(cjk_common_subset_2513_trivial_TS_2227)
    _1631 = hz_sp_str2hz_set(cjk_common_subset_1869_trivial_TS_1631)
    _286 = hz_sp_str2hz_set(cjk_common_subset_2513_nontrivial_TS_286)
    _238 = hz_sp_str2hz_set(cjk_common_subset_1869_nontrivial_TS_238)
    assert len(_2513) == 2513
    assert len(_1869) == 1869
    assert len(_2227) == 2227
    assert len(_1631) == 1631
    assert len(_286) == 286
    assert len(_238) == 238
    assert _2513 == _2227 | _286
    assert _1869 == _1631 | _238
    assert _2513 - _286 == _2227
    assert _1869 - _238 == _1631
    assert _1869 < _2513
    assert _1631 < _2227
    assert _238 < _286

if __name__ == "__main__":
    _test_zzz_ddd_nontrivial_TS_ddd()


共享汉字字集 = cjk_common_subset_2513
初步缩减囗共享汉字字集 = cjk_common_subset_1869
平凡繁简囗初步缩减囗共享汉字字集 = cjk_common_subset_1869_trivial_TS_1631
平凡繁简囗共享汉字字集 = cjk_common_subset_2513_trivial_TS_2227



#8bit 256字 方案没找到
#4bit 16字 方案很多
#4笔*1bit每笔 的 方案，选一:
_4bit__14_23__sp5 = 按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字 = '羽立六井太左共而木手父介仁少行血'
    #14_23__sp5
#2笔*2bit每笔 的 方案，选一:
_4bit__1_3_4_2__sp5 = 按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字 = '二大至丁乞反人川亡羊之祖口小光山'
    #1_3_4_2__sp5

#6bit 方案:
#6笔*1bit每笔 的 方案，选一:
_6bit__14_23__sp5 = 按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字 = '泣汗江洪浮浴沙派廊唐廉度底店府刑捧扶持描授扮拍拙茫芋苔茸草芥芹花膀旱是最昌晃昭易忿坐企斧肖竹敞盆信位停偏佳佐供僧伶件俗蜀伯悠循催'
    #14_23__sp5

hz_initial_4strokes_as_4bits_by_grouping_14_23__sp5___digits_16 = _4bit__14_23__sp5
hz_initial_2strokes_as_4bits_by_grouping_1_3_4_2__sp5___digits_16 = _4bit__1_3_4_2__sp5
hz_initial_6strokes_as_6bits_by_grouping_14_23__sp5___digits_64 = _6bit__14_23__sp5

def _test_编码二进制用的代表字():
    assert len(_4bit__1_3_4_2__sp5) == 16
    assert len(_4bit__14_23__sp5) == 16
    assert len(_6bit__14_23__sp5) == 64
    ls = [*_4bit__1_3_4_2__sp5, *_4bit__14_23__sp5, *_6bit__14_23__sp5]
    s = {*ls}
    assert len(s) == len(ls) == 16+16+64
    assert s <= hz_sp_str2hz_set(cjk_common_subset_1869_trivial_TS_1631)
if __name__ == "__main__":
    _test_编码二进制用的代表字()








高稳定度汉字字集囗第一版囗高频八十六字 = stable_hz_set_ver1__high_86 = '矣郡惟淮荷哉嗣撰巳朕癸亥椅衙旱俺簿旬癌蕃猩塘擢薨懿裳脊稷葡憾蝗梗萄揖晏棠喀梢藩暑膊胤株筵棚沼弧敞榻殆鄂沮璋敖邸嗟膨黜悖逵漕攸蔬蛟嵌俸瘢嗜哺蕉杉侈梭麾胥汾掖琢戟甥荀斛耆隅茵檄'


高稳定度汉字字集囗第一版囗低频二百五十六字 = stable_hz_set_ver1__low_256 = '竺笙翊釉宸潼徇礁僖臾泗瑾羲渥拷壕脯壑瑛孺熄瑚琶斡渤爰甄恁苔芍嗔偈褥痰裨舷磐勺簪蟠橡嫦逋珀佃夙濠肪枷剔薇椿蹙茄涓溥衢茸翌窒穹蛾卞衾陟琵菁雉猝曙酵邯懋眸曷瀑焙悸蛭珂揆瑁喙陂淙舫斫麝燮桔愆庠跛黍佚癖蹇曦湍蒜磬珥橙娑怏暹瓢逡嵋跏燧昴疵爻麒橄寤幄胛淞滓狎窈湫帑芹拌荻嬖盂碇燔倨皿瘠蚌祉淅洵楹秧咫筮蚣瞑攫悌跣趺褶灸樟魃倬翡傀殄岬菽俳槁蒿羸侏裟暝袈痘俑稔畛粕翕濂甑蜈葺柑楔椽匐樗嵬溟噫蔗琥匍碣嗾纛禳醵艮戡萸瓠雎槿侑枋肄暾慝梏楮檎汐豌蕨逑桎枳楸慊螟佶畦稗酊圄菖揄孱疥蓍蹉痍枸枇茯廛猊酩荏擘苒眄茱痂篁腱膈筌埴醍柝酎莪疝茴堀檗疳蒡嚆'


高稳定度汉字字集囗第一版囗降频囗三百四十二字 = stable_hz_set_ver1__reversed_freq__342 = '矣郡惟淮荷哉嗣撰巳朕癸亥椅衙旱俺簿旬癌蕃猩塘擢薨懿裳脊稷葡憾蝗梗萄揖晏棠喀梢藩暑膊胤株筵棚沼弧敞榻殆鄂沮璋敖邸嗟膨黜悖逵漕攸蔬蛟嵌俸瘢嗜哺蕉杉侈梭麾胥汾掖琢戟甥荀斛耆隅茵檄竺笙翊釉宸潼徇礁僖臾泗瑾羲渥拷壕脯壑瑛孺熄瑚琶斡渤爰甄恁苔芍嗔偈褥痰裨舷磐勺簪蟠橡嫦逋珀佃夙濠肪枷剔薇椿蹙茄涓溥衢茸翌窒穹蛾卞衾陟琵菁雉猝曙酵邯懋眸曷瀑焙悸蛭珂揆瑁喙陂淙舫斫麝燮桔愆庠跛黍佚癖蹇曦湍蒜磬珥橙娑怏暹瓢逡嵋跏燧昴疵爻麒橄寤幄胛淞滓狎窈湫帑芹拌荻嬖盂碇燔倨皿瘠蚌祉淅洵楹秧咫筮蚣瞑攫悌跣趺褶灸樟魃倬翡傀殄岬菽俳槁蒿羸侏裟暝袈痘俑稔畛粕翕濂甑蜈葺柑楔椽匐樗嵬溟噫蔗琥匍碣嗾纛禳醵艮戡萸瓠雎槿侑枋肄暾慝梏楮檎汐豌蕨逑桎枳楸慊螟佶畦稗酊圄菖揄孱疥蓍蹉痍枸枇茯廛猊酩荏擘苒眄茱痂篁腱膈筌埴醍柝酎莪疝茴堀檗疳蒡嚆'


if __name__ == "__main__":
    assert stable_hz_set_ver1__reversed_freq__342 == stable_hz_set_ver1__high_86 + stable_hz_set_ver1__low_256




def _test_高稳定度汉字字集囗第一版():
    assert len(stable_hz_set_ver1__high_86) == 86
    assert len(stable_hz_set_ver1__low_256) == 256
    ls = [*stable_hz_set_ver1__high_86, *stable_hz_set_ver1__low_256]
    s = {*ls}
    assert len(s) == len(ls) == 86+256 == 342
    hz_set2sorted_hz_str
    hz_str = hz_set2sorted_hz_str__by_reversed_freq(s)
    assert hz_str == stable_hz_set_ver1__high_86 + stable_hz_set_ver1__low_256

    assert s <= hz_sp_str2hz_set(cjk_common_subset_2513)
    errs_ls = []
    def f(n, s, s2):
        errs = s-hz_sp_str2hz_set(s2)
        errs_ls.append(errs)
        if not n == len(errs):
            print((errs))
            print(len(errs))
        assert n == len(errs)
    f(7, s, cjk_common_subset_2513_trivial_TS_2227)
        # {'槁', '淙', '簪', '脊', '嗔', '磐', '枳'}
    f(257, s, cjk_common_subset_1869)
    f(258, s, cjk_common_subset_1869_trivial_TS_1631)
        # '脊'
    assert {'脊'} == (errs_ls[2] - errs_ls[1])
if __name__ == "__main__":
    _test_高稳定度汉字字集囗第一版()



高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字 = '矣郡荷哉嗣撰朕癸亥椅衙旱俺猩塘擢薨裳稷葡憾蝗梗萄揖晏棠喀梢暑膊胤株筵棚沼弧敞榻殆鄂敖邸嗟膨黜逵漕攸蔬蛟嵌俸嗜哺蕉杉侈梭胥汾掖琢戟甥斛耆隅茵檄竺笙釉宸潼徇礁僖臾泗渥拷脯瑛孺熄瑚琶渤甄恁苔芍偈褥裨舷勺橡嫦逋珀佃夙肪枷剔薇椿蹙茄涓溥茸窒穹蛾衾陟琵菁猝曙酵邯眸曷瀑焙悸蛭珂揆瑁喙陂舫斫桔愆跛黍佚蹇曦湍蒜珥橙怏瓢逡嵋跏燧昴爻麒橄寤幄胛淞滓狎窈芹拌荻盂碇皿蚌祉洵楹秧咫筮蚣悌跣趺褶灸樟魃倬翡傀殄岬菽俳蒿侏袈俑稔畛粕翕濂蜈葺柑楔椽樗嵬噫琥碣嗾禳戡萸槿侑枋暾慝梏楮汐豌蕨逑桎慊佶畦稗酊圄菖孱蓍蹉枸枇茯猊酩荏苒眄茱篁腱膈筌醍柝酎莪茴蒡嚆'


stable_hz_set_ver2__excludeILL__reversed_freq__259 = 高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字

def _test_高稳定度汉字字集囗第二版():
    hzs_excludeILL_259 = 高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字
    assert 259 == len(hzs_excludeILL_259)
    assert 259 == len({*hzs_excludeILL_259})
    assert {*hzs_excludeILL_259} < {*高稳定度汉字字集囗第一版囗降频囗三百四十二字}
        #兼容旧版

    from nn_ns.CJK.CJK_data.raw.用汉字编码数据.高稳定度汉字字集 import 高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字 as _hzs_excludeILL_259
    assert _hzs_excludeILL_259 == hzs_excludeILL_259
        #来源
if __name__ == "__main__":
    _test_高稳定度汉字字集囗第二版()




高稳定度汉字字集囗第三版囗码序囗二百六十一字 = '亥佃佚佶侈侏侑俑俳俸倨倬偈僖剔匍匐卞咫哺喀喙嗜嗟嗣嗾噫嚆圄埴堀壑壕夙娑孺宸寤岬嵋嵌嵬巳帑幄庠廛弧怏恁悌悖悸惟愆慊慝憾懋戟戡拌掖揄揆揖撰擘攫攸敖敞斛斡斫旬昴晏暑暝暹暾曷杉枇枋枷柝桎梏梢棚椅椽椿楔楮楸楹槿樗橄橙檄檎檗殄殆汐沮沼泗洵涓淅淞淮渤渥湍湫溟溥滓漕潼濂瀑灸焙熄燔燧爻猊猩珀珂珥琢琥琵琶瑁瑚瑛瑾璋瓠瓢甄甑甥畛畦盂眄眸瞑矣碇碣磬礁祉禳秧稔稗稷窈竺筌筮筵篁粕纛翕耆肄肪胛胥脯腱膈膊膨臾舫舷艮芍芹苒茄茯茱茴茵茸荀荏莪菁菖菽葺蒡蓍蔬蕃蕉蕨薨藩蚌蚣蛟蛭蜈蝗蟠衢衾袈裟裨褥褶豌趺跏跛跣蹇蹉蹙逋逑逡逵邸郡酊酎酩酵醍醵釉陂陟隅雉雎魃麾黍黜'


stable_hz_set_ver3__sorted__261 = 高稳定度汉字字集囗第三版囗码序囗二百六十一字

def _test_高稳定度汉字字集囗第三版():
    hzs_261 = 高稳定度汉字字集囗第三版囗码序囗二百六十一字
    assert 261 == len(hzs_261)
    assert 261 == len({*hzs_261})
    assert {*hzs_261} < {*高稳定度汉字字集囗第一版囗降频囗三百四十二字}
        #兼容第一版

    hzs_excludeILL_259 = 高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字
    assert len({*hzs_261} & {*hzs_excludeILL_259}) == 210 < 259 < 261, len({*hzs_261} & {*hzs_excludeILL_259})
        #不兼容第二版


    from nn_ns.CJK.CJK_data.raw.用汉字编码数据.高稳定度汉字字集 import 高稳定度汉字字集囗第三版囗码序囗二百六十一字 as _hzs_261
    assert _hzs_261 == hzs_261
        #来源
if __name__ == "__main__":
    _test_高稳定度汉字字集囗第三版()













unihan_kIICore_levelA_common_hz_str__U13_0___2143 = """
一丁七丈三上下不
丑且丕世丘丙丞中
串丸丹主乃久之乍
乎乏乖乙九乞也乳
乾了予事二于云互
五井些亡交亥亦亨
享京亭亮人什仁仄
仇今介仍仔仕他付
仙仟代令以仰仲件
任企伉伊伍伏伐休
伯伴伶伸伺似伽佃
但位低住佐佑何余
佛作佩佰佳使侃侈
例侍侏供依侮侯侵
便促俄俊俑俗俚保
俟信修俯俳俸俺倍
倒候倚借倦倪倭偈
偏偕做停健偶傀傅
傍催傲像僖僚僧僭
僻儒儡兀允元兄充
兆先光克免兜入全
八公六共兵其具典
兼冀再冒冕冠冥冬
冶冷冽准凋凌凝凡
凰凶凸凹出函刀刃
分切刊刎刑列初判
利刮到制刷券刺刻
剃削剋剌前剖剪副
割剽劈力功加劣助
努劫劾勃勇勉勒勘
募勤勾勿包匈匐匕
化北匙匠匡匣匪匹
匿十千升午卉半卑
卒卓南博卜卞占卦
卯印危卵卿厄厘厚
原厥去又叉及友反
叔取受叛口古句叩
只叫召可台叱史右
司吃各合吉同名后
吏吐向君吝吟吠否
含吸吹吻吼吾呈告
周味呵呻呼命咀咆
和咎咫咬咳咸咽哀
品哄哈哉哥哨哭哮
哲哺唆唐唯唱唾啄
商啖啼喀善喉喊喘
喜喝喧嗅嗜嗟嗣嗤
嘉嘲嘴嘶器噫嚼囚
四回因困固圃圈土
在圭地址均坊坐坑
坡坤坦坪垂型垠垢
垣埃埋城域埠培基
堂堆堡堤堪堰堵塑
塔塘塾境墓墟墨壁
壑壕壤士壬壹夏夕
外夙多夜大天太夫
夭央失夷奄奇奈奉
奎奏契奔奕套奚奠
奢女奴奸好如妃妄
妊妓妖妙妥妨妹妻
妾姆始姐姑姓委姚
姜姨姻姿威娃娑娘
娜娟娠娥娩娼婆婉
婚婢媒媚媛嫁嫉嫌
嫡嫦嫩嬉子孔孕字
存孚孜孝孟季孤孰
孵宅宇守安宋完宏
宗官宙定宛宜客宣
室宥宦宰害宴宵家
容宿寂寄寅密寇富
寐寒寓寞察寡寨寮
寸寺封射尉尊小少
尖尤就尹尺尼尾尿
局居屈屋屎屑展屠
履屯山屹岐岑岩岱
岳岷岸峙峨峰峻崇
崎崔崖崩嵌嵩巍川
州巡工左巧巨巫差
己已巳巴巷巾市布
帆希帑帖帛帝席常
帽幅幌幕幢干平年
幸幻幼幽庇序底店
庚府度座庭庵庶康
庸廉廊廓廖延廷建
弄弊式弓引弗弘弛
弟弦弧弩弱弼彗形
彩彪彬彭彰影彷役
彼往征待徇徊律徐
徒得徘徙御徨循微
徽心必忌忍忖志忘
忙忠快念忽忿怒怖
思怠怡急性怨怪怯
恃恍恐恒恕恢恣恨
恩恪恬恭息恰悉悍
悔悖悟悠患悲悴悸
悼情惑惚惜惟惠惰
想惶惹惺愁愈愉意
愕愚感愧慈慌慕慢
慧慨慰慷憎憔憧憩
憬憾懈懿戈戊戌戍
戎成我戒或戚戟截
戮戴房所扁扇扈扉
手才打托扮扶批承
技抄抉把抑抒投抗
折披抱抵抹押抽拇
拉拌拍拐拒拓拗拘
拙招括拭拮拱拳拷
拾拿持指按挑挫振
挺挽捉捏捐捕捧捷
捻授掉掌排掖掘掠
探接控推掩措描提
揖握援搬搭摘摩摸
摺撒撞撤播撮撰擅
操擒擦攀攘攫支收
改攻放政故效敏救
敖敞敢散敦敬敲整
敷文斌斐斑斗料斜
斟斡斤斥斧斯新方
於施旁旅旋族旗日
旦旨早旬旭旱旺昆
昊昌明昏易昔星映
春昧昨昭是晃晏晤
晦晨普景晴晶智暇
暑暖暗暮暴曙曜曝
曦曰曲曳更曹曼曾
替最月有朋服朔朕
朗望朝期朦木未末
本札朱朴朽杉李杏
材村杖杜杞束杭杯
杰杳杵杷松板枇析
枕林枚果枝枯架柄
柏某柑染柔柚柩柯
柱柳柴栓校株核根
格栽桂桃案桐桑桓
桔桶梁梅梓梗梢梧
梨梯械梳梵棉棋棍
棒棘棚棠森棺椅植
椎椒椰椿楔楚楞楠
楫楷榕榛榜榴槌槐
槽樊樟模樵樽橘橙
橡檀檄欠次欣欲欺
款歌止正此武歪死
殆殉殊殖段殷殿毅
母毒毓比毛毫氏民
氓水永氾汀汁求汐
汕汗汝江池汪汰汲
汽沁沂沃沈沌沐沙
沛沫沮河沸油治沼
沽沿泄泉泊泌法泗
泡波泣泥注泰泳洋
洗洛洞津洪洲活洽
派流浙浚浣浦浩浪
浮浴海浸消涌涎涓
涯液涵淆淇淋淑淘
淞淡淫淮深淳混淹
添渚渠渡渤渥渭港
游渺湃湍湖湘湛源
溜溢溥溪溯溶溺滂
滋滑滓滔滴漂漆漏
演漠漫漱潘潭潮潺
澄澎澳澹激濠濡濯
瀑瀚瀛灌火灰灸灼
炊炎炒炙炬炭炯炳
炸烈烙烹焉焙焚焦
然煌煎煤照煮煽熄
熊熔熙熟熹燃燎燕
燥燧燮爆爪爬爵父
爽片版牌牒牙牛牝
牟牡牢牧物牲特犀
犬犯狂狄狎狐狗狙
狡狩狼猖猛猜猥猩
猷猾猿獗玄率玉王
玖玩玲玳珀珊珍珠
班球琅理琉琢琥琳
琴琵琶瑁瑕瑙瑚瑛
瑜瑞瑟璃璋璧瓜瓢
瓣瓦瓷甘甚生甥用
甫田由甲申男甸界
畏畔留畜略畦番畸
疆疏疑疝疥疫疲疵
疹疼疽疾病症痔痕
痘痛痢痰瘤癌癖癸
登白百的皆皇皎皓
皮皿盂盆盈益盒盛
盟目盲直相盾省眉
看眠眩眷眸眺眼睛
睡督睦睫睿瞑瞥瞬
瞭瞰瞳瞻瞿矗矛矜
矢知矩短矮石砂砥
砧破硝硫硬碌碑碗
碧磁磊磋磐磨礁示
社祀祁祇祈祉祖祗
祚祝神祠祥票祭祺
禁福禧禹禽禾秀私
秉秋科秒秘租秤秦
秧秩移稀程稍稔稚
稠稷稼稽稿穀穆穗
穴究穹空穿突窄窈
窒窘窟立站竟章竣
童端竹竺竿笑笙笛
笠符第等筋筏筐筒
答策筵箔箕算管箭
箱箴篆篇簇簿籍米
粉粒粗粘粟粥精糊
糖糟糠系紊素索紫
累絮繁纂罐罪置署
罹羊美羚羞群羲羹
羽翁翅翌翔翟翠翡
翩翰翼耀老考者耆
而耐耕耗耘耳耶耽
耿聆聊聘聚聿肆肇
肉肋肌肖肛肝股肢
肥肩肪肯肱育肴肺
胃背胎胚胞胡胤胥
胱胴胸能脂脆脊脾
腋腐腑腔腕腰腱腹
腺腿膀膏膜膝膨膳
臀臂臆臣自臭至致
臻臼舅舌舍舒舜舞
舟航舫般舵舶舷船
艇良色艾芋芍芒芙
芝芥芬芭芯花芳芷
芸芹芽苑苔苗苛苞
若苦英茂范茄茅茉
茗茨茫茱茶茸茹荀
草荏荒荷荻莉莎莞
莫莽菁菊菌菜菩菱
菲萃萄萌萍萎萱落
著葛葡董葬葵蒙蒜
蒲蒸蓄蓉蓑蓬蔑蔓
蔚蔡蔬蔽蕃蕉蕨薄
薇薛薪薯藉藏藤藩
藻虎虐虔虞虹蚊蚓
蚤蛇蛋蛙蛛蛟蛤蛭
蛾蜀蜂蜘蜚蜜蝴蝶
螂融螺蟹蠢血行衍
街衙衡衣表衰衷袁
袂袈袋袍袖被裁裂
裔裕裙裟裳裴裸褐
褥褪褶襄襟西要覃
覆角解言詹誓警谷
豁豆豚象豪豫豹貂
貌赤赦赫走赳赴起
超越趣足趾跋跌距
跨路跳踏踵蹂蹄蹉
蹊蹶躁躇身躬辛辜
辣辰辱迂迅迎近返
迦迪迫迭述迷追退
送逃逅逆逍透逐途
逗通逝逞速造逢逮
逵逸逼遁遂遇遍遑
道遣遭遮遵遽避邂
邑那邦邪邱邵邸郁
郊郡部郭都鄂鄙酉
酊酋酌配酒酩酪酬
酵酷酸醇醋醒采釉
里重野量金釜閒阜
阪阮防阻阿陀附陋
降限陛院除陪陵陶
隅隆隋隔隘隙障隧
雀雁雄雅集雉雌雍
雨雪零雷雹需霆震
霖霜霞露霹靖非靡
面革靴鞋鞍鞠鞭音
韶食餐首香馥馨骨
骸高鬼魁魂魄魅魏
魔鹿麒麓麝麟麻麾
黍黎黛鼎鼓鼠鼻
""" #""" unihan_kIICore_levelA_common_hz_str__U13_0___2143


def _test__unihan_kIICore_levelA_common_hz_str__U13_0__2143():
    hzs_2143 = hz_sp_str2hz_set(unihan_kIICore_levelA_common_hz_str__U13_0___2143)
    assert len(hzs_2143) == 2143
    hzs_2513 = hz_sp_str2hz_set(cjk_common_subset_2513)
    assert len(hzs_2513) == 2513
    common = hzs_2513 & hzs_2143
    left_only = hzs_2513 - hzs_2143
    right_only = hzs_2143 - hzs_2513

    assert len(common) == 2133
    assert len(left_only) == 380
    assert len(right_only) == 10
    return
if __name__ == "__main__":
    _test__unihan_kIICore_levelA_common_hz_str__U13_0__2143()


if 0b01 and __name__ == "__main__":
    _vs_
    _vss_('unihan_kIICore_levelA_common_hz_str__U13_0___2143', '''
        cjk_common_subset_2513
        cjk_common_subset_1869
        ''')




left_only__hzs_2143_vs_hzs_2513___10='剋恒氾瞭祇穀翟芷詹閒'
check_len__hz_sp_str(10, left_only__hzs_2143_vs_hzs_2513___10)
right_only__hzs_2143_vs_hzs_2513___380='万乘亢仗仝价伎佚佯佶侑俎倡倨倬偃假兢兮冗凄刈剔剩剿勺匍匏卷叭吊吩呱咐咨唇喇喙嗔嗽嗾嚆囹圄圻坎垓埴堀塞墅壅娶嫂嬖孀孑孩孱孺宕宸寤寥尸尻岫岬嵋嵬嵯嶝巽帙幄幡庄床庠廛弁彖後怏怜恁恂恙恤悌悚悛愆愍愎愿慊慝懊懋懦戡扼拂拈拔拜拯捌据捺揄揆揶搏搜擘擢攸斛斫旌旒昴昶晁晟暄暝暹暾曷机杆杓枉枋枳枷枸柝柬栖栗桀桁桎梏梭棕棹椽楮楸楹榧榻槁槿樗橄檎檗歇殃殄毋汞汨汾沓沾泓泛泯洌洙洵涅涕淀淅淙渣渫湟湫湮溟漕潼濂烽煦熏熬燔爰爻犁狸猊猝珂珞珥瑾璞瓠瓮甄甑甬町畛畿疋疳疸痂痍痒痴痼瘟瘠瘢眄眈睹睾矣砒砦硅硼碇碎碣磅磬禳秕稗稻穰窕竭笏笞筌筑筮箝箸篁簧簪粕粱粲粳粹纛缶缸缺罔罕羌羔羸翊翕肄胄胛脯腥膈膊膣膺臧臾舛艮芟苒苟苡茯茴茵莪菅菖菰菽萸葫葺蒡蒿蓍蓼蔗薨藕藜蚌蚣蚩蛔蜃蜈蝎蝗螟螳蟠蟾衢衫衲衾衿袒裨褒褓襁譬豌豕豺貊趺跏跛跣踊踞蹇蹈蹙蹴辨逋逑逡逾遐邀邃邯酎酢醉醍醯醴醵阡陂陌陟陷隍雇雎雕霓霰鞫髓魃黔默黜'
check_len__hz_sp_str(380, right_only__hzs_2143_vs_hzs_2513___380)

(common__hzs_2143_vs_hzs_2513___2133, _left_only__hzs_2143_vs_hzs_2513___10, _right_only__hzs_2143_vs_hzs_2513___380) = vs__hz_sp_str8set(unihan_kIICore_levelA_common_hz_str__U13_0___2143, cjk_common_subset_2513)
check_len__hz_sp_str(2133, common__hzs_2143_vs_hzs_2513___2133)
assert eq__hz_sp_str(left_only__hzs_2143_vs_hzs_2513___10, _left_only__hzs_2143_vs_hzs_2513___10)
assert eq__hz_sp_str(right_only__hzs_2143_vs_hzs_2513___380, _right_only__hzs_2143_vs_hzs_2513___380)



left_only__hzs_2143_vs_hzs_1869___388='丕丞亨仄仕仟伉伽佰侃侏俑俚俟俳俸倪倭偈偕傀僖僭儡兀冕冥冽凋刎剋剌剽劾匐匕匡卞卦厄厥叩叱咀咆咎咫啖喀嗟嗣嗤噫圭垠垣塾壑壕夙夭奄奎奕奚妃妊妾娑娠娩娼婢媛嫡嫦嬉孚孜孰宥寐寮尹岐岑岱岷峙嵩帑帛庵廖弩弼彗彷徇徙徨忖怡恒恣恪悖悴悸惚惺愕憔憧憩憬懿戍戟戮扈扉抉拗拮掖揖摺攘攫敖斐斡於昊晏晤曜曝曦曳朔朕朦札杞杳杵杷枇柚柩柯桓梓梵楔楞楠楫榕榛槌樊樵樽橘檄殆毓氾汀汐汕汲沂沌沐泗浚浣涎涓淇淞渚渥渭湍湛溥滂滓潺澹濠濡濯瀚瀛炙炯炳焙熹燎燧燮牒牝牟狄狎狙狩猥猷獗玳珀琥琵琶瑁瑕瑙瑚瑛瑜璋璧畦疝疥疵疽痔癖皎皓盂眩眸眺睿瞑瞥瞭瞰瞿矜砥砧磊磋磐祀祁祇祉祗祚祠祺禧稔稷穀穹窈竺笙笠筵箔箴篆纂罹羲翌翟翡翩耆耶聆聿肱肴胤胥胱胴腑腱膳臆臻舜舫舷芍芙芷芸茉茗茨茱茹荀荏荻莎莞菁萃萱蓑蕃蕨薇藩虔虞蚓蛟蛭蜚螂袂袈裔裟裴褶襄覃詹豚貂赳踵蹂蹉蹊蹶躇迦逅逍逵遁遑遽邂邱邵邸郡酊酋酩釉釜閒阜阪阮陀陛雉雍霆霖韶馥馨骸魅麒麓麝麟麾黍黛'
check_len__hz_sp_str(388, left_only__hzs_2143_vs_hzs_1869___388)
right_only__hzs_2143_vs_hzs_1869___114='万乘亢仗价倡假兢冗凄剔剩剿勺卷叭吊吩咐咨唇喇嗽坎塞墅娶嫂孩寥尸庄床怜恤愿懊懦扼拂拔拜拯捌据搏搜机杆枉柬栖栗梭棕歇殃汞沾泛涕淀渣熏熬犁狸痒痴瘟睹矣硅碎磅稻竭筑簧粱粹缸缺罕羔脯腥膊苟茵葫蔗藕蚌蝎蝗衫褒譬豌豺踊蹈辨逾邀醉陌陷雇雕髓黔默'
check_len__hz_sp_str(114, right_only__hzs_2143_vs_hzs_1869___114)

(common__hzs_2143_vs_hzs_1869___1755, _left_only__hzs_2143_vs_hzs_1869___388, _right_only__hzs_2143_vs_hzs_1869___114) = vs__hz_sp_str8set(unihan_kIICore_levelA_common_hz_str__U13_0___2143, cjk_common_subset_1869)
check_len__hz_sp_str(1755, common__hzs_2143_vs_hzs_1869___1755)
assert eq__hz_sp_str(left_only__hzs_2143_vs_hzs_1869___388, _left_only__hzs_2143_vs_hzs_1869___388)
assert eq__hz_sp_str(right_only__hzs_2143_vs_hzs_1869___114, _right_only__hzs_2143_vs_hzs_1869___114)






























unihan_kUnihanCore2020_common_hz_str__U13_0___2573 = """
一丁七万丈三上下
不丑且丕世丘丙丞
中串丸丹主乂乃久
之乍乎乏乖乘乙九
乞也乳乾了予事二
于云互五井些亡亢
交亥亦亨享京亭亮
亶人什仁仄仇今介
仍仔仕他仗付仙仝
仟代令以仰仲件价
任企伉伊伍伎伏伐
休伯伴伶伸伺似伽
佃但位低住佐佑何
余佚佛作佩佯佰佳
佶使侃侈例侍侏侑
侘供依侮侯侵便促
俄俊俎俑俗俚保俟
信修俯俱俳俵俸俺
倍倒候倚借倡倦倨
倪倬倭偃假偈偏偕
做停健偶傀傅傍催
傲像僖僚僧僭僻儒
儡兀允元兄充兆先
光克免兜兢入全八
公六兮共兵其具典
兼冀再冒冕冗冠冥
冬冶冷冽凄准凋凌
凝凡凰凶凸凹出函
刀刃分切刈刊刎刑
列初判利刮到制刷
券刺刻剃削剋剌前
剔剖剩剪副割剽剿
劈力功加劣助努劫
劾勃勇勉勍勒勘募
勤勺勾勿包匈匍匏
匐匕化北匙匠匡匣
匪匹匿十千升午卉
半卑卒卓南博卜卞
占卦卯印危卵卷卿
厄厘厚原厥去又叉
及友反叔取受叛口
古句叩只叫召叭可
台叱史右司吃各合
吉吊同名后吏吐向
君吝吟吠否吩含吸
吹吻吼吾呈告周呱
味呵呻呼命咀咆和
咎咐咨咫咬咳咸咽
哀品哄哈哉哥哨哭
哮哲哺唆唇唐唯唱
唾啄商啖啼喀善喇
喉喊喘喙喜喝喧嗅
嗔嗜嗟嗣嗤嗽嗾嘉
嘲嘴嘶器噫嚆嚼囊
囚四回因困囹固圃
圄圈土在圭地圻址
均坊坎坐坑坡坤坦
坪垂型垓垠垢垣埃
埋城域埠埴培基埼
堀堂堆堡堤堪堰堵
塑塔塘塞塾境墅墓
增墟墨壁壅壑壕壤
士壬壹夏夕外夙多
夜大天太夫夭央失
夷奄奇奈奉奎奏契
奔奕套奚奠奢女奴
奸好如妃妄妊妓妖
妙妥妨妹妻妾姆始
姐姑姓委姚姜姨姻
姿威娃娑娘娜娟娠
娥娩娶娼婆婉婚婢
媒媚媛嫁嫂嫉嫌嫡
嫦嫩嬉嬖孀子孑孔
孕字存孚孜孝孟季
孤孩孰孱孵孺宅宇
守安宋完宏宕宗官
宙定宛宜客宣室宥
宦宰害宴宵家宸容
宿寂寄寅密寇富寐
寒寓寞察寡寤寨寮
寸寺封射尉尊小少
尖尤尨就尸尹尺尻
尼尾尿局居屈屋屎
屑展屠履屯山屹岐
岑岩岫岬岱岳岷岸
峙峨峰峻崇崎崔崖
崩嵋嵌嵩嵬嵯嶝巍
川州巡巢工左巧巨
巫差己已巳巴巷巽
巾市布帆希帑帖帙
帛帝席常帽幄幅幌
幕幡幢干平年幸幻
幼幽庄庇床序底店
庚府庠度座庭庵庶
康庸廉廊廓廖廛延
廷建弁弄弊式弓引
弗弘弛弟弦弧弩弱
弼彖彗形彩彪彬彭
彰影彷役彼往征待
徇徊律後徐徒得徘
徙御徨循微徵德徽
心必忌忍忖志忘忙
忠快念忽忿怏怒怖
怜思怠怡急性怨怪
怯恁恂恃恍恐恕恙
恢恣恤恨恩恪恬恭
息恰悉悌悍悔悖悚
悛悟悠患悲悴悸悼
情惇惑惚惜惟惠惰
想惶惹惺愁愆愈愉
愍愎意愕愚感愧愿
慈慊慌慕慝慢慧慨
慰慷憎憔憧憩憬憺
憾懈懊懋懦懿戈戊
戌戍戎成我戒或戚
戟戡截戮戴房所扁
扇扈扉手才打托扮
扶批扼承技抄抉把
抑抒投抗折披抱抵
抹押抽拂拇拈拉拌
拍拐拒拓拔拗拘拙
招拜括拭拮拯拱拳
拷拾拿持指按挑挫
振挺挽捉捌捏捐捕
捧据捷捺捻授掉掌
排掖掘掠探接控推
掩措揄揆描提揖握
揭援揶搏搔搜搬搭
摘摩摸摺撒撞撤播
撮撰擅操擒擘擢擦
攀攘攫支收攸改攻
放政故效敏救敖敞
敢散敦敬敲整敷文
斌斐斑斗料斛斜斟
斡斤斥斧斫斯新方
於施旁旅旋旌族旒
旗日旦旨早旬旭旱
旺旻昆昇昊昌明昏
易昔星映春昧昨昭
是昴昶晁晃晏晞晟
晤晦晨普景晴晶智
暄暇暑暖暗暝暮暴
暹暾曙曜曝曦曰曲
曳更曷曹曼曾替最
月有朋服朔朕朗望
朝期朦木未末本札
朱朴机朽杆杉李杏
材村杓杖杜杞束杭
杯杰杳杵杷松板枇
枉枋析枕林枚果枝
枯枳架枷枸柄柏某
柑染柔柚柝柩柬柯
柱柳柴栓栖栗校株
核根格栽桀桁桂桃
案桎桐桑桓桔桶梁
梅梏梓梗梢梧梨梭
梯械梳梵棉棋棍棒
棕棘棚棠森棹棺椅
植椎椒椰椽椿楔楙
楚楞楠楫楮楯楷楸
楹榕榛榜榧榴榻槁
槃槌槐槽槿樊樗樟
模樵樽橄橘橙橡檀
檄檎檗欠次欣欲欺
款歇歌止正此步武
歪死殃殄殆殉殊殖
段殷殿毅毋母每毒
毓比毛毫氏民氓水
永氾汀汁求汐汕汗
汝汞江池汨汪汰汲
汽汾沁沂沃沈沌沐
沓沙沚沛沫沮河沸
油治沼沽沾沿泄泉
泊泌泓法泗泛泡波
泣泥注泯泰泳洋洌
洗洙洛洞津洪洲洵
洸活洽派流浙浚浣
浦浩浪浬浮浴海浸
涅消涉涌涎涓涕涯
液涵淀淅淆淇淋淑
淘淙淞淡淫淮深淳
混淹添渚渟渠渡渣
渤渥渫渭港渴游渺
湃湍湖湘湛湟湫湮
湲源溜溟溢溥溪溯
溶溺滂滉滋滑滓滔
滴漂漆漏演漕漠漫
漱潘潟潭潮潺潼澄
澎澳澹激濂濠濡濯
瀑瀚瀛灌火灰灸灼
炊炎炒炙炬炭炯炳
炸烈烙烝烹烽焉焙
焚焦焰然煌煎煤煦
照煮煽熄熊熏熔熙
熟熬熹燃燎燔燕燥
燧燮爆爪爬爰爵父
爻爽片版牌牒牙牛
牝牟牡牢牧物牲特
犀犁犬犯狂狄狎狐
狗狙狡狩狸狼猊猖
猛猜猝猥猩猷猾猿
獗玄率玉王玖玩玲
玳珀珂珊珍珞珠珥
珪班球琅理琉琢琥
琳琴琵琶瑁瑕瑙瑚
瑛瑜瑞瑟瑾璃璋璞
璧瓜瓠瓢瓣瓦瓮瓷
甄甑甘甚生甥甦用
甫甬田由甲申男甸
町界畏畔留畛畜略
畦番畸畿疆疋疏疑
疝疥疫疲疳疵疸疹
疼疽疾痂病症痍痒
痔痕痘痛痢痰痴痼
瘟瘠瘢瘤瘦癌癖癸
登白百的皆皇皎皓
皮皿盂盆盈益盒盛
盟目盲直相盾省眄
眈眉看眠眩眷眸眺
眼睛睡督睦睫睹睾
睿瞋瞑瞥瞬瞭瞰瞳
瞻瞿矗矛矜矢矣知
矩短矮石砂砒砥砦
砧破硅硝硫硬硼碇
碌碎碑碗碣碧磁磅
磊磋磐磨磬礁示社
祀祁祇祈祉祐祖祗
祚祝神祠祥票祭祺
禁福禧禳禹禽禾秀
私秉秋科秒秕秘租
秤秦秧秩移稀程稍
稔稗稙稚稠稷稻稼
稽稿穆穗穰穴究穹
空穿突窄窈窒窕窘
窟立站竟章竣童竭
端竹竺竿笏笑笙笛
笞笠符第等筋筌筏
筐筑筒答策筮筵箔
箕算箝管箭箱箴箸
篁篆篇簇簧簪簿籍
米粉粒粕粗粘粟粥
粱粲粳粹精糊糖糟
糠系紊素索紫累絮
繁纂纛缶缸缺罐罔
罕罪置署罹羊羌美
羔羚羞群羲羸羹羽
翁翅翊翌翔翕翠翡
翩翰翼耀老考者耆
而耐耕耗耘耳耶耽
耿聆聊聘聚聿肄肆
肇肉肋肌肖肛肝股
肢肥肩肪肯肱育肴
肺胃胄背胎胚胛胞
胡胤胥胱胴胸能脂
脆脊脩脯脾腋腐腑
腔腕腥腰腱腹腺腿
膀膈膊膏膜膝膣膨
膳膺臀臂臆臣臧自
臭至致臻臼臾舅舌
舍舒舛舜舞舟航舫
般舵舶舷船艇艮良
色艾芋芍芒芙芝芟
芥芬芭芯花芳芸芹
芽苑苒苔苗苛苞苟
苡若苦苧英茂范茄
茅茉茗茨茫茯茱茴
茵茶茸茹荀草荏荒
荷荻莉莎莞莪莫莽
菁菅菊菌菖菜菩菰
菱菲菽萃萄萌萍萎
萩萱萸落著葛葡董
葫葬葵葺蒐蒙蒜蒡
蒲蒸蒻蒿蓄蓉蓍蓑
蓬蓼蔑蔓蔗蔚蔡蔬
蔽蕃蕉蕨薄薇薛薨
薪薯薰藉藏藕藜藤
藩藻虎虐虔虞虹蚊
蚌蚓蚣蚤蚩蛇蛋蛔
蛙蛛蛟蛤蛭蛾蜀蜂
蜃蜈蜘蜚蜜蝎蝗蝴
蝶螂融螟螳螺蟠蟹
蟾蠢血行衍衒街衙
衡衢衣表衫衰衲衷
衾衿袁袂袈袋袍袒
袖袗被裁裂裔裕裙
裟裨裳裴裸褐褒褓
褥褪褶襁襄襟西要
覃覆角解言誓警譬
谷谿豁豆豌豕豚象
豪豫豹豺貂貊貌赤
赦赫走赳赴起超越
趣足趺趾跋跌跏跛
距跣跨路跳踊踏踞
踵蹂蹄蹇蹈蹉蹊蹙
蹴蹶躁躇身躬辛辜
辣辨辰辱迂迅迎近
返迦迪迫迭述迷追
退送逃逅逆逋逍透
逐逑途逗通逝逞速
造逡逢逮逵逸逼逾
遁遂遇遍遐遑道遣
遭遮遵遽避邀邂邃
邑那邦邪邯邱邵邸
郁郊郡部郭都鄂鄙
酉酊酋酌配酎酒酢
酩酪酬酵酷酸醇醉
醋醍醒醯醴醵采釉
里重野量釐金釜阜
阡阪阮防阻阿陀陂
附陋陌降限陛陞陟
院除陪陵陶陷隅隆
隋隍隔隘隙障隧雀
雁雄雅集雇雉雌雍
雎雕雨雪零雷雹需
霆震霓霖霜霞霰露
霹靖非靡面革靴靺
鞋鞍鞠鞨鞫鞭音韶
食餐首香馥馨骨骸
髓高鬼魁魂魃魄魅
魏魔鹿麒麓麝麟麴
麻麾黍黎黑黔默黛
黜鼎鼓鼠鼻
""" #""" unihan_kUnihanCore2020_common_hz_str__U13_0___2573

if __name__ == "__main__":
    check_len__hz_sp_str(2573, unihan_kUnihanCore2020_common_hz_str__U13_0___2573)

#bug: if 1:
#   import twice: one as __main__, another as hanzi
if 0b01 and __name__ == "__main__":
    _vs_
    _vss_('unihan_kUnihanCore2020_common_hz_str__U13_0___2573', '''
        cjk_common_subset_2513
        cjk_common_subset_1869
        unihan_kIICore_levelA_common_hz_str__U13_0___2143
        common__hzs_2143_vs_hzs_1869___1755
        ''')



left_only__hzs_2573_vs_hzs_2513___61='乂亶侘俱俵剋勍囊埼增尨巢徵德惇憺揭搔旻昇晞楙楯槃步每氾沚洸浬涉渟渴湲滉潟烝焰珪甦瘦瞋瞭祇祐稙脩苧萩蒐蒻薰衒袗谿釐陞靺鞨麴黑'
check_len__hz_sp_str(61, left_only__hzs_2573_vs_hzs_2513___61)
right_only__hzs_2573_vs_hzs_2513___1='寥'
check_len__hz_sp_str(1, right_only__hzs_2573_vs_hzs_2513___1)

(common__hzs_2573_vs_hzs_2513___2512, _left_only__hzs_2573_vs_hzs_2513___61, _right_only__hzs_2573_vs_hzs_2513___1) = vs__hz_sp_str8set(unihan_kUnihanCore2020_common_hz_str__U13_0___2573, cjk_common_subset_2513)
check_len__hz_sp_str(2512, common__hzs_2573_vs_hzs_2513___2512)
assert eq__hz_sp_str(left_only__hzs_2573_vs_hzs_2513___61, _left_only__hzs_2573_vs_hzs_2513___61)
assert eq__hz_sp_str(right_only__hzs_2573_vs_hzs_2513___1, _right_only__hzs_2573_vs_hzs_2513___1)



right_only__hzs_2573_vs_hzs_1869___1='寥'
check_len__hz_sp_str(1, right_only__hzs_2573_vs_hzs_1869___1)

(common__hzs_2573_vs_hzs_1869___1868, left_only__hzs_2573_vs_hzs_1869___705, _right_only__hzs_2573_vs_hzs_1869___1) = vs__hz_sp_str8set(unihan_kUnihanCore2020_common_hz_str__U13_0___2573, cjk_common_subset_1869)
check_len__hz_sp_str(1868, common__hzs_2573_vs_hzs_1869___1868)
check_len__hz_sp_str(705, left_only__hzs_2573_vs_hzs_1869___705)
assert eq__hz_sp_str(right_only__hzs_2573_vs_hzs_1869___1, _right_only__hzs_2573_vs_hzs_1869___1)



left_only__hzs_2573_vs_hzs_2143___436='万乂乘亢亶仗仝价伎佚佯佶侑侘俎俱俵倡倨倬偃假兢兮冗凄刈剔剩剿勍勺匍匏卷叭吊吩呱咐咨唇喇喙嗔嗽嗾嚆囊囹圄圻坎垓埴埼堀塞墅增壅娶嫂嬖孀孑孩孱孺宕宸寤尨尸尻岫岬嵋嵬嵯嶝巢巽帙幄幡庄床庠廛弁彖後徵德怏怜恁恂恙恤悌悚悛惇愆愍愎愿慊慝憺懊懋懦戡扼拂拈拔拜拯捌据捺揄揆揭揶搏搔搜擘擢攸斛斫旌旒旻昇昴昶晁晞晟暄暝暹暾曷机杆杓枉枋枳枷枸柝柬栖栗桀桁桎梏梭棕棹椽楙楮楯楸楹榧榻槁槃槿樗橄檎檗歇步殃殄毋每汞汨汾沓沚沾泓泛泯洌洙洵洸浬涅涉涕淀淅淙渟渣渫渴湟湫湮湲溟滉漕潟潼濂烝烽焰煦熏熬燔爰爻犁狸猊猝珂珞珥珪瑾璞瓠瓮甄甑甦甬町畛畿疋疳疸痂痍痒痴痼瘟瘠瘢瘦眄眈睹睾瞋矣砒砦硅硼碇碎碣磅磬祐禳秕稗稙稻穰窕竭笏笞筌筑筮箝箸篁簧簪粕粱粲粳粹纛缶缸缺罔罕羌羔羸翊翕肄胄胛脩脯腥膈膊膣膺臧臾舛艮芟苒苟苡苧茯茴茵莪菅菖菰菽萩萸葫葺蒐蒡蒻蒿蓍蓼蔗薨薰藕藜蚌蚣蚩蛔蜃蜈蝎蝗螟螳蟠蟾衒衢衫衲衾衿袒袗裨褒褓襁譬谿豌豕豺貊趺跏跛跣踊踞蹇蹈蹙蹴辨逋逑逡逾遐邀邃邯酎酢醉醍醯醴醵釐阡陂陌陞陟陷隍雇雎雕霓霰靺鞨鞫髓魃麴黑黔默黜'
check_len__hz_sp_str(436, left_only__hzs_2573_vs_hzs_2143___436)
right_only__hzs_2573_vs_hzs_2143___6='恒穀翟芷詹閒'
check_len__hz_sp_str(6, right_only__hzs_2573_vs_hzs_2143___6)

(common__hzs_2573_vs_hzs_2143___2137, _left_only__hzs_2573_vs_hzs_2143___436, _right_only__hzs_2573_vs_hzs_2143___6) = vs__hz_sp_str8set(unihan_kUnihanCore2020_common_hz_str__U13_0___2573, unihan_kIICore_levelA_common_hz_str__U13_0___2143)
check_len__hz_sp_str(2137, common__hzs_2573_vs_hzs_2143___2137)
assert eq__hz_sp_str(left_only__hzs_2573_vs_hzs_2143___436, _left_only__hzs_2573_vs_hzs_2143___436)
assert eq__hz_sp_str(right_only__hzs_2573_vs_hzs_2143___6, _right_only__hzs_2573_vs_hzs_2143___6)



right_only__hzs_2573_vs_hzs_1755___0=''
check_len__hz_sp_str(0, right_only__hzs_2573_vs_hzs_1755___0)

(common__hzs_2573_vs_hzs_1755___1755, left_only__hzs_2573_vs_hzs_1755___818, _right_only__hzs_2573_vs_hzs_1755___0) = vs__hz_sp_str8set(unihan_kUnihanCore2020_common_hz_str__U13_0___2573, common__hzs_2143_vs_hzs_1869___1755)
assert eq__hz_sp_str(common__hzs_2573_vs_hzs_1755___1755, common__hzs_2143_vs_hzs_1869___1755)
    #===
    #hzs_1755 = common__hzs_2143_vs_hzs_1869___1755 = common__hzs_2573_vs_hzs_1755___1755
    #common__hzs_2143_vs_hzs_1869___1755 |<=| unihan_kUnihanCore2020_common_hz_str__U13_0___2573
    #
check_len__hz_sp_str(1755, common__hzs_2573_vs_hzs_1755___1755)
check_len__hz_sp_str(818, left_only__hzs_2573_vs_hzs_1755___818)
assert eq__hz_sp_str(right_only__hzs_2573_vs_hzs_1755___0, _right_only__hzs_2573_vs_hzs_1755___0)









#common__hzs_2143_vs_hzs_1869___1755 |<=| unihan_kUnihanCore2020_common_hz_str__U13_0___2573
assert hz_sp_str2hz_set(common__hzs_2143_vs_hzs_1869___1755) < hz_sp_str2hz_set(unihan_kUnihanCore2020_common_hz_str__U13_0___2573)

#common__hzs_2143_vs_hzs_2513___2133 |<=| unihan_kUnihanCore2020_common_hz_str__U13_0___2573
assert hz_sp_str2hz_set(common__hzs_2143_vs_hzs_2513___2133) < hz_sp_str2hz_set(unihan_kUnihanCore2020_common_hz_str__U13_0___2573)



#$ factor 1755 2133
#1755: 3 3 3 5 13
#2133: 3 3 3 79
def _intersect_hzs_2573_vs_hzs_2143_vs_hzs_2513or1869():
    #common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133 = sorted_hz_str5set_intersect4hz_sp_strs_(unihan_kIICore_levelA_common_hz_str__U13_0___2143, unihan_kUnihanCore2020_common_hz_str__U13_0___2573, cjk_common_subset_2513)
    #common__hzs_2573_vs_hzs_2143_vs_hzs_1869___xxx = sorted_hz_str5set_intersect4hz_sp_strs_(unihan_kIICore_levelA_common_hz_str__U13_0___2143, unihan_kUnihanCore2020_common_hz_str__U13_0___2573, cjk_common_subset_1869)
    common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133 = sorted_hz_str5set_intersect4hz_sp_str(common__hzs_2573_vs_hzs_2143___2137, cjk_common_subset_2513)
    assert common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133 == common__hzs_2143_vs_hzs_2513___2133
    common__hzs_2573_vs_hzs_2143_vs_hzs_1869___1755 = sorted_hz_str5set_intersect4hz_sp_str(common__hzs_2573_vs_hzs_2143___2137, cjk_common_subset_1869)
    assert common__hzs_2573_vs_hzs_2143_vs_hzs_1869___1755 == common__hzs_2143_vs_hzs_1869___1755 == common__hzs_2573_vs_hzs_1755___1755

    #rint(common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133)
    #rint(len(common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133))
    return (common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133, common__hzs_2573_vs_hzs_2143_vs_hzs_1869___1755)
(common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133, common__hzs_2573_vs_hzs_2143_vs_hzs_1869___1755) = _intersect_hzs_2573_vs_hzs_2143_vs_hzs_2513or1869()
assert common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133 == common__hzs_2143_vs_hzs_2513___2133
assert common__hzs_2573_vs_hzs_2143_vs_hzs_1869___1755 == common__hzs_2143_vs_hzs_1869___1755 == common__hzs_2573_vs_hzs_1755___1755



# hzs_2133 =[def]= common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133
hzs_2133 = r"""
一丁七丈三上下不丑且丕世丘丙丞中
串丸丹主乃久之乍乎乏乖乙九乞也乳
乾了予事二于云互五井些亡交亥亦亨
享京亭亮人什仁仄仇今介仍仔仕他付
仙仟代令以仰仲件任企伉伊伍伏伐休
伯伴伶伸伺似伽佃但位低住佐佑何余
佛作佩佰佳使侃侈例侍侏供依侮侯侵
便促俄俊俑俗俚保俟信修俯俳俸俺倍
倒候倚借倦倪倭偈偏偕做停健偶傀傅
傍催傲像僖僚僧僭僻儒儡兀允元兄充
兆先光克免兜入全八公六共兵其具典
兼冀再冒冕冠冥冬冶冷冽准凋凌凝凡
凰凶凸凹出函刀刃分切刊刎刑列初判
利刮到制刷券刺刻剃削剌前剖剪副割
剽劈力功加劣助努劫劾勃勇勉勒勘募
勤勾勿包匈匐匕化北匙匠匡匣匪匹匿
十千升午卉半卑卒卓南博卜卞占卦卯
印危卵卿厄厘厚原厥去又叉及友反叔
取受叛口古句叩只叫召可台叱史右司
吃各合吉同名后吏吐向君吝吟吠否含
吸吹吻吼吾呈告周味呵呻呼命咀咆和
咎咫咬咳咸咽哀品哄哈哉哥哨哭哮哲
哺唆唐唯唱唾啄商啖啼喀善喉喊喘喜
喝喧嗅嗜嗟嗣嗤嘉嘲嘴嘶器噫嚼囚四
回因困固圃圈土在圭地址均坊坐坑坡
坤坦坪垂型垠垢垣埃埋城域埠培基堂
堆堡堤堪堰堵塑塔塘塾境墓墟墨壁壑
壕壤士壬壹夏夕外夙多夜大天太夫夭
央失夷奄奇奈奉奎奏契奔奕套奚奠奢
女奴奸好如妃妄妊妓妖妙妥妨妹妻妾
姆始姐姑姓委姚姜姨姻姿威娃娑娘娜
娟娠娥娩娼婆婉婚婢媒媚媛嫁嫉嫌嫡
嫦嫩嬉子孔孕字存孚孜孝孟季孤孰孵
宅宇守安宋完宏宗官宙定宛宜客宣室
宥宦宰害宴宵家容宿寂寄寅密寇富寐
寒寓寞察寡寨寮寸寺封射尉尊小少尖
尤就尹尺尼尾尿局居屈屋屎屑展屠履
屯山屹岐岑岩岱岳岷岸峙峨峰峻崇崎
崔崖崩嵌嵩巍川州巡工左巧巨巫差己
已巳巴巷巾市布帆希帑帖帛帝席常帽
幅幌幕幢干平年幸幻幼幽庇序底店庚
府度座庭庵庶康庸廉廊廓廖延廷建弄
弊式弓引弗弘弛弟弦弧弩弱弼彗形彩
彪彬彭彰影彷役彼往征待徇徊律徐徒
得徘徙御徨循微徽心必忌忍忖志忘忙
忠快念忽忿怒怖思怠怡急性怨怪怯恃
恍恐恕恢恣恨恩恪恬恭息恰悉悍悔悖
悟悠患悲悴悸悼情惑惚惜惟惠惰想惶
惹惺愁愈愉意愕愚感愧慈慌慕慢慧慨
慰慷憎憔憧憩憬憾懈懿戈戊戌戍戎成
我戒或戚戟截戮戴房所扁扇扈扉手才
打托扮扶批承技抄抉把抑抒投抗折披
抱抵抹押抽拇拉拌拍拐拒拓拗拘拙招
括拭拮拱拳拷拾拿持指按挑挫振挺挽
捉捏捐捕捧捷捻授掉掌排掖掘掠探接
控推掩措描提揖握援搬搭摘摩摸摺撒
撞撤播撮撰擅操擒擦攀攘攫支收改攻
放政故效敏救敖敞敢散敦敬敲整敷文
斌斐斑斗料斜斟斡斤斥斧斯新方於施
旁旅旋族旗日旦旨早旬旭旱旺昆昊昌
明昏易昔星映春昧昨昭是晃晏晤晦晨
普景晴晶智暇暑暖暗暮暴曙曜曝曦曰
曲曳更曹曼曾替最月有朋服朔朕朗望
朝期朦木未末本札朱朴朽杉李杏材村
杖杜杞束杭杯杰杳杵杷松板枇析枕林
枚果枝枯架柄柏某柑染柔柚柩柯柱柳
柴栓校株核根格栽桂桃案桐桑桓桔桶
梁梅梓梗梢梧梨梯械梳梵棉棋棍棒棘
棚棠森棺椅植椎椒椰椿楔楚楞楠楫楷
榕榛榜榴槌槐槽樊樟模樵樽橘橙橡檀
檄欠次欣欲欺款歌止正此武歪死殆殉
殊殖段殷殿毅母毒毓比毛毫氏民氓水
永汀汁求汐汕汗汝江池汪汰汲汽沁沂
沃沈沌沐沙沛沫沮河沸油治沼沽沿泄
泉泊泌法泗泡波泣泥注泰泳洋洗洛洞
津洪洲活洽派流浙浚浣浦浩浪浮浴海
浸消涌涎涓涯液涵淆淇淋淑淘淞淡淫
淮深淳混淹添渚渠渡渤渥渭港游渺湃
湍湖湘湛源溜溢溥溪溯溶溺滂滋滑滓
滔滴漂漆漏演漠漫漱潘潭潮潺澄澎澳
澹激濠濡濯瀑瀚瀛灌火灰灸灼炊炎炒
炙炬炭炯炳炸烈烙烹焉焙焚焦然煌煎
煤照煮煽熄熊熔熙熟熹燃燎燕燥燧燮
爆爪爬爵父爽片版牌牒牙牛牝牟牡牢
牧物牲特犀犬犯狂狄狎狐狗狙狡狩狼
猖猛猜猥猩猷猾猿獗玄率玉王玖玩玲
玳珀珊珍珠班球琅理琉琢琥琳琴琵琶
瑁瑕瑙瑚瑛瑜瑞瑟璃璋璧瓜瓢瓣瓦瓷
甘甚生甥用甫田由甲申男甸界畏畔留
畜略畦番畸疆疏疑疝疥疫疲疵疹疼疽
疾病症痔痕痘痛痢痰瘤癌癖癸登白百
的皆皇皎皓皮皿盂盆盈益盒盛盟目盲
直相盾省眉看眠眩眷眸眺眼睛睡督睦
睫睿瞑瞥瞬瞰瞳瞻瞿矗矛矜矢知矩短
矮石砂砥砧破硝硫硬碌碑碗碧磁磊磋
磐磨礁示社祀祁祈祉祖祗祚祝神祠祥
票祭祺禁福禧禹禽禾秀私秉秋科秒秘
租秤秦秧秩移稀程稍稔稚稠稷稼稽稿
穆穗穴究穹空穿突窄窈窒窘窟立站竟
章竣童端竹竺竿笑笙笛笠符第等筋筏
筐筒答策筵箔箕算管箭箱箴篆篇簇簿
籍米粉粒粗粘粟粥精糊糖糟糠系紊素
索紫累絮繁纂罐罪置署罹羊美羚羞群
羲羹羽翁翅翌翔翠翡翩翰翼耀老考者
耆而耐耕耗耘耳耶耽耿聆聊聘聚聿肆
肇肉肋肌肖肛肝股肢肥肩肪肯肱育肴
肺胃背胎胚胞胡胤胥胱胴胸能脂脆脊
脾腋腐腑腔腕腰腱腹腺腿膀膏膜膝膨
膳臀臂臆臣自臭至致臻臼舅舌舍舒舜
舞舟航舫般舵舶舷船艇良色艾芋芍芒
芙芝芥芬芭芯花芳芸芹芽苑苔苗苛苞
若苦英茂范茄茅茉茗茨茫茱茶茸茹荀
草荏荒荷荻莉莎莞莫莽菁菊菌菜菩菱
菲萃萄萌萍萎萱落著葛葡董葬葵蒙蒜
蒲蒸蓄蓉蓑蓬蔑蔓蔚蔡蔬蔽蕃蕉蕨薄
薇薛薪薯藉藏藤藩藻虎虐虔虞虹蚊蚓
蚤蛇蛋蛙蛛蛟蛤蛭蛾蜀蜂蜘蜚蜜蝴蝶
螂融螺蟹蠢血行衍街衙衡衣表衰衷袁
袂袈袋袍袖被裁裂裔裕裙裟裳裴裸褐
褥褪褶襄襟西要覃覆角解言誓警谷豁
豆豚象豪豫豹貂貌赤赦赫走赳赴起超
越趣足趾跋跌距跨路跳踏踵蹂蹄蹉蹊
蹶躁躇身躬辛辜辣辰辱迂迅迎近返迦
迪迫迭述迷追退送逃逅逆逍透逐途逗
通逝逞速造逢逮逵逸逼遁遂遇遍遑道
遣遭遮遵遽避邂邑那邦邪邱邵邸郁郊
郡部郭都鄂鄙酉酊酋酌配酒酩酪酬酵
酷酸醇醋醒采釉里重野量金釜阜阪阮
防阻阿陀附陋降限陛院除陪陵陶隅隆
隋隔隘隙障隧雀雁雄雅集雉雌雍雨雪
零雷雹需霆震霖霜霞露霹靖非靡面革
靴鞋鞍鞠鞭音韶食餐首香馥馨骨骸高
鬼魁魂魄魅魏魔鹿麒麓麝麟麻麾黍黎
黛鼎鼓鼠鼻
""" #""" hzs_2133

# hzs_1755 =[def]= common__hzs_2573_vs_hzs_2143_vs_hzs_1869___1755
hzs_1755 = r"""
一丁七丈三上下不丑且世丘丙中串丸
丹主乃久之乍乎乏乖乙九乞也乳乾了
予事二于云互五井些亡交亥亦享京亭
亮人什仁仇今介仍仔他付仙代令以仰
仲件任企伊伍伏伐休伯伴伶伸伺似佃
但位低住佐佑何余佛作佩佳使侈例侍
供依侮侯侵便促俄俊俗保信修俯俺倍
倒候倚借倦偏做停健偶傅傍催傲像僚
僧僻儒允元兄充兆先光克免兜入全八
公六共兵其具典兼冀再冒冠冬冶冷准
凌凝凡凰凶凸凹出函刀刃分切刊刑列
初判利刮到制刷券刺刻剃削前剖剪副
割劈力功加劣助努劫勃勇勉勒勘募勤
勾勿包匈化北匙匠匣匪匹匿十千升午
卉半卑卒卓南博卜占卯印危卵卿厘厚
原去又叉及友反叔取受叛口古句只叫
召可台史右司吃各合吉同名后吏吐向
君吝吟吠否含吸吹吻吼吾呈告周味呵
呻呼命和咬咳咸咽哀品哄哈哉哥哨哭
哮哲哺唆唐唯唱唾啄商啼善喉喊喘喜
喝喧嗅嗜嘉嘲嘴嘶器嚼囚四回因困固
圃圈土在地址均坊坐坑坡坤坦坪垂型
垢埃埋城域埠培基堂堆堡堤堪堰堵塑
塔塘境墓墟墨壁壤士壬壹夏夕外多夜
大天太夫央失夷奇奈奉奏契奔套奠奢
女奴奸好如妄妓妖妙妥妨妹妻姆始姐
姑姓委姚姜姨姻姿威娃娘娜娟娥婆婉
婚媒媚嫁嫉嫌嫩子孔孕字存孝孟季孤
孵宅宇守安宋完宏宗官宙定宛宜客宣
室宦宰害宴宵家容宿寂寄寅密寇富寒
寓寞察寡寨寸寺封射尉尊小少尖尤就
尺尼尾尿局居屈屋屎屑展屠履屯山屹
岩岳岸峨峰峻崇崎崔崖崩嵌巍川州巡
工左巧巨巫差己已巳巴巷巾市布帆希
帖帝席常帽幅幌幕幢干平年幸幻幼幽
庇序底店庚府度座庭庶康庸廉廊廓延
廷建弄弊式弓引弗弘弛弟弦弧弱形彩
彪彬彭彰影役彼往征待徊律徐徒得徘
御循微徽心必忌忍志忘忙忠快念忽忿
怒怖思怠急性怨怪怯恃恍恐恕恢恨恩
恬恭息恰悉悍悔悟悠患悲悼情惑惜惟
惠惰想惶惹愁愈愉意愚感愧慈慌慕慢
慧慨慰慷憎憾懈戈戊戌戎成我戒或戚
截戴房所扁扇手才打托扮扶批承技抄
把抑抒投抗折披抱抵抹押抽拇拉拌拍
拐拒拓拘拙招括拭拱拳拷拾拿持指按
挑挫振挺挽捉捏捐捕捧捷捻授掉掌排
掘掠探接控推掩措描提握援搬搭摘摩
摸撒撞撤播撮撰擅操擒擦攀支收改攻
放政故效敏救敞敢散敦敬敲整敷文斌
斑斗料斜斟斤斥斧斯新方施旁旅旋族
旗日旦旨早旬旭旱旺昆昌明昏易昔星
映春昧昨昭是晃晦晨普景晴晶智暇暑
暖暗暮暴曙曰曲更曹曼曾替最月有朋
服朗望朝期木未末本朱朴朽杉李杏材
村杖杜束杭杯杰松板析枕林枚果枝枯
架柄柏某柑染柔柱柳柴栓校株核根格
栽桂桃案桐桑桔桶梁梅梗梢梧梨梯械
梳棉棋棍棒棘棚棠森棺椅植椎椒椰椿
楚楷榜榴槐槽樟模橙橡檀欠次欣欲欺
款歌止正此武歪死殉殊殖段殷殿毅母
毒比毛毫氏民氓水永汁求汗汝江池汪
汰汽沁沃沈沙沛沫沮河沸油治沼沽沿
泄泉泊泌法泡波泣泥注泰泳洋洗洛洞
津洪洲活洽派流浙浦浩浪浮浴海浸消
涌涯液涵淆淋淑淘淡淫淮深淳混淹添
渠渡渤港游渺湃湖湘源溜溢溪溯溶溺
滋滑滔滴漂漆漏演漠漫漱潘潭潮澄澎
澳激瀑灌火灰灸灼炊炎炒炬炭炸烈烙
烹焉焚焦然煌煎煤照煮煽熄熊熔熙熟
燃燕燥爆爪爬爵父爽片版牌牙牛牡牢
牧物牲特犀犬犯狂狐狗狡狼猖猛猜猩
猾猿玄率玉王玖玩玲珊珍珠班球琅理
琉琢琳琴瑞瑟璃瓜瓢瓣瓦瓷甘甚生甥
用甫田由甲申男甸界畏畔留畜略番畸
疆疏疑疫疲疹疼疾病症痕痘痛痢痰瘤
癌癸登白百的皆皇皮皿盆盈益盒盛盟
目盲直相盾省眉看眠眷眼睛睡督睦睫
瞬瞳瞻矗矛矢知矩短矮石砂破硝硫硬
碌碑碗碧磁磨礁示社祈祖祝神祥票祭
禁福禹禽禾秀私秉秋科秒秘租秤秦秧
秩移稀程稍稚稠稼稽稿穆穗穴究空穿
突窄窒窘窟立站竟章竣童端竹竿笑笛
符第等筋筏筐筒答策箕算管箭箱篇簇
簿籍米粉粒粗粘粟粥精糊糖糟糠系紊
素索紫累絮繁罐罪置署羊美羚羞群羹
羽翁翅翔翠翰翼耀老考者而耐耕耗耘
耳耽耿聊聘聚肆肇肉肋肌肖肛肝股肢
肥肩肪肯育肺胃背胎胚胞胡胸能脂脆
脊脾腋腐腔腕腰腹腺腿膀膏膜膝膨臀
臂臣自臭至致臼舅舌舍舒舞舟航般舵
舶船艇良色艾芋芒芝芥芬芭芯花芳芹
芽苑苔苗苛苞若苦英茂范茄茅茫茶茸
草荒荷莉莫莽菊菌菜菩菱菲萄萌萍萎
落著葛葡董葬葵蒙蒜蒲蒸蓄蓉蓬蔑蔓
蔚蔡蔬蔽蕉薄薛薪薯藉藏藤藻虎虐虹
蚊蚤蛇蛋蛙蛛蛤蛾蜀蜂蜘蜜蝴蝶融螺
蟹蠢血行衍街衙衡衣表衰衷袁袋袍袖
被裁裂裕裙裳裸褐褥褪襟西要覆角解
言誓警谷豁豆象豪豫豹貌赤赦赫走赴
起超越趣足趾跋跌距跨路跳踏蹄躁身
躬辛辜辣辰辱迂迅迎近返迪迫迭述迷
追退送逃逆透逐途逗通逝逞速造逢逮
逸逼遂遇遍道遣遭遮遵避邑那邦邪郁
郊部郭都鄂鄙酉酌配酒酪酬酵酷酸醇
醋醒采里重野量金防阻阿附陋降限院
除陪陵陶隅隆隋隔隘隙障隧雀雁雄雅
集雌雨雪零雷雹需震霜霞露霹靖非靡
面革靴鞋鞍鞠鞭音食餐首香骨高鬼魁
魂魄魏魔鹿麻黎鼎鼓鼠鼻
""" #""" hzs_1755

assert hz_sp_str2hz_str(hzs_2133) == common__hzs_2573_vs_hzs_2143_vs_hzs_2513___2133 == common__hzs_2143_vs_hzs_2513___2133
assert hz_sp_str2hz_str(hzs_1755) == common__hzs_2573_vs_hzs_2143_vs_hzs_1869___1755 == common__hzs_2143_vs_hzs_1869___1755 == common__hzs_2573_vs_hzs_1755___1755



#上平15:东冬江支微鱼虞齐佳灰真文元寒删。
#下平15:先萧肴豪歌麻阳庚青蒸尤侵覃盐咸。
#上声29:董肿讲纸尾语麌荠蟹贿轸吻阮旱潸铣筱巧皓哿马养梗迥有寝感琰豏。
#去声30:送宋绛寘未御遇霁泰卦队震问愿翰谏霰啸效号个祃漾敬径宥沁勘艳陷。
#入声17:屋沃觉质物月曷黠屑药陌锡职缉合叶洽。

一百零六部平水韵韵目_上平15 = """
东冬江支微鱼虞齐佳灰真文元寒删
""" #"""
一百零六部平水韵韵目_下平15 = """
先萧肴豪歌麻阳庚青蒸尤侵覃盐咸
""" #"""
一百零六部平水韵韵目_上声29 = """
董肿讲纸尾语麌荠蟹贿轸吻阮旱潸铣筱巧皓哿马养梗迥有寝感琰豏
""" #"""
一百零六部平水韵韵目_去声30 = """
送宋绛寘未御遇霁泰卦队震问愿翰谏霰啸效号个祃漾敬径宥沁勘艳陷
""" #"""
一百零六部平水韵韵目_入声17 = """
屋沃觉质物月曷黠屑药陌锡职缉合叶洽
""" #"""
一百零六部平水韵韵目_上平15_下平15_上声29_去声30_入声17__106 = """
东冬江支微鱼虞齐佳灰真文元寒删
先萧肴豪歌麻阳庚青蒸尤侵覃盐咸
董肿讲纸尾语麌荠蟹贿轸吻阮旱潸铣筱巧皓哿马养梗迥有寝感琰豏
送宋绛寘未御遇霁泰卦队震问愿翰谏霰啸效号个祃漾敬径宥沁勘艳陷
屋沃觉质物月曷黠屑药陌锡职缉合叶洽
""" #"""
#虞:猜测/预料；忧虑/忧患；准备/防范；企望/期待；欺诈；惊；通『娱』；古代掌管山林川澤之官；古代一種祭祀名；朝代名:虞舜；古国名；姓。
#庚覃
#麌荠轸阮潸铣筱哿梗迥琰豏
#麌:yu3:群聚貌
#荠:ji4:荠菜；通“齏”，細切的鹹菜。ci2:茨，蒺藜；qi2:荸荠/bi2qi2
#潸:shan1:流泪；泪水。#潸然泪下
#阮:ruan3:商诸侯国名；乐器『阮咸』；姓。yuan2:汉置-古关名。
#铣:xian3:光澤度極好的金屬；小凿；古樂器鍾口的兩角；銑弓，弓的兩端用金裝飾者；铸铁/生铁。
#筱:xiao3:细竹；同『小』，专用于人名。
#哿:ge3:欢乐/可/嘉/快意愜心；通“珈”，古代婦女的首飾。
    #《詩‧小雅‧正月》：“哿矣富人，哀此惸獨。”
    #宋王安石《酬王詹叔訪茶法利害見寄》詩：“哿矣富阡陌，哀哉此無糗。”
    #漢揚雄《太玄‧瞢》：“男子折笄，婦人易哿。”
#梗概，梗直；迥然不同
#琰:yan3:有尖鋒的圭；美玉。
#豏:xian4:豆馅儿。

#绛寘霁霰祃漾宥
#绛:jiang4:深红色；染成绛色；草名，可染红；古地名。
#寘:zhi4:置:放置；处置；弃置；遗留；止息。tian2:填:窴:填塞；用于地名。
#霁:雨雪转晴；晴朗；怒气消散。
#霰:xian4:雪珠，白色不透明的球形或圓錐形小冰粒，多在下雪前或下雪時降落；san3:霰弹
#祃:ma4:古代在軍隊駐地舉行的祭禮。
    #顏師古注引應劭曰：“《詩》云：‘是類是禡。’禮，將征伐，告天而祭謂之類，告以事類也；至所征伐之地，表而祭之謂之禡。禡者，馬也。馬者，兵之首，故祭其先神也。”
    #《明史‧徐達傳》：“帥步騎二十五萬人，北取中原，太祖親禡於龍江。”
#荡漾yang4
#宥:you4:宽待；赦免；深邃；通（侑，囿，佑，右）；姓。


#黠缉洽
#黠:xia2:机敏；狡猾；坚，坚黑。
    #桀黠:桀:恶，黠:坚，为恶坚。
#缉拿
#缉:ji1:缉捕；qi1:缝纫方法，用相连的针脚密密地缝。
#缉:ji1/qi1:析麻捻接成线；搓捻；缝衣边；今亦指一種針腳細密相連的縫紉法；继续；聚集；『缉熙』光明；『缉缉』附耳私語聲，多形容花言巧語；搜捕。ji2通『辑』:(合):协调；收集；裁制；整治。
#融洽，洽谈
#洽qia4；he2:古水名





def filter_hzs_by_(hz_set, hzs, /):
    hz_set = frozenset(hz_set)
    s = ''.join(hz for hz in hzs if hz in hz_set)
    return s
def 囗修正简繁字对集后囗副作用囗平凡自反共享汉字增加囗():
    from nn_ns.CJK.CJK_data.汉字繁简 import 简繁字对集
    from nn_ns.CJK.cjk_subsets.hanzi import cjk_common_subset_2513_trivial_TS_2227, cjk_common_subset_2513
    from nn_ns.CJK.cjk_subsets.hanzi import cjk_common_subset_1869_trivial_TS_1631, cjk_common_subset_1869
    #deprecated:from nn_ns.CJK.CJK_data.汉字繁简囗囗平凡自反囗唯一可逆 import 汉字列表囗繁简囗平凡自反, 繁简字对列表囗繁简囗唯一可逆
    from nn_ns.CJK.CJK_data.汉字繁简囗囗平凡自反囗唯一可逆囗囗打完补丁囗简繁字对囗补丁囗㝉宁相关 import 汉字列表囗繁简囗平凡自反, 繁简字对列表囗繁简囗唯一可逆
    assert set(cjk_common_subset_2513_trivial_TS_2227) < set(汉字列表囗繁简囗平凡自反)

    cjk_common_subset_2513_trivial_TS_2230 = filter_hzs_by_(汉字列表囗繁简囗平凡自反, cjk_common_subset_2513)
    assert {*cjk_common_subset_2513_trivial_TS_2227} ^ {*cjk_common_subset_2513_trivial_TS_2230} == {'珊', '淙', '瑙'} == {*cjk_common_subset_2513_trivial_TS_2230} - {*cjk_common_subset_2513_trivial_TS_2227}
    assert len(cjk_common_subset_2513_trivial_TS_2230) == 2230
    #return cjk_common_subset_2513_trivial_TS_2230

    cjk_common_subset_1869_trivial_TS_1632 = filter_hzs_by_(汉字列表囗繁简囗平凡自反, cjk_common_subset_1869)
    assert {*cjk_common_subset_1869_trivial_TS_1631} ^ {*cjk_common_subset_1869_trivial_TS_1632} == {'珊'} == {*cjk_common_subset_1869_trivial_TS_1632} - {*cjk_common_subset_1869_trivial_TS_1631}
    assert len(cjk_common_subset_1869_trivial_TS_1632) == 1632
    return cjk_common_subset_2513_trivial_TS_2230, cjk_common_subset_1869_trivial_TS_1632
if __name__ == "__main__":
    cjk_common_subset_2513_trivial_TS_2230, cjk_common_subset_1869_trivial_TS_1632 = 囗修正简繁字对集后囗副作用囗平凡自反共享汉字增加囗()
    print('cjk_common_subset_2513_trivial_TS_2230')
    if 0b0:print(cjk_common_subset_2513_trivial_TS_2230)
    print('cjk_common_subset_1869_trivial_TS_1632')
    if 0b0:print(cjk_common_subset_1869_trivial_TS_1632)

#汉字列表囗繁简囗平凡自反 /-\ cjk_common_subset_2513 =>
cjk_common_subset_2513_trivial_TS_2230 = """
一丁七丈上下不且
丕世丘丙丞中串丸
丹主久之乍乎乏乖
乙九乞也乳予事二
互五井些亡亢交亥
亦亨享京亭亮人什
仁仄今介仍仔仕仗
付仟代令以仰仲件
任企伉伊伍伎伏伐
休伯伴伶伸伺似伽
佃但位低住佐何佚
作佯佰佳佶使侃侈
例侍侏侑供依侮侯
侵便促俄俊俎俑俗
俚保俟信俳俸俺倍
倒候倚倡倦倨倪倬
倭偃假偈偏偕做停
健偶傀傅傍催傲僖
僚僧僭僻儒儡兀允
元兄充兆先光免兜
兢入全八公六兮共
兵其具典兼冀再冒
冕冗冠冥冶冷冽凝
凡凰凸凹函刀刃分
切刈刊刎刑列初判
利到刷券刺刻削剌
前剔剖剪副割剽力
功加劣努劾勃勇勉
勒勘募勺勾勿包匈
匍匏匐匕化北匙匠
匣匪匿十午卉半卑
卒卓南博卞卦卯印
危卵卿厚厥去又叉
及友反叔取受叛口
古句叩叫召叭可叱
史右司各吉名吏吐
君吝吟吠否吩含吸
吹吻吼吾呈告味呻
命咀咆咎咐咫咬咳
哀品哈哉哥哨哭哮
哺唆唐唯唱唾啄商
啼喀善喇喉喊喘喙
喜喝嗅嗜嗟嗣嗤嗽
嗾嘉嘲嘴嘶器噫嚆
嚼囚四因囹固圃圄
土在地圻均坊坎坐
坡坦坪垂型垓垠垢
垣埃埋城域埠埴培
基堀堂堆堡堪堰堵
塑塔塘塞塾境墅墓
墟墨壁壅壑壕壤士
壬壹夏夕外夙多夜
大天太央失夷奄奇
奈奉奎奏契奕套奚
奠奢女奴好如妃妄
妓妖妙妥妨妹妻妾
姆始姐姑姓委姚姨
姻姿威娃娑娜娟娠
娥娩娶娼婆婉婚婢
媒媚媛嫁嫂嫉嫌嫡
嫦嫩嬉嬖孀子孑孔
孕字存孚孜孝孟季
孤孩孰孱孵孺宅宇
守安宋完宏宕宗官
宙定宛宜客宣室宥
宦宰害宵宸容宿寂
寄寅密寇富寐寒寓
寞察寡寤寥寨寮寺
封射尉尊小少尖尤
就尹尻尼尾尿居屈
屋屎屑展屠履屯山
屹岐岑岫岬岱岷岸
峙峰峻崇崔崖崩嵋
嵌嵬嵯嶝巍川州巡
工左巧巫差己已巳
巴巷巽巾市帆希帑
帖帙帛帝常帽幄幅
幌幕平年幻幼幽庇
序底店庚府庠度座
庭庶康庸廉廊廓廖
廛延廷建弁弄弊式
弓引弗弘弛弟弧弩
弱弼彖形彪彬彭彰
影役彼往待徇徊律
徐徒得徘徙徨循微
徽心必忌忍忖忘忙
忠快忽忿怏怒怖思
怠怡急性怨怪怯恁
恂恃恍恐恕恙恢恣
恨恩恪恬恭息恰悉
悌悍悔悖悚悛悟悠
患悲悴悸悼情惑惚
惜惟惰想惶惹惺愁
愆愉愎意愕愚感慈
慊慌慕慝慢慧慨慰
慷憎憔憧憩憬憾懈
懊懋懦懿戈戊戌戍
戎成我戒或戟戡截
戮戴房所扁扇扈扉
手打扮扶批扼承技
抉把抑抒投抗披抱
抹押抽拇拉拌拍拒
拔拗拘拙招括拭拮
拯拱拳拷拾拿持指
按挑挫振挺捉捌捏
捐捕捧捷捺授掉掌
排掖掘掠探接控推
掩措揄揆描提揖握
援揶搏搬搭摘摩摸
撒撞撤播撮撰擅操
擒擘擢擦攀攘攫支
收攸改攻放政故敏
救敖敞敢散敦敬敲
整敷文斌斐斑料斛
斜斟斡斥斧斫斯新
方施旁旅旌族旒日
旦旨早旬旭旱旺昊
昌明昏易昔星映春
昧昨昭是昴昶晁晃
晏晟晤晦晨普景晴
晶智暄暇暑暝暮暴
暹暾曙曜曝曦曰曳
更曷曹曼曾替最月
有朋服朔朕朗望朝
期朦木未末本朽杉
李杏材杓杖杜杞束
杭杳杵杷枇枉枋析
枕林枚枝枯架枷枸
柄柏某柑染柔柚柝
柩柬柯柱柳柴栓校
株根格栽桀桁桂桃
桎桐桑桓桔桶梅梏
梓梗梢梧梨梭梯械
梳梵棉棍棒棕棘棚
棠森棺椅植椎椒椰
椽椿楔楚楠楫楮楷
楸楹榕榛榜榧榴榻
槌槐槽槿樊樗樟樵
樽橄橘橙橡檀檄檎
檗欠次欺款歇歌止
正此武歪死殃殄殆
殉殊殖段殿毅母毒
毓比毛毫氏民氓水
永汀汁求汐汕汗汝
汞江池汨汪汰汲汽
汾沁沂沃沌沐沙沛
沫沮河沸油治沼沽
沿泉泊泌泓法泗泡
波泣泥泯泰泳洋洌
洗洙洛洞津洪洲洵
活洽派流浙浣浦浪
浮浴海浸涅消涎涓
涕涯液涵淅淆淇淑
淘淙淞淮深淳淹添
渚渠渡渣渤渥渫渭
港湃湍湖湘湛湟湫
湮源溟溢溥溯溶溺
滂滋滑滓滔滴漂漆
漏漕漠漫漱潘潭潮
潺潼澎澳激濂濠濡
濯瀑瀚瀛火灰灸灼
炊炎炒炙炬炭炯炳
炸烈烙烹烽焉焙焚
焦然煌煎煤煦煮煽
熄熊熔熙熟熬熹燃
燎燔燥燧燮爆爪爬
爰爵父爻爽片版牌
牒牙牛牝牟牡牢牧
物牲特犀犁犯狂狄
狎狐狗狙狡狩狼猊
猖猜猝猥猩猷猾猿
獗玄率玉王玖玩玲
玳珀珂珊珍珞珠珥
班理琉琢琥琳琴琵
琶瑁瑕瑙瑚瑛瑜瑞
瑟瑾璋璞璧瓜瓠瓢
瓣瓦瓷甄甑甘甚生
甥用甫甬田由甲申
男甸町界畏畔畛畜
略畦番畸畿疆疏疑
疝疥疫疲疳疵疸疹
疼疽疾痂病痍痔痕
痘痛痢痰痼瘟瘠瘢
瘤癌癖癸登白百的
皆皇皎皓皮皿盂盆
盈益盒盛盟目盲直
相盾省眄眈眉看眠
眩眷眸眼睛睡督睦
睫睹睿瞑瞥瞬瞰瞳
瞻瞿矗矛矜矢矣知
矩短矮石砂砒砥砦
砧破硝硫硬硼碇碌
碎碑碗碣碧磁磅磊
磋磨磬礁示社祀祁
祈祉祖祚祝神祠祥
票祭祺禁福禧禳禹
禽禾秀私秉科秒秕
租秤秦秧秩稀程稍
稔稗稚稠稷稼稽稿
穆穰穴究穹空穿突
窄窈窒窕窘窟立站
竟章竣童竭竹竺竿
笏笑笙笛笞笠符第
等筌筏筐筒策筮筵
箔箕算箭箱箴箸篁
篆篇簇簧簿籍米粉
粒粕粘粟粥粱粲粳
粹精糖糠紊素索紫
絮繁纂纛缶缸缺罔
罕罪置署罹羊羌美
羔羚羞群羲羸羹羽
翁翅翊翌翔翕翠翡
翩翰翼老者耆而耐
耕耗耘耳耶耽耿聆
聊聘聚聿肄肆肇肉
肋肌肖肛肝股肢肥
肩肪肯肱育肺胃胎
胚胛胞胤胥胱胴胸
能脂脆脯脾腋腐腑
腔腕腰腱腹腺腿膀
膈膊膏膜膝膣膨膳
膺臀臂臆臣臧自臭
至臻臼臾舅舌舒舛
舜舞舟航舫般舵舶
舷船艇艮良色艾芋
芍芒芙芝芟芥芬芭
芯花芳芹芽苑苒苔
苗苛苞苡若苦英茂
茄茅茉茗茨茫茯茱
茴茵茶茸茹荀草荏
荒荷荻莉莎莞莪莫
莽菁菅菊菌菖菜菩
菲菽萃萄萌萍萎萱
萸落葛葡董葫葬葵
葺蒜蒡蒲蒸蒿蓄蓉
蓍蓬蓼蔓蔗蔚蔡蔬
蔽蕃蕉蕨薄薇薛薨
薪藏藕藜藩藻虎虐
虔虞虹蚊蚌蚓蚣蚤
蚩蛇蛋蛙蛛蛟蛤蛭
蛾蜀蜂蜃蜈蜘蜚蜜
蝗蝴蝶螂融螟螳螺
蟠蟹蟾蠢血行衍街
衙衡衢衣衫衰衲衷
衾衿袁袂袈袋袍袒
袖被裁裂裔裕裙裟
裨裳裴裸褐褒褓褥
褪褶襄襟西要覃角
解言誓警譬豁豌豕
豚豪豫豹豺貂貊貌
赤赦赫走赳赴起超
越趣足趺趾跋跌跏
跛距跣跨路跳踏踞
踵蹂蹄蹇蹈蹉蹊蹙
蹴蹶躁躇身躬辛辜
辣辨辰辱迂迅近返
迦迪迫述迷追送逃
逅逆逋逍透逐逑途
逗通逝逞速造逡逢
逮逵逸逼遁遂遇遍
遐遑道遣遭遮遵遽
避邀邂邃邑那邦邪
邯邱邵邸郊郡部郭
都鄂鄙酉酊酋酌配
酎酒酢酩酪酵酷醇
醉醋醍醒醴醵釉重
野量金釜阜阡阮防
阻阿陀陂附陋陌降
限陛陟院除陪陵陶
隅隆隋隍隔隘隙障
隧雀雁雄雅集雉雌
雍雎雨雪零雷雹需
霆震霓霖霜霞霰露
霹靖非靡革靴鞋鞍
鞠鞫鞭音韶食餐首
香馥馨骨骸髓高鬼
魁魂魃魄魅魏魔鹿
麒麓麝麟麾黍黎黔
默黛黜鼎鼓鼻
""" #""" cjk_common_subset_2513_trivial_TS_2230
#汉字列表囗繁简囗平凡自反 /-\ cjk_common_subset_1869 =>
cjk_common_subset_1869_trivial_TS_1632 = """
一丁七丈上下不且
世丘丙中串丸丹主
久之乍乎乏乖乙九
乞也乳予事二互五
井些亡亢交亥亦享
京亭亮人什仁今介
仍仔仗付代令以仰
仲件任企伊伍伏伐
休伯伴伶伸伺似佃
但位低住佐何作佳
使侈例侍供依侮侯
侵便促俄俊俗保信
俺倍倒候倚倡倦假
偏做停健偶傅傍催
傲僚僧僻儒允元兄
充兆先光免兜兢入
全八公六共兵其具
典兼冀再冒冗冠冶
冷凝凡凰凸凹函刀
刃分切刊刑列初判
利到刷券刺刻削前
剔剖剪副割力功加
劣努勃勇勉勒勘募
勺勾勿包匈化北匙
匠匣匪匿十午卉半
卑卒卓南博卯印危
卵卿厚去又叉及友
反叔取受叛口古句
叫召叭可史右司各
吉名吏吐君吝吟吠
否吩含吸吹吻吼吾
呈告味呻命咐咬咳
哀品哈哉哥哨哭哮
哺唆唐唯唱唾啄商
啼善喇喉喊喘喜喝
嗅嗜嗽嘉嘲嘴嘶器
嚼囚四因固圃土在
地均坊坎坐坡坦坪
垂型垢埃埋城域埠
培基堂堆堡堪堰堵
塑塔塘塞境墅墓墟
墨壁壤士壬壹夏夕
外多夜大天太央失
夷奇奈奉奏契套奠
奢女奴好如妄妓妖
妙妥妨妹妻姆始姐
姑姓委姚姨姻姿威
娃娜娟娥娶婆婉婚
媒媚嫁嫂嫉嫌嫩子
孔孕字存孝孟季孤
孩孵宅宇守安宋完
宏宗官宙定宛宜客
宣室宦宰害宵容宿
寂寄寅密寇富寒寓
寞察寡寥寨寺封射
尉尊小少尖尤就尼
尾尿居屈屋屎屑展
屠履屯山屹岸峰峻
崇崔崖崩嵌巍川州
巡工左巧巫差己已
巳巴巷巾市帆希帖
帝常帽幅幌幕平年
幻幼幽庇序底店庚
府度座庭庶康庸廉
廊廓延廷建弄弊式
弓引弗弘弛弟弧弱
形彪彬彭彰影役彼
往待徊律徐徒得徘
循微徽心必忌忍忘
忙忠快忽忿怒怖思
怠急性怨怪怯恃恍
恐恕恢恨恩恬恭息
恰悉悍悔悟悠患悲
悼情惑惜惟惰想惶
惹愁愉意愚感慈慌
慕慢慧慨慰慷憎憾
懈懊懦戈戊戌戎成
我戒或截戴房所扁
扇手打扮扶批扼承
技把抑抒投抗披抱
抹押抽拇拉拌拍拒
拔拘拙招括拭拯拱
拳拷拾拿持指按挑
挫振挺捉捌捏捐捕
捧捷授掉掌排掘掠
探接控推掩措描提
握援搏搬搭摘摩摸
撒撞撤播撮撰擅操
擒擦攀支收改攻放
政故敏救敞敢散敦
敬敲整敷文斌斑料
斜斟斥斧斯新方施
旁旅族日旦旨早旬
旭旱旺昌明昏易昔
星映春昧昨昭是晃
晦晨普景晴晶智暇
暑暮暴曙曰更曹曼
曾替最月有朋服朗
望朝期木未末本朽
杉李杏材杖杜束杭
枉析枕林枚枝枯架
柄柏某柑染柔柬柱
柳柴栓校株根格栽
桂桃桐桑桔桶梅梗
梢梧梨梭梯械梳棉
棍棒棕棘棚棠森棺
椅植椎椒椰椿楚楷
榜榴槐槽樟橙橡檀
欠次欺款歇歌止正
此武歪死殃殉殊殖
段殿毅母毒比毛毫
氏民氓水永汁求汗
汝汞江池汪汰汽沁
沃沙沛沫沮河沸油
治沼沽沿泉泊泌法
泡波泣泥泰泳洋洗
洛洞津洪洲活洽派
流浙浦浪浮浴海浸
消涕涯液涵淆淑淘
淮深淳淹添渠渡渣
渤港湃湖湘源溢溯
溶溺滋滑滔滴漂漆
漏漠漫漱潘潭潮澎
澳激瀑火灰灸灼炊
炎炒炬炭炸烈烙烹
焉焚焦然煌煎煤煮
煽熄熊熔熙熟熬燃
燥爆爪爬爵父爽片
版牌牙牛牡牢牧物
牲特犀犁犯狂狐狗
狡狼猖猜猩猾猿玄
率玉王玖玩玲珊珍
珠班理琉琢琳琴瑞
瑟瓜瓢瓣瓦瓷甘甚
生甥用甫田由甲申
男甸界畏畔畜略番
畸疆疏疑疫疲疹疼
疾病痕痘痛痢痰瘟
瘤癌癸登白百的皆
皇皮皿盆盈益盒盛
盟目盲直相盾省眉
看眠眷眼睛睡督睦
睫睹瞬瞳瞻矗矛矢
矣知矩短矮石砂破
硝硫硬碌碎碑碗碧
磁磅磨礁示社祈祖
祝神祥票祭禁福禹
禽禾秀私秉科秒租
秤秦秧秩稀程稍稚
稠稼稽稿穆穴究空
穿突窄窒窘窟立站
竟章竣童竭竹竿笑
笛符第等筏筐筒策
箕算箭箱篇簇簧簿
籍米粉粒粘粟粥粱
粹精糖糠紊素索紫
絮繁缸缺罕罪置署
羊美羔羚羞群羹羽
翁翅翔翠翰翼老者
而耐耕耗耘耳耽耿
聊聘聚肆肇肉肋肌
肖肛肝股肢肥肩肪
肯育肺胃胎胚胞胸
能脂脆脯脾腋腐腔
腕腰腹腺腿膀膊膏
膜膝膨臀臂臣自臭
至臼舅舌舒舞舟航
般舵舶船艇良色艾
芋芒芝芥芬芭芯花
芳芹芽苑苔苗苛苞
若苦英茂茄茅茫茵
茶茸草荒荷莉莫莽
菊菌菜菩菲萄萌萍
萎落葛葡董葫葬葵
蒜蒲蒸蓄蓉蓬蔓蔗
蔚蔡蔬蔽蕉薄薛薪
藏藕藻虎虐虹蚊蚌
蚤蛇蛋蛙蛛蛤蛾蜀
蜂蜘蜜蝗蝴蝶融螺
蟹蠢血行衍街衙衡
衣衫衰衷袁袋袍袖
被裁裂裕裙裳裸褐
褒褥褪襟西要角解
言誓警譬豁豌豪豫
豹豺貌赤赦赫走赴
起超越趣足趾跋跌
距跨路跳踏蹄蹈躁
身躬辛辜辣辨辰辱
迂迅近返迪迫述迷
追送逃逆透逐途逗
通逝逞速造逢逮逸
逼遂遇遍道遣遭遮
遵避邀邑那邦邪郊
部郭都鄂鄙酉酌配
酒酪酵酷醇醉醋醒
重野量金防阻阿附
陋陌降限院除陪陵
陶隅隆隋隔隘隙障
隧雀雁雄雅集雌雨
雪零雷雹需震霜霞
露霹靖非靡革靴鞋
鞍鞠鞭音食餐首香
骨髓高鬼魁魂魄魏
魔鹿黎黔默鼎鼓鼻
""" #""" cjk_common_subset_1869_trivial_TS_1632









#view ../../python3_src/nn_ns/CJK/cjk_subsets/cjk_subsets__TS.py
#view ../../python3_src/nn_ns/CJK/cjk_subsets/cjk_subsets__TS____output.py

from nn_ns.CJK.cjk_subsets.cjk_subsets__TS____output import 文本纟繁简字对列表牜繁简唯一可逆牜基位面冫一臸龥牜过滤冫汉字相关基础编码_943繁简字对_1886, 文本纟繁简字对列表牜繁简唯一可逆牜基位面冫一臸龥_1959繁简字对_3918, 文本纟汉字列表牜繁简平凡自反牜基位面冫一臸龥牜过滤冫汉字相关基础编码_2230, 文本纟汉字列表牜繁简平凡自反牜基位面冫一臸龥_14428


from nn_ns.CJK.cjk_subsets.cjk_subsets__TS____output import hzTSpairs__hit_encodings_big5_cp949_gb2312_iso2022_jp__1886, hzTSpairs__hit_region_ge4E00_le9FA5_20902__3918, cjk_common_region_of_encodings_big5_cp949_gb2312_iso2022_jp__trivial_TS__2230, cjk_region_ge4E00_le9FA5_20902__trivial_TS__14428


















#view ../../python3_src/nn_ns/CJK/cjk_subsets/收集冫共享汉字纟所有汉字编码牜允许简繁体分隔两地-20241213.py
#   5455 # cjk_common_subset_TS_covered_extension_5455/共享汉字字集牜简繁覆盖扩增
#       + 2513 # cjk_common_subset_2513/共享汉字字集
#       + 2942 # cjk_TS_covered_extension_of_cjk_common_subset_2942/简繁覆盖扩增字集纟共享汉字字集

cjk_TS_covered_extension_of_cjk_common_subset_2942 = 简繁覆盖扩增字集纟共享汉字字集 = """
与专业丛东丝两严丧个临丽义乌乐乔
乗习书买乱亂争亏亘亙亚亞亩亲亵亿
仅仆从仑仓仪们仿伕优会伞伟传伤伦
伫佇佈体佔佣佥侄來侖侠価侣侥侦侧
侨侶侷係俞俠俨俩俪俭倆倉個們倖倣
倫债倾偉側偵偷偸偿傑傘備傚傢储傩
傭傳債傷傾僅僉僊僑僕僥僱價儀億儉
償優儲儷儺儼儿兇兌兎兑兒兔党內兩
兪兰关兴养兽内冈冊册冑写军农冢冪
冯冲决况冻净凉凍减凑凖凛凜几凤凫
凭凯凱凿刍划刘则刚创删別刧刪别刹
剂則剋剎剑剛剝剥剧剰創劃劄劇劉劍
劑劝务动励劲劳劻势勁勋動勖勗務勝
勞勢勣勦勳勵勸匯区医區华协協单卖
卢卤卧卫即却卹卻卽厂厅压厌厢厦厨
厭县参參双发变叠叢叶号叹吋吒吕吞
听呂呎呑呕呗员呜咏咚咤响哗員唄唤
唸問啗啣啬啮啸喆喚喦喪喫喬單喷嗇
嗚嘆嘔嘗嘘嘯嘱噓噴嚥嚮嚯嚴囑囘团
园围国图圆國圍圏園圓圖團圣圹场坏
块坚坛坞坟坠垄垅垒垦垩埰執埼堅堊
堑堕堯報場塊塋塗塚塡塢填塵塹増墙
墜增墮墳墾壇壓壘壙壞壟壮壯声壳壶
壺壽处备复夢头夸夹夺夾奂奋奐奥奧
奪奮妇姙姦姪娄娇婁婦婬婵媿嫔嬋嬌
嬢嬪孃孙学孫學宁宝实宠审宪宫宮宾
寀寝寢實寧審寫寵寶对寻导寿尅将將
專尋對導尔尘尙尚尝尧尽层屆届屍屏
屛属屡屢層屬屿岂岖岗岚岛岡岭峡峦
峩島峽崑崗崙崧嵐嵒嶇嶺嶼嶽巌巒巖
巢巣巩巻币帅师帐帘帜帥带帧師帳帶
幀幂幟幣并幹幾广庆庐库应庙废庫廂
廈廚廟廠廢廣廬廳廻廼开异弃弑弒弔
张弥弯張強弹强彈彊彌彎归当彙彥彦
彫彻彿径徑徕從徠復徬徳徴徵德徹徼
忆忏忧忾怀态怂怃怆总恆恋恒恥恳恵
恶恸恻恼恿悅悦悬悯悶悽惊惡惧惨惩
惫惮惯惱惻愛愤愴愼愾慂慄慇態慎慘
慟慣慫慮慶慼慾憂憊憐憑憚憤憫憮憲
憶懃懇應懒懞懲懶懷懸懺懼戀战戰扎
扑払执扩扫扬扰抚抛护报抬担拋拝拟
拣拥拨择挂挚挛挞挟挠挥挶挾捆捞损
换捣捨捲掃掛採掷揀揚換揮揹揽搅損
搖搗搨携搾摄摆摇摯撈撓撚撥撫撲撻
擁擇擔據擡擬擲擴擺擾攜攝攣攪攬攷
敌敎敗教敛数敵數斂斃斋斩斬断斷旂
旛无旧时旷昇昙昼显時晉晋晓晔晕晖
晝暂暈暉暢暧暫曄曇曉曏曖曠書會朧
朮术朵朶杀杂权条来杨杪東极构枢枣
枪枫枭枴柜柵柺栀栅标栈栉栋栏树样
栾桡桥桦桧桿梔條梟梦梱检棄棌棗棟
棧棱棲椁楊楓業極楼概榄榈榖榦榨榮
槃構槍槛槟槨槪樂樑樓標樞樣横樯樱
樴樸樹樺橈橋機橦橫橹檜檢檣檯檳檻
櫂櫃櫓櫚櫛櫱櫻欄權欒欖欢欤欧欽歎
歐歟歡歸歼歿殀殁残殒殘殞殡殯殲殴
殺殼毀毁毆毌毎每毕毙毡毬氈气氣氾
汇汉汎汚污汤汹決沉沒沖沟没沥沦沧
況泪泷泸泻泽洁洒洩洶洼浃浅浆浊测
济浏浑浒浓浹涂涉涛涟涡涣涤润涧涨
涼淒淚淨淩淪淵淸淺清渉渊渍渐渔渖
渗渙減渦温測渾湊湣湧湯湾湿溃溉準
溝溫滄滅滌滚滞满滤滥滨滩滯滲滸滾
滿漁漑漢漣漤漬漲漸漿潁潅潇潔潛潜
潟潤潰澂澔澗澜澤澱濁濃濒濕濛濟濤
濫濬濱濾瀉瀋瀏瀕瀘瀝瀟瀧瀾灑灘灣
灭灯灵災灾灿炀炉炖炤炫炮点炼炽烂
烏烛烟烦烧烬热焔焕無焰煉煖煙煥煩
煬熱熾燈燉燐燒營燦燬燭燻燼燿爐爛
爭爱爷爺爾牀牆牍牘牴牵牺牽犇犊犢
犧状犹狀狈狞独狭狮狯狱狹狽猎猪猫
猬献猶獄獅獨獪獭獰獲獵獸獺獻玛环
现玺珐珑珪珮珲現琍琯琱琺琼琿瑤瑩
瑪瑯瑶璎環璽瓊瓏瓔瓶甁甕甦甯电畄
畅畝畢異畴當疇疊疗疡疮疱痈痉痙痠
痲痳痹痺瘉瘍瘡療癒癞癡癢癣癥癩癫
癬癰癲發皰皱皺盃盏盐监盖盗盘盜盞
盡監盤盧着睏睑睪瞋瞒瞞瞭瞼矇矫矯
矶矽矾码砚砲砺砾础硃硕确硯碁碍碕
碩確碼磙磯磷礎礙礪礫礬礼祂祇祐祕
祯祷祸祿禀禄禅禍禎禦禪禮禱离禿秃
秆种积称秽稅稈税稜稟種稱稲稳穀穂
積穎穑穡穢穩穫穷窃窍窑窜窝窥窦窩
窪窮窯窺竄竅竇竊竝竞競笃笋笔笺笼
筆筍筛筝筱筹签简箇箋箏箪箫節範築
篠篤篩篮篱篲簑簞簡簫簽簾籃籌籐籠
籤籬类粪粮糞糢糧糾紀紂約紅紆紋納
紐純紗紙級紛紡紧紮細紳紹紺終絃組
絆結絞絡絢給絨統絲絳絹綏經綜綢綬
維綱網綴綵綸綺綻綽綾綿緇緊緋緘線
緝緞締緡編緩緬緯練緻縉縊縛縞縟縣
縫縮縯縱縷總績繃繆繈織繕繞繦繩繪
繫繭繰繹繼續纍纏纓纔纖纜纠纡红纣
纤约级纪纬纯纱纲纳纵纶纷纸纹纺纽
线绀练组绅细织终绊绍绎经绒结绕绘
给绚绛络绞统绢绥绦继绩绫续绮绯绰
绳维绵绶绷绸综绽缀缁缄缅缆缉缎缓
缔缕编缗缙缚缛缝缟缠缢缨缩缪缮缲
罂罋罌网罗罚罢罰罵罷羁羅羈羡羨義
習翘翹耑耡耸耻聋职联聖聞聪聯聰聲
聳職聽聾肃肅肠肤肾肿胀胁胆胜胧胫
胶脅脈脉脍脏脐脑脓脚脛脣脩脫脱脹
腊腎腦腫腳腸腾膚膠膽膾膿臍臘臟臥
臨臺舄舆與興舊舣舰舱艙艤艦艰艱艸
艹艺节芜芦芻苇苍苎苏苧茍茎茔茧荅
荆荊荐荘荚荞荠荡荣荨荫药荳莊莖莢
莱莲莳获莹莺莼菇菓華菴菸萊萝萤营
萧萨萬葉葦葯葱蒋蒐蒔蒼蓆蓋蓝蓦蓮
蓴蔆蔔蔘蔣蔥蔭蔷蔺蕁蕎蕓蕩蕪蕭蕴
薑薔薙薦薩薫薮薰薺藍藓藝藥藪藷藺
蘆蘇蘊蘖蘗蘚蘭蘿虏虑處虖虚虛虜號
虧虫虱虽虾蚀蚁蚕蛊蛎蛮蛰蛲蜗蝇蝉
蝕蝟蝦蝨蝸螢蟄蟬蟯蟲蟻蠅蠍蠣蠱蠶
蠻衊衒術衔衕衚衛衝补衮衹袜袞袭袷
装裏補裝裡製複褛褴褸褻襤襪襲覇覈
見規覓視覜覡親覲覺覽觀见观规觅视
览觉觋觐觔觝觞触觴觸訂訃計訊訌討
訓訖託記訛訝訟訢訣訥訪設許訴訶診
註詐詔評詛詞詠詢詣試詩詭詮詰話該
詳誅誇誉誊誌認誕誘語誠誡誣誤誥誦
誨誰課誹誼調諂諄談請諍諏諒論諛諜
諠諡諦諧諫諭諮諱諷諸諺諾謀謁謂謄
謎謐謔謖謗謙謚講謝謠謨謫謬謳謹謼
譁證譎譏識譚譜譯議譴護譽讀變讌讎
讒讓讖讚计订讣认讥讧讨让讫训议讯
记讲讳讴讶讷许讹论讼讽设访诀证诃
评诅识诈诉诊词诏译试诗诘诚诛话诞
诠诡询诣诤该详诫诬语误诰诱诲诵请
诸诹诺读诽课谀谁调谄谅谆谈谊谋谍
谏谐谑谒谓谕谗谘谚谛谜谟谡谢谣谤
谥谦谧谨谪谬谭谱谲谴谶谿豈豬貍貓
貝貞負財貢貧貨販貪貫責貯貰貳貴貶
買貸費貼貽貿賀賁賂賃賄資賈賊賑賓
賚賜賞賠賢賣賤賦質賭賸賻購賽贄贅
贈贊贍贓贖贝贞负贡财责贤败货质贩
贪贫贬购贮贯贰贱贲贳贴贵贷贸费贺
贻贼贽贾贿赁赂赃资赈赉赋赌赍赎赏
赐赔赘赙赛赞赠赡赵趋趙趨跃跖跡践
跼踌踐踪踰踴蹟蹠蹤蹧躊躍躏躪躯軀
車軋軌軍軒軟軫軸軻軾較輅載輒輓輔
輕輛輜輝輟輦輩輪輯輳輸輻輾輿轄轅
轉轍轎轟轢车轧轨轩转轮软轰轲轴轸
轹轻轼载轿辂较辄辅辆辇辈辉辍辎辏
辐辑输辕辖辗辙辞辟辩辭辯農边辽达
迁过迈运还这进远违连迟迩迳迴迹迺
迻适选逊递逕這連週進逻遊運過達違
遗遙遜遝遞遠遥適遲遷選遺遼邁還邇
邊邏邨邮邹郃郑郵郸鄒鄭鄲酿醜醫醼
釀释釋釐釘針釣釧釵鈍鈑鈔鈞鈴鈿鉅
鉉鉗鉛鉞鉤鉦鉴銀銃銅銑銓銖銘銜銷
鋏鋒鋤鋪鋸鋼錐錘錚錠錢錦錨錫錮錯
錶鍋鍍鍔鍛鍵鍼鍾鎖鎚鎧鎬鎰鏃鏇鏑
鏚鏡鏤鐘鐫鐵鐸鑄鑑鑒鑵鑽鑿针钉钏
钓钗钜钝钟钢钣钦钧钩钱钲钳钺钻钿
铁铃铅铉铎铗铜铠铢铣铨铭铮铳银铸
铺销锁锄锅锋错锚锡锢锤锥锦锭键锯
锷锺锻镀镂镌镐镒镜镝镞镟長长門閃
閉開閏閑間閔閘閣閤閥閧閨閭閻閼闆
闇闊闔闕闖闘關闡闢门闪闭问闯闰闲
间闵闷闸闹闺闻闾阀阁阎阏阐阔阖阙
队阨阬阯阳阴阵阶际陆陈陕陜陝陞陣
陥陨险陰陳陸陽隄隊階随隐隕際隨險
隱隻隽难雋雏雖雙雛雜離難雲雳電雾
霁霉霑霤霧霭霸霽靂靄靈靑青静靜鞏
鞦韆韋韓韜韦韩韬韵韻響頁頂頃項順
須頌預頑頒頓頗領頫頭頸頻顆題額顎
願類顧顫顯页顶顷项顺须顽顾顿颁颂
预领颇颈颍频颖颗题颚额颤風颯颱颳
飄风飒飘飛飞飢飨飭飯飴飼飽飾餃餉
養餌餓餘餚餞館餬饅饉饋饌饑饒饗饥
饬饭饯饰饱饲饴饵饶饷饺饿馀馆馈馑
馒馔馬馭馮馳馴駁駐駑駒駕駝駟駭駱
駿騁騎騏騙騫騰騷驀驃驅驍驕驗驚驛
驟驢驥驩驪马驭驯驰驱驳驴驷驹驻驼
驽驾驿骁骂骄骆骇骊骋验骏骐骑骗骚
骞骠骤骥體髮髴鬆鬍鬚鬥鬧鬨鬪鬱魚
魯鮑鮫鮮鯉鯖鯤鯨鰍鰒鰥鰲鰻鱗鱼鲁
鲍鲛鲜鲤鲭鲲鲸鳅鳆鳌鳏鳗鳞鳥鳧鳩
鳳鳴鳶鴉鴛鴦鴨鴻鵑鵝鵠鵡鵬鵰鵲鶩
鶯鶴鷰鷲鷸鷹鷺鸚鸞鸟鸠鸢鸣鸦鸭鸯
鸳鸾鸿鹃鹄鹅鹉鹊鹏鹜鹤鹦鹫鹬鹭鹰
鹵鹹鹽麗麤麥麦麪麴麵麹黃黄黑黒點
黨黴鼇鼕鼡齊齋齎齐齒齟齡齣齧齪齬
齷齿龃龄龉龊龌龍龕龙龛龜龟龢
""" #""" cjk_TS_covered_extension_of_cjk_common_subset_2942/简繁覆盖扩增字集纟共享汉字字集

def _简繁对照讠简体字讠繁体字串扌(简繁对照):
    'str -> {hz:hz_str}'
    from seed.types.FrozenDict import mk_FrozenDict
    return mk_FrozenDict((简体字, 繁体字串) for s in 简繁对照.split(';') for (简体字, 繁体字串) in [s.split(':')])
#===
#s/.\{16}[^;]*/\0\r/g
已补全耂简繁对照纟简繁覆盖扩增字集纟共享汉字字集 = (__sp_简繁对照:="""
万:萬;与:與;丑:醜;专:專;业:業
;丛:叢;东:東;丝:絲;两:兩
;严:嚴;丧:喪;个:個箇;临:臨
;丽:麗;乃:廼迺;义:義;乌:烏
;乐:樂;乔:喬;乘:乗;习:習
;书:書;买:買;乱:亂;乾:幹榦
;了:瞭;争:爭;亏:虧;云:雲
;亘:亙;亚:亞;亩:畝;亲:親
;亵:褻;亿:億;仅:僅;仆:僕
;仇:讎;从:從;仑:侖崙;仓:倉
;他:祂;仙:僊;仪:儀;们:們
;价:価價;仿:倣;优:優;会:會
;伞:傘;伟:偉;传:傳;伤:傷
;伦:倫;伫:佇;佑:祐;体:體
;余:餘;佛:彿髴;佣:傭;佥:僉
;佩:珮;侄:姪;侠:俠;侣:侶
;侥:僥;侦:偵;侧:側;侨:僑
;俞:兪;俨:儼;俩:倆;俪:儷
;俭:儉;修:脩;俯:頫;债:債
;倾:傾;偷:偸;偿:償;储:儲
;傩:儺;儿:兒;克:剋尅;兑:兌
;兔:兎;党:黨;兰:蘭;关:關
;兴:興;养:養;兽:獸;内:內
;冈:岡;册:冊;写:寫;军:軍
;农:農;冢:塚;冬:咚鼕;冯:馮
;冲:沖衝;决:決;况:況;冻:凍
;净:淨;凄:悽淒;准:凖準;凉:涼
;凌:淩;减:減;凑:湊;凛:凜
;几:幾;凤:鳳;凫:鳧;凭:憑
;凯:凱;凶:兇;出:齣;凿:鑿
;刍:芻;划:劃;刘:劉;则:則
;刚:剛;创:創;删:刪;别:別
;刮:颳;制:製;刹:剎;剂:劑
;剃:薙;剑:劍;剥:剝;剧:劇
;剩:剰賸;剿:勦;劝:勸;务:務
;动:動;助:耡;劫:刧;励:勵
;劲:勁;劳:勞;势:勢;勋:勳
;勖:勗;勤:懃;匡:劻;区:區
;医:醫;千:韆;升:昇陞;华:華
;协:協;单:單;卖:賣;卜:蔔
;占:佔;卢:盧;卤:鹵;卧:臥
;卫:衛;即:卽;却:卻;卷:巻捲
;厂:廠;厄:阨;厅:廳;压:壓
;厌:厭;厘:釐;厢:廂;厦:廈
;厨:廚;县:縣;参:參蔘;双:雙
;发:發髮;变:變;叠:疊;只:祇衹隻
;台:檯臺颱;叶:葉;号:號;叹:嘆歎
;吃:喫;合:郃閤;吊:弔;同:衕
;向:嚮曏;吒:咤;吕:呂;吞:呑
;听:聽;呕:嘔;呗:唄;员:員
;呜:嗚;周:週;呼:虖謼;和:龢
;咏:詠;咤:吒;咨:諮;咸:鹹
;咽:嚥;哄:閧鬨;响:響;哗:譁
;哲:喆;唇:脣;唤:喚;啖:啗
;啬:嗇;啮:齧;啸:嘯;喧:諠
;喷:噴;嗔:瞋;嘘:噓;嘱:囑
;嚯:謔;回:囘廻迴;团:團;园:園
;困:睏;围:圍;国:國;图:圖
;圆:圓;圈:圏;圣:聖;圭:珪
;圹:壙;场:場;址:阯;坏:壞
;坑:阬;块:塊;坚:堅;坛:壇
;坞:塢;坟:墳;坠:墜;垄:壟
;垅:壟;垒:壘;垦:墾;垩:堊
;堑:塹;堕:墮;堤:隄;填:塡
;墙:牆;增:増;壮:壯;声:聲
;壳:殼;壶:壺;处:處;备:備
;复:復複;夫:伕;夭:殀;头:頭
;夸:誇;夹:夾挾;夺:奪;夾:袷
;奂:奐;奋:奮;奔:犇;奥:奧
;奸:姦;妇:婦;妊:姙;姜:薑
;娄:婁;娇:嬌;娘:嬢孃;婵:嬋
;嫔:嬪;孙:孫;学:學;宁:寧
;宝:寶;实:實;宠:寵;审:審
;宪:憲;宫:宮;宴:讌醼;家:傢
;宾:賓;寝:寢;寸:吋;对:對
;寻:尋;导:導;寿:壽;将:將
;尔:爾;尘:塵;尚:尙;尝:嘗
;尧:堯;尸:屍;尺:呎;尽:盡
;局:侷挶跼;层:層;届:屆;屏:屛
;属:屬;屡:屢;屿:嶼;岂:豈
;岖:嶇;岗:崗;岚:嵐;岛:島
;岩:喦嵒巌巖;岭:嶺;岳:嶽;峡:峽
;峦:巒;峨:峩;崎:埼碕;嵩:崧
;巢:巣;巨:鉅钜;巩:鞏;币:幣
;布:佈;帅:帥;师:師;帐:帳
;帘:簾;帜:幟;带:帶;帧:幀
;席:蓆;幂:冪;幡:旛;幢:橦
;干:幹榦;并:竝;幸:倖;广:廣
;庄:荘莊;庆:慶;床:牀;庐:廬
;库:庫;应:應;庙:廟;废:廢
;庵:厂广菴;开:開;异:異;弃:棄
;弑:弒;张:張;弥:彌;弦:絃
;弯:彎;弹:彈;强:強彊;归:歸
;当:當;彗:篲;彦:彥;彩:綵
;彷:仿徬;彻:徹;征:徴徵;径:徑逕
;徕:徠;御:禦;德:徳;徼:僥
;忆:憶;忏:懺;志:誌;忧:憂
;念:唸;忾:愾;怀:懷;态:態
;怂:慫;怃:憮;怆:愴;怜:憐
;总:總;恋:戀;恒:恆;恤:卹
;恳:懇;恶:惡;恸:慟;恻:惻
;恼:惱;恿:慂;悦:悅;悬:懸
;悯:憫;惊:驚;惠:恵;惧:懼
;惨:慘;惩:懲;惫:憊;惮:憚
;惯:慣;愈:瘉癒;愍:湣;愤:憤
;愧:媿;愿:願;慎:愼;懒:懶
;战:戰;戚:慼鏚;才:纔;扎:紮
;扑:撲;托:託;执:執;扩:擴
;扫:掃;扬:揚;扰:擾;抄:杪鈔
;抚:撫;抛:拋;护:護;报:報
;抬:擡;抵:牴觝;拂:払;担:擔
;拈:撚;拐:枴柺;拓:搨;拜:拝
;拟:擬;拣:揀;拥:擁;拨:撥
;择:擇;挂:掛;挚:摯;挛:攣
;挞:撻;挟:夾挾;挠:撓;挥:揮
;挽:輓;捆:梱;捞:撈;损:損
;换:換;捣:搗;据:據;捻:撚
;掷:擲;揽:攬;搅:攪;搜:蒐
;携:攜;摄:攝;摆:擺;摇:搖
;效:傚;敌:敵;教:敎;敛:斂
;数:數;斋:齋;斗:闘鬥鬪;斤:觔
;斩:斬;断:斷;旋:鏇镟;旗:旂
;无:無;旧:舊;时:時;旷:曠
;昆:崑;昙:曇;昼:晝;显:顯
;晋:晉;晓:曉;晔:曄;晕:暈
;晖:暉;暂:暫;暖:煖;暗:闇
;暧:曖;曲:麴;札:劄;术:朮術
;朱:硃;朴:樸;朵:朶;机:機
;杀:殺;杂:雜;权:權;杆:桿
;村:邨;条:條;来:來;杨:楊
;杯:盃;杰:傑;松:鬆;板:闆
;极:極;构:構;果:菓;枢:樞
;枣:棗;枪:槍;枫:楓;枭:梟
;枳:樴;柜:櫃;栀:梔;栅:柵
;标:標;栈:棧;栉:櫛;栋:棟
;栏:欄;树:樹;栖:棲;栗:慄
;样:樣;核:覈;栾:欒;桡:橈
;桥:橋;桦:樺;桧:檜;梁:樑
;梦:夢;检:檢;棋:碁;棱:稜
;棹:櫂;椁:槨;楼:樓;概:槪
;榄:欖;榈:櫚;榨:搾;槛:檻
;槟:檳;模:糢;横:橫;樯:檣
;樱:櫻;橹:櫓;欢:歡驩;欣:訢
;欤:歟;欧:歐;欲:慾;歼:殲
;殁:歿;残:殘;殒:殞;殡:殯
;殴:毆;殷:慇;毁:毀燬;毋:毌
;每:毎;毕:畢;毙:斃;毡:氈
;气:氣;汇:匯彙;汉:漢;污:汚
;汤:湯;汹:洶;沈:沉瀋;沓:遝
;沟:溝;没:沒;沥:瀝;沦:淪
;沧:滄;沾:霑;泄:洩;泛:氾汎
;注:註;泪:淚;泷:瀧;泸:瀘
;泻:瀉;泽:澤;洁:潔;洒:灑
;洼:窪;浃:浹;浅:淺;浆:漿
;浊:濁;测:測;济:濟;浏:瀏
;浑:渾;浒:滸;浓:濃;浚:濬
;浩:澔;涂:塗;涉:渉;涌:湧
;涛:濤;涟:漣;涡:渦;涣:渙
;涤:滌;润:潤;涧:澗;涨:漲
;淀:澱;淋:痳;淫:婬;清:淸
;渊:淵;渍:漬;渐:漸;渔:漁
;渖:瀋;渗:滲;温:溫;游:遊
;湾:灣;湿:濕;溃:潰;溉:漑
;溜:霤;溪:谿;滚:滾;滞:滯
;满:滿;滤:濾;滥:濫;滨:濱
;滩:灘;演:縯;漤:濫;潇:瀟
;潜:潛;澄:澂;澜:瀾;濒:瀕
;灌:潅;灭:滅;灯:燈;灵:靈
;灾:災;灿:燦;炀:煬;炉:爐
;炖:燉;炫:衒;炮:砲;点:點
;炼:煉;炽:熾;烂:爛;烛:燭
;烟:煙菸;烦:煩;烧:燒;烬:燼
;热:熱;焕:煥;焰:焔;照:炤
;熏:燻薰;燕:讌醼鷰;爱:愛;爷:爺
;牍:牘;牵:牽;牺:犧;犊:犢
;状:狀;犹:猶;狈:狽;狞:獰
;独:獨;狭:狹;狮:獅;狯:獪
;狱:獄;狸:貍;猎:獵;猪:豬
;猫:貓;猬:蝟;献:獻;獭:獺
;玛:瑪;环:環;现:現;玺:璽
;珐:琺;珑:瓏;珲:琿;球:毬
;琅:瑯;琼:瓊;瑶:瑤;璃:琍
;璎:瓔;瓮:甕罋;瓶:甁;甯:寧
;电:電;畅:暢;留:畄;畴:疇
;疗:療;疡:瘍;疮:瘡;疱:皰
;症:癥;痈:癰;痉:痙;痒:癢
;痴:癡;痹:痺;癞:癩;癣:癬
;癫:癲;皱:皺;盏:盞;盐:鹽
;监:監;盖:蓋;盗:盜;盘:槃盤
;眺:覜;睑:瞼;睾:睪;瞒:瞞
;矫:矯;矶:磯;矾:礬;码:碼
;砚:硯;砺:礪;砾:礫;础:礎
;硅:矽;硕:碩;确:確;碍:礙
;磙:滾;磷:燐;礼:禮;祯:禎
;祷:禱;祸:禍;禀:稟;禄:祿
;禅:禪;离:離;秃:禿;秆:稈
;秋:鞦;种:種;秘:祕;积:積
;称:稱;移:迻;秽:穢;税:稅
;稳:穩;稻:稲;穑:穡;穗:穂
;穷:窮;窃:竊;窍:竅;窑:窯
;窜:竄;窝:窩;窥:窺;窦:竇
;竞:競;端:耑;笃:篤;笋:筍
;笔:筆;笺:箋;笼:籠;筋:觔
;筑:築;答:荅;筛:篩;筝:箏
;筱:篠;筹:籌;签:簽籤;简:簡
;管:琯;箪:簞;箫:簫;篮:籃
;篱:籬;类:類;粗:麤;粪:糞
;粮:糧;糊:餬;糟:蹧;系:係繫
;紧:緊;累:纍;纠:糾;纡:紆
;红:紅;纣:紂;纤:纖;约:約
;级:級;纪:紀;纬:緯;纯:純
;纱:紗;纲:綱;纳:納;纵:縱
;纶:綸;纷:紛;纸:紙;纹:紋
;纺:紡;纽:紐;线:線;绀:紺
;练:練;组:組;绅:紳;细:細
;织:織;终:終;绊:絆;绍:紹
;绎:繹;经:經;绒:絨;结:結
;绕:繞;绘:繪;给:給;绚:絢
;绛:絳;络:絡;绞:絞;统:統
;绢:絹;绥:綏;绦:絳;继:繼
;绩:勣績;绫:綾;续:續;绮:綺
;绯:緋;绰:綽;绳:繩;维:維
;绵:綿;绶:綬;绷:繃;绸:綢
;综:綜;绽:綻;缀:綴;缁:緇
;缄:緘;缅:緬;缆:纜;缉:緝
;缎:緞;缓:緩;缔:締;缕:縷
;编:編;缗:緡;缙:縉;缚:縛
;缛:縟;缝:縫;缟:縞;缠:纏
;缢:縊;缨:纓;缩:縮;缪:繆
;缮:繕;缲:繰;罂:罌;罐:鑵
;网:網;罗:羅;罚:罰;罢:罷
;羁:羈;羡:羨;翘:翹;耀:燿
;考:攷;耸:聳;耻:恥;聋:聾
;职:職;联:聯;聪:聰;肃:肅
;肠:腸;肤:膚;肴:餚;肾:腎
;肿:腫;胀:脹;胁:脅;胄:冑
;胆:膽;背:揹;胜:勝;胡:衚鬍
;胧:朧;胫:脛;胶:膠;脉:脈
;脍:膾;脏:臟;脐:臍;脑:腦
;脓:膿;脚:腳;脱:脫;腊:臘
;腥:胜;腾:騰;致:緻;舄:潟
;舆:輿;舍:捨;舣:艤;舰:艦
;舱:艙;艰:艱;艹:艸;艺:藝
;节:節;芜:蕪;芦:蘆;芸:蕓
;苇:葦;苍:蒼;苎:苧;苏:甦蘇
;苟:茍;范:範;茎:莖;茔:塋
;茧:繭;荆:荊;荐:薦;荚:莢
;荞:蕎;荠:薺;荡:蕩;荣:榮
;荨:蕁;荫:蔭;药:葯藥;莱:萊
;莲:蓮;莳:蒔;获:獲穫;莹:瑩
;莺:鶯;莼:蓴;菰:菇;菱:蔆
;萝:蘿;萤:螢;营:營;萧:蕭
;萨:薩;著:着;葱:蔥;蒋:蔣
;蒙:懞濛矇;蓑:簑;蓝:藍;蓦:驀
;蔑:衊;蔷:薔;蔺:藺;蕴:蘊
;薮:藪;薯:藷;薰:薫;藓:蘚
;藤:籐;蘖:櫱蘗;虏:虜;虑:慮
;虚:虛;虫:蟲;虱:蝨;虽:雖
;虾:蝦;蚀:蝕;蚁:蟻;蚕:蠶
;蛊:蠱;蛎:蠣;蛮:蠻;蛰:蟄
;蛲:蟯;蜗:蝸;蝇:蠅;蝉:蟬
;蝎:蠍;衔:啣銜;补:補;表:錶
;衮:袞;袜:襪;袭:襲;装:裝
;褛:褸;褴:襤;襁:繈繦;见:見
;观:觀;规:規;觅:覓;视:視
;览:覽;觉:覺;觋:覡;觐:覲
;觞:觴;触:觸;誉:譽;誊:謄
;计:計;订:訂;讣:訃;认:認
;讥:譏;讧:訌;讨:討;让:讓
;讫:訖;训:訓;议:議;讯:訊
;记:記;讲:講;讳:諱;讴:謳
;讶:訝;讷:訥;许:許;讹:訛
;论:論;讼:訟;讽:諷;设:設
;访:訪;诀:訣;证:證;诃:訶
;评:評;诅:詛;识:識;诈:詐
;诉:訴;诊:診;词:詞;诏:詔
;译:譯;试:試;诗:詩;诘:詰
;诚:誠;诛:誅;话:話;诞:誕
;诠:詮;诡:詭;询:詢;诣:詣
;诤:諍;该:該;详:詳;诫:誡
;诬:誣;语:語;误:誤;诰:誥
;诱:誘;诲:誨;诵:誦;请:請
;诸:諸;诹:諏;诺:諾;读:讀
;诽:誹;课:課;谀:諛;谁:誰
;调:調;谄:諂;谅:諒;谆:諄
;谈:談;谊:誼;谋:謀;谍:諜
;谏:諫;谐:諧;谑:謔;谒:謁
;谓:謂;谕:諭;谗:讒;谘:諮
;谚:諺;谛:諦;谜:謎;谟:謨
;谡:謖;谢:謝;谣:謠;谤:謗
;谥:諡謚;谦:謙;谧:謐;谨:謹
;谪:謫;谬:謬;谭:譚;谱:譜
;谲:譎;谴:譴;谶:讖;谷:榖穀
;豆:荳;贝:貝;贞:貞;负:負
;贡:貢;财:財;责:責;贤:賢
;败:敗;货:貨;质:質;贩:販
;贪:貪;贫:貧;贬:貶;购:購
;贮:貯;贯:貫;贰:貳;贱:賤
;贲:賁;贳:貰;贴:貼;贵:貴
;贷:貸;贸:貿;费:費;贺:賀
;贻:貽;贼:賊;贽:贄;贾:賈
;贿:賄;赁:賃;赂:賂;赃:贓
;资:資;赈:賑;赉:賚;赋:賦
;赌:賭;赍:齎;赎:贖;赏:賞
;赐:賜;赔:賠;赘:贅;赙:賻
;赛:賽;赞:讚贊;赠:贈;赡:贍
;赵:趙;趋:趨;跃:躍;跖:蹠
;践:踐;踊:踴;踌:躊;踪:蹤
;躏:躪;躯:軀;车:車;轧:軋
;轨:軌;轩:軒;转:轉;轮:輪
;软:軟;轰:轟;轲:軻;轴:軸
;轸:軫;轹:轢;轻:輕;轼:軾
;载:載;轿:轎;辂:輅;较:較
;辄:輒;辅:輔;辆:輛;辇:輦
;辈:輩;辉:輝;辍:輟;辎:輜
;辏:輳;辐:輻;辑:輯;输:輸
;辕:轅;辖:轄;辗:輾;辙:轍
;辞:辭;辟:闢;辩:辯;边:邊
;辽:遼;达:達;迁:遷;过:過
;迈:邁;运:運;还:還;这:這
;进:進;远:遠;违:違;连:連
;迟:遲;迩:邇;迭:叠疊;迳:逕
;迹:跡蹟;适:適;选:選;逊:遜
;递:遞;逻:邏;逾:踰;遗:遺
;遥:遙;邮:郵;邹:鄒;郁:鬱
;郑:鄭;郸:鄲;酸:痠;酿:釀
;采:埰寀採棌綵;释:釋;里:裏裡
;鉅:钜;鉴:鑑鑒;针:針鍼;钉:釘
;钏:釧;钓:釣;钗:釵;钜:鉅
;钝:鈍;钟:鍾鐘;钢:鋼;钣:鈑
;钦:欽;钧:鈞;钩:鉤;钱:錢
;钲:鉦;钳:鉗;钺:鉞;钻:鑽
;钿:鈿;铁:鐵;铃:鈴;铅:鉛
;铉:鉉;铎:鐸;铗:鋏;铜:銅
;铠:鎧;铢:銖;铣:銑;铨:銓
;铭:銘;铮:錚;铳:銃;银:銀
;铸:鑄;铺:鋪;销:銷;锁:鎖
;锄:鋤;锅:鍋;锋:鋒;错:錯
;锚:錨;锡:錫;锢:錮;锤:錘鎚
;锥:錐;锦:錦;锭:錠;键:鍵
;锯:鋸;锷:鍔;锺:鍾;锻:鍛
;镀:鍍;镂:鏤;镌:鐫;镐:鎬
;镒:鎰;镜:鏡;镝:鏑;镞:鏃
;长:長;门:門;闪:閃;闭:閉
;问:問;闯:闖;闰:閏;闲:閑
;间:間;闵:閔;闷:悶;闸:閘
;闹:鬧;闺:閨;闻:聞;闾:閭
;阀:閥;阁:閣;阎:閻;阏:閼
;阐:闡;阔:闊;阖:闔;阙:闕
;队:隊;阳:陽;阴:陰;阵:陣
;阶:階;际:際;陆:陸;陈:陳
;陕:陜陝;陨:隕;险:險;陷:陥
;随:隨;隐:隱;隽:雋;难:難
;雇:僱;雏:雛;雕:彫琱鵰;雳:靂
;雾:霧;霁:霽;霉:黴;霭:靄
;霸:覇;青:靑;静:靜;面:麪麵
;韦:韋;韩:韓;韬:韜;韵:韻
;页:頁;顶:頂;顷:頃;项:項
;顺:順;须:須鬚;顽:頑;顾:顧
;顿:頓;颁:頒;颂:頌;预:預
;领:領;颇:頗;颈:頸;颍:潁
;频:頻;颖:穎;颗:顆;题:題
;颚:顎;额:額;颤:顫;风:風
;飒:颯;飘:飄;飞:飛;飨:饗
;饥:飢饑;饬:飭;饭:飯;饯:餞
;饰:飾;饱:飽;饲:飼;饴:飴
;饵:餌;饶:饒;饷:餉;饺:餃
;饿:餓;馀:餘;馆:館;馈:饋
;馑:饉;馒:饅;馔:饌;马:馬
;驭:馭;驯:馴;驰:馳;驱:驅
;驳:駁;驴:驢;驷:駟;驹:駒
;驻:駐;驼:駝;驽:駑;驾:駕
;驿:驛;骁:驍;骂:罵;骄:驕
;骆:駱;骇:駭;骊:驪;骋:騁
;验:驗;骏:駿;骐:騏;骑:騎
;骗:騙;骚:騷;骞:騫;骠:驃
;骤:驟;骥:驥;鱼:魚;鲁:魯
;鲍:鮑;鲛:鮫;鲜:鮮;鲤:鯉
;鲭:鯖;鲲:鯤;鲸:鯨;鳅:鰍
;鳆:鰒;鳌:鰲鼇;鳏:鰥;鳗:鰻
;鳞:鱗;鸟:鳥;鸠:鳩;鸢:鳶
;鸣:鳴;鸦:鴉;鸭:鴨;鸯:鴦
;鸳:鴛;鸾:鸞;鸿:鴻;鹃:鵑
;鹄:鵠;鹅:鵝;鹉:鵡;鹊:鵲
;鹏:鵬;鹜:鶩;鹤:鶴;鹦:鸚
;鹫:鷲;鹬:鷸;鹭:鷺;鹰:鷹
;麦:麥;麹:麴;麻:痲;黄:黃
;黑:黒;鼠:鼡;齐:齊;齿:齒
;龃:齟;龄:齡;龉:齬;龊:齪
;龌:齷;龙:龍;龛:龕;龟:龜
""" #""" 已补全耂简繁对照纟简繁覆盖扩增字集纟共享汉字字集
,__简繁对照:=hz_sp_str2hz_str(__sp_简繁对照)
,_简繁对照讠简体字讠繁体字串扌(__简繁对照)
)
assert len(已补全耂简繁对照纟简繁覆盖扩增字集纟共享汉字字集[1]) == 6339 #含『:』『;』
assert 已补全耂简繁对照纟简繁覆盖扩增字集纟共享汉字字集[2]['龟'] == '龜'
assert 已补全耂简繁对照纟简繁覆盖扩增字集纟共享汉字字集[2]['术'] == '朮術'
#end-已补全耂简繁对照纟简繁覆盖扩增字集纟共享汉字字集
#===

cjk_common_subset_TS_covered_extension_5455 = 共享汉字字集牜简繁覆盖扩增 = """
一丁七万丈三上下不与丑专且丕世丘
丙业丛东丝丞两严丧个中串临丸丹主
丽乃久义之乌乍乎乏乐乔乖乗乘乙九
乞也习书买乱乳乾亂了予争事二于亏
云互五井亘亙亚些亞亡亢交亥亦亨亩
享京亭亮亲亵人亿什仁仄仅仆仇今介
仍从仑仓仔仕他仗付仙仝仟代令以仪
们仰仲件价任仿企伉伊伍伎伏伐休伕
优会伞伟传伤伦伫伯伴伶伸伺似伽佃
但佇佈位低住佐佑体佔何余佚佛作佣
佥佩佯佰佳佶使侃侄來侈例侍侏侑侖
供依侠価侣侥侦侧侨侮侯侵侶侷便係
促俄俊俎俑俗俚保俞俟俠信俨俩俪俭
修俯俳俸俺倆倉個倍們倒倖候倚借倡
倣倦倨倪倫倬倭债倾偃假偈偉偏偕做
停健側偵偶偷偸偿傀傅傍傑傘備傚傢
储傩催傭傲傳債傷傾僅僉僊像僑僕僖
僚僥僧僭僱價僻儀億儉儒償儡優儲儷
儺儼儿兀允元兄充兆兇先光克兌免兎
兑兒兔党兜兢入內全兩兪八公六兮兰
共关兴兵其具典养兼兽冀内冈冊册再
冑冒冕冗写军农冠冢冥冪冬冯冲决况
冶冷冻冽净凄准凉凋凌凍减凑凖凛凜
凝几凡凤凫凭凯凰凱凶凸凹出函凿刀
刃分切刈刊刍刎刑划列刘则刚创初删
判別刧利刪别刮到制刷券刹刺刻剂剃
則削剋剌前剎剑剔剖剛剝剥剧剩剪副
剰割創剽剿劃劄劇劈劉劍劑力劝功加
务劣动助努劫励劲劳劻劾势勁勃勇勉
勋勒動勖勗勘務勝勞募勢勣勤勦勳勵
勸勺勾勿包匈匍匏匐匕化北匙匠匡匣
匪匯匹区医匿區十千升午卉半华协卑
卒卓協单卖南博卜卞占卢卤卦卧卫卯
印危即却卵卷卹卻卽卿厂厄厅压厌厘
厚原厢厥厦厨厭去县参參又叉及友双
反发叔取受变叛叠叢口古句叩只叫召
叭可台叱史右叶号司叹吃各合吉吊吋
同名后吏吐向吒吕君吝吞吟吠否吩含
听吸吹吻吼吾呂呈告呎呑呕呗员呜周
呱味呵呻呼命咀咆和咎咏咐咚咤咨咫
咬咳咸咽哀品哄哈哉响哗員哥哨哭哮
哲哺唄唆唇唐唤唯唱唸唾啄商問啖啗
啣啬啮啸啼喀善喆喇喉喊喘喙喚喜喝
喦喧喪喫喬單喷嗅嗇嗔嗚嗜嗟嗣嗤嗽
嗾嘆嘉嘔嘗嘘嘯嘱嘲嘴嘶噓器噫噴嚆
嚥嚮嚯嚴嚼囑囘囚四回因团园困围囹
固国图圃圄圆圈國圍圏園圓圖團土圣
在圭地圹场圻址均坊坎坏坐坑块坚坛
坞坟坠坡坤坦坪垂垄垅型垒垓垠垢垣
垦垩埃埋城域埠埰埴執培基埼堀堂堅
堆堊堑堕堡堤堪堯堰報場堵塊塋塑塔
塗塘塚塞塡塢填塵塹塾境墅墓増墙墜
增墟墨墮墳墾壁壅壇壑壓壕壘壙壞壟
壤士壬壮壯声壳壶壹壺壽处备复夏夕
外夙多夜夢大天太夫夭央失头夷夸夹
夺夾奂奄奇奈奉奋奎奏奐契奔奕套奚
奠奢奥奧奪奮女奴奸好如妃妄妇妊妓
妖妙妥妨妹妻妾姆始姐姑姓委姙姚姜
姦姨姪姻姿威娃娄娇娑娘娜娟娠娥娩
娶娼婁婆婉婚婢婦婬婵媒媚媛媿嫁嫂
嫉嫌嫔嫡嫦嫩嬉嬋嬌嬖嬢嬪孀孃子孑
孔孕字存孙孚孜孝孟季孤学孩孫孰孱
孵學孺宁宅宇守安宋完宏宕宗官宙定
宛宜宝实宠审客宣室宥宦宪宫宮宰害
宴宵家宸容宾宿寀寂寄寅密寇富寐寒
寓寝寞察寡寢寤寥實寧寨審寫寮寵寶
寸对寺寻导寿封射尅将將專尉尊尋對
導小少尔尖尘尙尚尝尤尧就尸尹尺尻
尼尽尾尿局层居屆屈届屋屍屎屏屑展
屛属屠屡屢層履屬屯山屹屿岂岐岑岖
岗岚岛岡岩岫岬岭岱岳岷岸峙峡峦峨
峩峰島峻峽崇崎崑崔崖崗崙崧崩嵋嵌
嵐嵒嵩嵬嵯嶇嶝嶺嶼嶽巌巍巒巖川州
巡巢巣工左巧巨巩巫差己已巳巴巷巻
巽巾币市布帅帆师希帐帑帖帘帙帛帜
帝帥带帧師席帳帶常帽幀幂幄幅幌幕
幟幡幢幣干平年并幸幹幻幼幽幾广庄
庆庇床序庐库应底店庙庚府废庠度座
庫庭庵庶康庸廂廈廉廊廓廖廚廛廟廠
廢廣廬廳延廷建廻廼开弁异弃弄弊式
弑弒弓弔引弗弘弛弟张弥弦弧弩弯弱
張強弹强弼彈彊彌彎归当彖彗彙形彥
彦彩彪彫彬彭彰影彷役彻彼彿往征径
待徇徊律後徐徑徒徕得徘徙從徠御徨
復循徬微徳徴徵德徹徼徽心必忆忌忍
忏忖志忘忙忠忧快念忽忾忿怀态怂怃
怆怏怒怖怜思怠怡急性怨怪怯总恁恂
恃恆恋恍恐恒恕恙恢恣恤恥恨恩恪恬
恭息恰恳恵恶恸恻恼恿悅悉悌悍悔悖
悚悛悟悠患悦悬悯悲悴悶悸悼悽情惊
惑惚惜惟惠惡惧惨惩惫惮惯惰惱想惶
惹惺惻愁愆愈愉愍愎意愕愚愛感愤愧
愴愼愾愿慂慄慇慈慊態慌慎慕慘慝慟
慢慣慧慨慫慮慰慶慷慼慾憂憊憎憐憑
憔憚憤憧憩憫憬憮憲憶憾懃懇懈應懊
懋懒懞懦懲懶懷懸懺懼懿戀戈戊戌戍
戎成我戒或战戚戟戡截戮戰戴房所扁
扇扈扉手才扎扑打払托执扩扫扬扮扰
扶批扼承技抄抉把抑抒投抗折抚抛护
报披抬抱抵抹押抽拂担拇拈拉拋拌拍
拐拒拓拔拗拘拙招拜拝拟拣拥拨择括
拭拮拯拱拳拷拾拿持挂指按挑挚挛挞
挟挠挥挫振挶挺挽挾捆捉捌捏捐捕捞
损换捣捧捨据捲捷捺捻掃授掉掌排掖
掘掛掠採探接控推掩措掷揀揄揆描提
揖揚換握揮援揶揹揽搅損搏搖搗搜搨
搬搭携搾摄摆摇摘摩摯摸摺撈撒撓撚
撞撤撥撫播撮撰撲撻擁擅擇操擒擔擘
據擡擢擦擬擲擴擺擾攀攘攜攝攣攪攫
攬支收攷攸改攻放政故效敌敎敏救敖
敗教敛敞敢散敦敬数敲整敵敷數斂斃
文斋斌斐斑斗料斛斜斟斡斤斥斧斩斫
斬断斯新斷方於施旁旂旅旋旌族旒旗
旛无日旦旧旨早旬旭旱时旷旺昆昇昊
昌明昏易昔昙星映春昧昨昭是昴昶昼
显晁時晃晉晋晏晓晔晕晖晝晟晤晦晨
普景晴晶智暂暄暇暈暉暑暖暗暝暢暧
暫暮暴暹暾曄曇曉曏曖曙曜曝曠曦曰
曲曳更曷書曹曼曾替最會月有朋服朔
朕朗望朝期朦朧木未末本札朮术朱朴
朵朶机朽杀杂权杆杉李杏材村杓杖杜
杞束条来杨杪杭杯杰東杳杵杷松板极
构枇枉枋析枕林枚果枝枢枣枪枫枭枯
枳枴架枷枸柄柏某柑染柔柚柜柝柩柬
柯柱柳柴柵柺栀栅标栈栉栋栏树栓栖
栗校株样核根格栽栾桀桁桂桃案桎桐
桑桓桔桡桥桦桧桶桿梁梅梏梓梔梗條
梟梢梦梧梨梭梯械梱梳梵检棄棉棋棌
棍棒棕棗棘棚棟棠棧森棱棲棹棺椁椅
植椎椒椰椽椿楊楓楔楚楞楠楫業楮極
楷楸楹楼概榄榈榕榖榛榜榦榧榨榮榴
榻槁槃構槌槍槐槛槟槨槪槽槿樂樊樑
樓樗標樞樟模樣横樯樱樴樵樸樹樺樽
橄橈橋橘橙機橡橦橫橹檀檄檎檗檜檢
檣檯檳檻櫂櫃櫓櫚櫛櫱櫻欄權欒欖欠
次欢欣欤欧欲欺欽款歇歌歎歐歟歡止
正此武歪歸死歼歿殀殁殃殄殆殉殊残
殒殖殘殞殡殯殲殴段殷殺殼殿毀毁毅
毆毋毌母毎每毒毓比毕毙毛毡毫毬氈
氏民氓气氣水永氾汀汁求汇汉汎汐汕
汗汚汝汞江池污汤汨汪汰汲汹決汽汾
沁沂沃沈沉沌沐沒沓沖沙沛沟没沥沦
沧沫沮河沸油治沼沽沾沿況泄泉泊泌
泓法泗泛泡波泣泥注泪泯泰泳泷泸泻
泽洁洋洌洒洗洙洛洞津洩洪洲洵洶活
洼洽派流浃浅浆浊测济浏浑浒浓浙浚
浣浦浩浪浮浴海浸浹涂涅消涉涌涎涓
涕涛涟涡涣涤润涧涨涯液涵涼淀淅淆
淇淋淑淒淘淙淚淞淡淨淩淪淫淮深淳
淵混淸淹淺添清渉渊渍渐渔渖渗渙渚
減渠渡渣渤渥渦温渫測渭港游渺渾湃
湊湍湖湘湛湟湣湧湫湮湯湾湿溃溉源
準溜溝溟溢溥溪溫溯溶溺滂滄滅滋滌
滑滓滔滚滞满滤滥滨滩滯滲滴滸滾滿
漁漂漆漏漑演漕漠漢漣漤漫漬漱漲漸
漿潁潅潇潔潘潛潜潟潤潭潮潰潺潼澂
澄澎澔澗澜澤澱澳澹激濁濂濃濒濕濛
濟濠濡濤濫濬濯濱濾瀉瀋瀏瀑瀕瀘瀚
瀛瀝瀟瀧瀾灌灑灘灣火灭灯灰灵灸灼
災灾灿炀炉炊炎炒炖炙炤炫炬炭炮炯
炳炸点炼炽烂烈烏烙烛烟烦烧烬热烹
烽焉焔焕焙焚無焦焰然煉煌煎煖煙煤
煥煦照煩煬煮煽熄熊熏熔熙熟熬熱熹
熾燃燈燉燎燐燒燔燕營燥燦燧燬燭燮
燻燼燿爆爐爛爪爬爭爰爱爵父爷爺爻
爽爾牀牆片版牌牍牒牘牙牛牝牟牡牢
牧物牲牴牵特牺牽犀犁犇犊犢犧犬犯
状犹狀狂狄狈狎狐狗狙狞狡狩独狭狮
狯狱狸狹狼狽猊猎猖猛猜猝猥猩猪猫
猬献猶猷猾猿獄獅獗獨獪獭獰獲獵獸
獺獻玄率玉王玖玛玩环现玲玳玺珀珂
珊珍珐珑珞珠珥珪班珮珲現球琅理琉
琍琢琥琯琱琳琴琵琶琺琼琿瑁瑕瑙瑚
瑛瑜瑞瑟瑤瑩瑪瑯瑶瑾璃璋璎璞璧環
璽瓊瓏瓔瓜瓠瓢瓣瓦瓮瓶瓷甁甄甑甕
甘甚生甥甦用甫甬甯田由甲申电男甸
町畄畅界畏畔留畛畜畝畢略畦番異畴
當畸畿疆疇疊疋疏疑疗疝疡疥疫疮疱
疲疳疵疸疹疼疽疾痂病症痈痉痍痒痔
痕痘痙痛痠痢痰痲痳痴痹痺痼瘉瘍瘟
瘠瘡瘢瘤療癌癒癖癞癡癢癣癥癩癫癬
癰癲癸登發白百的皆皇皎皓皮皰皱皺
皿盂盃盆盈益盏盐监盒盖盗盘盛盜盞
盟盡監盤盧目盲直相盾省眄眈眉看眠
眩眷眸眺眼着睏睑睛睡督睦睪睫睹睾
睿瞋瞑瞒瞞瞥瞬瞭瞰瞳瞻瞼瞿矇矗矛
矜矢矣知矩矫短矮矯石矶矽矾码砂砒
砚砥砦砧砲破砺砾础硃硅硕硝硫硬确
硯硼碁碇碌碍碎碑碕碗碣碧碩確碼磁
磅磊磋磐磙磨磬磯磷礁礎礙礪礫礬示
礼社祀祁祂祇祈祉祐祕祖祗祚祝神祠
祥票祭祯祷祸祺祿禀禁禄禅禍禎福禦
禧禪禮禱禳禹离禽禾禿秀私秃秆秉秋
种科秒秕秘租秤秦秧秩积称移秽稀稅
稈程稍税稔稗稚稜稟稠種稱稲稳稷稻
稼稽稿穀穂穆積穎穑穗穡穢穩穫穰穴
究穷穹空穿突窃窄窈窍窑窒窕窘窜窝
窟窥窦窩窪窮窯窺竄竅竇竊立站竝竞
竟章竣童竭端競竹竺竿笃笋笏笑笔笙
笛笞笠符第笺笼筆等筋筌筍筏筐筑筒
答策筛筝筮筱筵筹签简箇箋箏箔箕算
箝管箪箫箭箱箴箸節篁範篆篇築篠篤
篩篮篱篲簇簑簞簡簧簪簫簽簾簿籃籌
籍籐籠籤籬米类粉粒粕粗粘粟粥粪粮
粱粲粳粹精糊糖糞糟糠糢糧系糾紀紂
約紅紆紊紋納紐純紗紙級紛素紡索紧
紫紮累細紳紹紺終絃組絆結絞絡絢給
絨絮統絲絳絹綏經綜綢綬維綱網綴綵
綸綺綻綽綾綿緇緊緋緘線緝緞締緡編
緩緬緯練緻縉縊縛縞縟縣縫縮縯縱縷
總績繁繃繆繈織繕繞繦繩繪繫繭繰繹
繼纂續纍纏纓纔纖纛纜纠纡红纣纤约
级纪纬纯纱纲纳纵纶纷纸纹纺纽线绀
练组绅细织终绊绍绎经绒结绕绘给绚
绛络绞统绢绥绦继绩绫续绮绯绰绳维
绵绶绷绸综绽缀缁缄缅缆缉缎缓缔缕
编缗缙缚缛缝缟缠缢缨缩缪缮缲缶缸
缺罂罋罌罐网罔罕罗罚罢罪置罰署罵
罷罹羁羅羈羊羌美羔羚羞羡群羨義羲
羸羹羽翁翅翊翌習翔翕翘翠翡翩翰翹
翼耀老考者耆而耐耑耕耗耘耡耳耶耸
耻耽耿聆聊聋职联聖聘聚聞聪聯聰聲
聳職聽聾聿肃肄肅肆肇肉肋肌肖肛肝
肠股肢肤肥肩肪肯肱育肴肺肾肿胀胁
胃胄胆背胎胚胛胜胞胡胤胥胧胫胱胴
胶胸能脂脅脆脈脉脊脍脏脐脑脓脚脛
脣脩脫脯脱脹脾腊腋腎腐腑腔腕腥腦
腫腰腱腳腸腹腺腾腿膀膈膊膏膚膜膝
膠膣膨膳膺膽膾膿臀臂臆臍臘臟臣臥
臧臨自臭至致臺臻臼臾舄舅舆與興舊
舌舍舒舛舜舞舟舣航舫般舰舱舵舶舷
船艇艙艤艦艮良艰艱色艸艹艺艾节芋
芍芒芙芜芝芟芥芦芬芭芯花芳芸芹芻
芽苇苍苎苏苑苒苔苗苛苞苟苡若苦苧
英茂范茄茅茉茍茎茔茗茧茨茫茯茱茴
茵茶茸茹荀荅荆草荊荏荐荒荘荚荞荠
荡荣荨荫药荳荷荻莉莊莎莖莞莢莪莫
莱莲莳获莹莺莼莽菁菅菇菊菌菓菖菜
菩華菰菱菲菴菸菽萃萄萊萌萍萎萝萤
营萧萨萬萱萸落葉著葛葡董葦葫葬葯
葱葵葺蒋蒐蒔蒙蒜蒡蒲蒸蒼蒿蓄蓆蓉
蓋蓍蓑蓝蓦蓬蓮蓴蓼蔆蔑蔓蔔蔗蔘蔚
蔡蔣蔥蔬蔭蔷蔺蔽蕁蕃蕉蕎蕓蕨蕩蕪
蕭蕴薄薇薑薔薙薛薦薨薩薪薫薮薯薰
薺藉藍藏藓藕藜藝藤藥藩藪藷藺藻蘆
蘇蘊蘖蘗蘚蘭蘿虎虏虐虑虔處虖虚虛
虜虞號虧虫虱虹虽虾蚀蚁蚊蚌蚓蚕蚣
蚤蚩蛇蛊蛋蛎蛔蛙蛛蛟蛤蛭蛮蛰蛲蛾
蜀蜂蜃蜈蜗蜘蜚蜜蝇蝉蝎蝕蝗蝟蝦蝨
蝴蝶蝸螂融螟螢螳螺蟄蟠蟬蟯蟲蟹蟻
蟾蠅蠍蠢蠣蠱蠶蠻血衊行衍衒術衔衕
街衙衚衛衝衡衢衣补表衫衮衰衲衷衹
衾衿袁袂袈袋袍袒袖袜袞被袭袷裁裂
装裏裔裕裙補裝裟裡裨裳裴裸製複褐
褒褓褛褥褪褴褶褸褻襁襄襟襤襪襲西
要覃覆覇覈見規覓視覜覡親覲覺覽觀
见观规觅视览觉觋觐角觔觝觞解触觴
觸言訂訃計訊訌討訓訖託記訛訝訟訢
訣訥訪設許訴訶診註詐詔評詛詞詠詢
詣試詩詭詮詰話該詳誅誇誉誊誌認誓
誕誘語誠誡誣誤誥誦誨誰課誹誼調諂
諄談請諍諏諒論諛諜諠諡諦諧諫諭諮
諱諷諸諺諾謀謁謂謄謎謐謔謖謗謙謚
講謝謠謨謫謬謳謹謼譁證譎譏識譚譜
警譬譯議譴護譽讀變讌讎讒讓讖讚计
订讣认讥讧讨让讫训议讯记讲讳讴讶
讷许讹论讼讽设访诀证诃评诅识诈诉
诊词诏译试诗诘诚诛话诞诠诡询诣诤
该详诫诬语误诰诱诲诵请诸诹诺读诽
课谀谁调谄谅谆谈谊谋谍谏谐谑谒谓
谕谗谘谚谛谜谟谡谢谣谤谥谦谧谨谪
谬谭谱谲谴谶谷谿豁豆豈豌豕豚象豪
豫豬豹豺貂貊貌貍貓貝貞負財貢貧貨
販貪貫責貯貰貳貴貶買貸費貼貽貿賀
賁賂賃賄資賈賊賑賓賚賜賞賠賢賣賤
賦質賭賸賻購賽贄贅贈贊贍贓贖贝贞
负贡财责贤败货质贩贪贫贬购贮贯贰
贱贲贳贴贵贷贸费贺贻贼贽贾贿赁赂
赃资赈赉赋赌赍赎赏赐赔赘赙赛赞赠
赡赤赦赫走赳赴赵起超越趋趙趣趨足
趺趾跃跋跌跏跖跛距跡跣跨路跳践跼
踊踌踏踐踞踪踰踴踵蹂蹄蹇蹈蹉蹊蹙
蹟蹠蹤蹧蹴蹶躁躇躊躍躏躪身躬躯軀
車軋軌軍軒軟軫軸軻軾較輅載輒輓輔
輕輛輜輝輟輦輩輪輯輳輸輻輾輿轄轅
轉轍轎轟轢车轧轨轩转轮软轰轲轴轸
轹轻轼载轿辂较辄辅辆辇辈辉辍辎辏
辐辑输辕辖辗辙辛辜辞辟辣辨辩辭辯
辰辱農边辽达迁迂迅过迈迎运近返还
这进远违连迟迦迩迪迫迭述迳迴迷迹
迺迻追退送适逃逅逆选逊逋逍透逐逑
递途逕逗這通逝逞速造逡逢連逮週進
逵逸逻逼逾遁遂遇遊運遍過遐遑道達
違遗遙遜遝遞遠遣遥適遭遮遲遵遷選
遺遼遽避邀邁邂邃還邇邊邏邑那邦邨
邪邮邯邱邵邸邹郁郃郊郑郡部郭郵郸
都鄂鄒鄙鄭鄲酉酊酋酌配酎酒酢酩酪
酬酵酷酸酿醇醉醋醍醒醜醫醯醴醵醼
釀采釉释釋里重野量釐金釘釜針釣釧
釵鈍鈑鈔鈞鈴鈿鉅鉉鉗鉛鉞鉤鉦鉴銀
銃銅銑銓銖銘銜銷鋏鋒鋤鋪鋸鋼錐錘
錚錠錢錦錨錫錮錯錶鍋鍍鍔鍛鍵鍼鍾
鎖鎚鎧鎬鎰鏃鏇鏑鏚鏡鏤鐘鐫鐵鐸鑄
鑑鑒鑵鑽鑿针钉钏钓钗钜钝钟钢钣钦
钧钩钱钲钳钺钻钿铁铃铅铉铎铗铜铠
铢铣铨铭铮铳银铸铺销锁锄锅锋错锚
锡锢锤锥锦锭键锯锷锺锻镀镂镌镐镒
镜镝镞镟長长門閃閉開閏閑間閔閘閣
閤閥閧閨閭閻閼闆闇闊闔闕闖闘關闡
闢门闪闭问闯闰闲间闵闷闸闹闺闻闾
阀阁阎阏阐阔阖阙阜队阡阨阪阬阮阯
防阳阴阵阶阻阿陀陂附际陆陈陋陌降
限陕陛陜陝陞陟院陣除陥陨险陪陰陳
陵陶陷陸陽隄隅隆隊隋隍階随隐隔隕
隘隙際障隧隨險隱隻隽难雀雁雄雅集
雇雉雋雌雍雎雏雕雖雙雛雜離難雨雪
雲雳零雷雹電雾需霁霆震霉霑霓霖霜
霞霤霧霭霰露霸霹霽靂靄靈靑青靖静
靜非靡面革靴鞋鞍鞏鞠鞦鞫鞭韆韋韓
韜韦韩韬音韵韶韻響頁頂頃項順須頌
預頑頒頓頗領頫頭頸頻顆題額顎願類
顧顫顯页顶顷项顺须顽顾顿颁颂预领
颇颈颍频颖颗题颚额颤風颯颱颳飄风
飒飘飛飞食飢飨飭飯飴飼飽飾餃餉養
餌餐餓餘餚餞館餬饅饉饋饌饑饒饗饥
饬饭饯饰饱饲饴饵饶饷饺饿馀馆馈馑
馒馔首香馥馨馬馭馮馳馴駁駐駑駒駕
駝駟駭駱駿騁騎騏騙騫騰騷驀驃驅驍
驕驗驚驛驟驢驥驩驪马驭驯驰驱驳驴
驷驹驻驼驽驾驿骁骂骄骆骇骊骋验骏
骐骑骗骚骞骠骤骥骨骸髓體高髮髴鬆
鬍鬚鬥鬧鬨鬪鬱鬼魁魂魃魄魅魏魔魚
魯鮑鮫鮮鯉鯖鯤鯨鰍鰒鰥鰲鰻鱗鱼鲁
鲍鲛鲜鲤鲭鲲鲸鳅鳆鳌鳏鳗鳞鳥鳧鳩
鳳鳴鳶鴉鴛鴦鴨鴻鵑鵝鵠鵡鵬鵰鵲鶩
鶯鶴鷰鷲鷸鷹鷺鸚鸞鸟鸠鸢鸣鸦鸭鸯
鸳鸾鸿鹃鹄鹅鹉鹊鹏鹜鹤鹦鹫鹬鹭鹰
鹵鹹鹽鹿麒麓麗麝麟麤麥麦麪麴麵麹
麻麾黃黄黍黎黑黒黔默黛黜點黨黴鼇
鼎鼓鼕鼠鼡鼻齊齋齎齐齒齟齡齣齧齪
齬齷齿龃龄龉龊龌龍龕龙龛龜龟龢
""" #""" cjk_common_subset_TS_covered_extension_5455/共享汉字字集牜简繁覆盖扩增


def _check__cjk_common_subset_TS_covered_extension_5455():
    from nn_ns.CJK.cjk_subsets.hanzi import cjk_common_subset_TS_covered_extension_5455, cjk_TS_covered_extension_of_cjk_common_subset_2942, cjk_common_subset_2513
    assert not '\n' in cjk_common_subset_TS_covered_extension_5455, (__name__, cjk_common_subset_TS_covered_extension_5455.index('\n'))
    assert len(cjk_common_subset_TS_covered_extension_5455) == 5455 == 2513+2942
    assert len(cjk_common_subset_2513) == 2513
    assert len(cjk_TS_covered_extension_of_cjk_common_subset_2942) == 2942
    assert cjk_common_subset_TS_covered_extension_5455 == hz_set2sorted_hz_str(cjk_TS_covered_extension_of_cjk_common_subset_2942 + cjk_common_subset_2513)
#if __name__ == "__main__":
#_check__cjk_common_subset_TS_covered_extension_5455()
_post_checks.append(_check__cjk_common_subset_TS_covered_extension_5455)















































































__all__


if __name__ == "__main__":
    pass

#！下面的代码，保持在最后！
def __():
    #删去 字符串中的空格！
    d = globals()

    #for nm in [*d]:
    for nm in __all__:
        v = d[nm]
        if type(v) is str:
            d[f'-{nm}-'] = v
                #save
            d[nm] = hz_sp_str2hz_str(v)
                #保持重复...
                #保持次序...
__(); del __
def __():
    #字数确认
    import re
    ptn__nondigits = r'[^0-9]+'
    rex__nondigits = re.compile(ptn__nondigits)
    except_nm2sz = dict(
    中华字经2003__重复字4000_不同字3980=4000
    ,按横捺为零竖撇为一忽略折笔记为二进制数时前四笔的十六个代表字=16
    ,按横为零零撇为零一捺为一零竖为一一忽略折笔记为二进制数时前两笔的十六个代表字=16
    ,按横捺为零竖撇为一忽略折笔记为二进制数时前六笔的六十四个代表字=64
    ,高稳定度汉字字集囗第一版囗高频八十六字=86
    ,高稳定度汉字字集囗第一版囗低频二百五十六字=256
    ,高稳定度汉字字集囗第一版囗降频囗三百四十二字=342
    ,高稳定度汉字字集囗第二版囗降频囗无病字框囗二百五十九字=259
    ,高稳定度汉字字集囗第三版囗码序囗二百六十一字=261
    ,共享汉字字集=2513
    ,初步缩减囗共享汉字字集=1869
    ,平凡繁简囗初步缩减囗共享汉字字集=1631
    ,平凡繁简囗共享汉字字集=2227
    ,简繁覆盖扩增字集纟共享汉字字集=2942
    ,共享汉字字集牜简繁覆盖扩增=5455
    #,已补全耂简繁对照纟简繁覆盖扩增字集纟共享汉字字集=6339 #含『:』『;』
    )
    d = globals()
    for nm in __all__:
        v = d[nm]
        if not type(v) is str: continue
        if not nm.isidentifier(): continue
        if not nm in except_nm2sz:

            smay_sz = rex__nondigits.split(nm)[-1]
            if not smay_sz: raise Exception(f'标识名不以字数结尾:{nm!r}#{len(v)!s}')
            sz__str = smay_sz
            sz = int(sz__str)
            if not len(v)==sz: raise Exception(f'标识名结尾处的字数{sz!s} 与 字符串实际长度{len(v)!s} 不同:{nm!r}')
        else:
            sz = except_nm2sz[nm]
            if not len(v)==sz: raise Exception(f'except_nm2sz记录的字数{sz!s} 与 字符串实际长度{len(v)!s} 不同:{nm!r}')
        if not len(v)==sz: raise logic-err
__(); del __

_post_checks
def __():
    # 后处理 之后 的 检查
    for check_ in _post_checks:
        check_()
__(); del __
from nn_ns.CJK.cjk_subsets.hanzi import *
