#__all__:goto
r'''[[[
e ../../python3_src/seed/int_tools/int_repr7lex_order7base__part2.py
from:
    e ../../python3_src/seed/int_tools/int_repr7lex_order7base.py
for:
    e ../../python3_src/seed/int_tools/int_repr7compact7lex_order7baseGL.py


seed.int_tools.int_repr7lex_order7base__part2
py -m nn_ns.app.debug_cmd   seed.int_tools.int_repr7lex_order7base__part2 -x # -off_defs
py -m nn_ns.app.doctest_cmd seed.int_tools.int_repr7lex_order7base__part2:__doc__ -ht # -ff -df
#######

[[
]]


'#'; __doc__ = r'#'
>>>



py_adhoc_call   seed.int_tools.int_repr7lex_order7base__part2   @f
]]]'''#'''
__all__ = r'''
魖自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置


魖匴全局参数设置纟自然数编解码器
    自然数巛位元串牜分离首胞乊规模纟字母表牜基准版扌
    自然数讠位元串乊规模纟字母表牜基准版扌


魖扩增自然数编码器
    乸异常牜出界
        魖分区表配置纟扩增自然数编码方案
        魖分区方案纟扩增自然数编码
        魖自由编码器
        魖缓存纟自由编码器


魖扩增自然数编码器
    魖自然数后手编解码器
    魖越界断头编解码器
    魖自然数分区断头编解码器






魖扩增自然数编码器
    魖自然数后手编解码器
        乸自然数后手编解码器牜无效
            无效后手编解码器牜自然数
                Error__TODO
    魖越界断头编解码器
        乸越界断头编解码器牜无效
            无效越界断头编解码器
                Error__TODO
    魖自然数分区断头编解码器
        乸自然数分区断头编解码器牜体胞符型唯一牜带偏移

魖自由编码器
    乸自然数自由编码器牜体胞符型唯一牜零偏移
    乸自然数自由编码器牜体胞符型唯一牜带偏移

魖匴全局参数设置纟自然数编解码器
    乸匴全局参数设置纟自然数编解码器

魖分区方案纟扩增自然数编码
    乸分区方案纟扩增自然数编码

魖缓存纟自由编码器
    乸缓存纟自由编码器

魖分区表配置纟扩增自然数编码方案
    乸分区表配置纟扩增自然数编码方案
        检查冫深度讠配置扌
        分区表巛区号讠分区方案扌

魖自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置
    乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置

Error__TODO
'''.split()#'''
    #uint5digits_
    #uint2digits_
__all__
___begin_mark_of_excluded_global_names__0___ = ...
from seed.abc.abc__ver1 import abstractmethod, override, ABC
from seed.helper.lazy_import__func7context import mk_ctx4lazy_import4funcs_ #NOTE:not support "as"
with mk_ctx4lazy_import4funcs_(__name__):
    from itertools import chain, accumulate, islice
    from bisect import bisect_right
    from functools import cached_property
    from seed.tiny_.check import check_type_le, check_type_is, check_int_ge, check_uint_lt, check_pair, check_all_, check_non_ABC
    from seed.for_libs.for_collections.namedtuple__nontuple4cached_property import mk_named_pseudo_tuple_
    #def mk_named_pseudo_tuple_(__module__,typename, field_names, /):
    #    def _check6make_(sf, /):
    from seed.types.FrozenDict import mk_FrozenDict
#.#################################
#.def mk_context4lazy_import_registered_names_(qnm4mdl7inject, qnm4pseudo_mdl7import, name7importZqnm4mdl, name7importZalias7inject={}, may_bifix4lazy_name7import=None, lazy_name7importZoriginal_name7import={}):
#.from seed.helper.lazy_import__func7context7register import mk_context4lazy_import_registered_names_, name7importZqnm4mdl_7tiny
#.with mk_context4lazy_import_registered_names_(__name__, 'seed._lazy_', name7importZqnm4mdl_7tiny):
#.    from seed._lazy_ import print_err, fst, echo, ifNone
#.#################################
from seed.int_tools.int_repr7lex_order7base import 魖自然数位元串表达牜词典序牜前置长度
    #乸整数位元串表达牜词典序牜前置长度牜整数零编码为单胞牜使用自然数编码器
if 1:from seed.int_tools.int_repr7lex_order7base import _魖共通, 魖数据位元串表达牜词典序牜前置长度
___end_mark_of_excluded_global_names__0___ = ...


class 魖匴全局参数设置纟自然数编解码器(_魖共通):
    '匴全局参数设置'
    __slots__ = ()
    r'''[[[
    必要:
        自然数巛位元串牜分离首胞乊规模纟字母表扌
        符型讠规模纟字母表
            #罓符型讠规模纟体胞
        位元串巛趃位元串牜子表扌
        位元串巛趃位元串乊规模纟字母表扌
            #xxx:罓体胞规模讠趃位元串讠位元串扌
        自然数讠位元串牜分离首胞乊规模纟字母表扌
            #罓体胞规模讠自然数讠位元串扌
    ]]]'''#'''
    @abstractmethod
    def 自然数巛位元串牜分离首胞乊规模纟字母表扌(sf, 规模纟字母表, 首胞, 位元串, /):
        '规模纟字母表 -> 首胞 -> 位元串 -> 自然数 #大端序#big_endian'
    @abstractmethod
    def 自然数讠位元串乊规模纟字母表扌(sf, 规模纟字母表, 自然数, /):
        '规模纟字母表 -> 自然数 -> 位元串 #大端序#big_endian'
def 自然数巛位元串牜分离首胞乊规模纟字母表牜基准版扌(规模纟字母表, 首胞, 位元串, /):
    '规模纟字母表 -> 首胞 -> 位元串 -> 自然数 #大端序#big_endian'
    check_int_ge(2, 规模纟字母表)
    check_int_ge(0, 首胞)
    radix = 规模纟字母表
    #digits = 位元串 if 首胞 == 0 else chain([首胞], 位元串)
    u = 首胞
    for digit in 位元串:
        u *= radix
        u += digit
    return u
def 自然数讠位元串乊规模纟字母表牜基准版扌(位元串巛趃位元串乊规模纟字母表扌, 规模纟字母表, 自然数, /):
    '规模纟字母表 -> 自然数 -> 位元串 #大端序#big_endian'
    check_int_ge(2, 规模纟字母表)
    check_int_ge(0, 自然数)
    radix = 规模纟字母表
    u = 自然数
    digits = []
    while u:
        (u, digit) = divmod(u, radix)
        digits.append(digit)
    assert u == 0
    位元串 = 位元串巛趃位元串乊规模纟字母表扌(radix, reversed(digits))
    return 位元串



#.class 乸分区表配置纟自然数编码方案:
#.    r'''[[[
#.    [分区表配置 :: (分区表页纟前导节, , 后手配置)]
#.    [后手配置 == (后手处理器|分区表页纟循环节)]
#.    [后手处理器 :: (???魖自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置???)]
#.        考虑到要同时兼顾 编码、解码，最好还是 避免使用 后手处理器
#.    [分区表页纟前导节,分区表页纟循环节 :: [分区表纟单胞]]
#.    [分区表纟单胞 :: (符型, [(规模纟占位, 体胞数纟首层, 增量纟总层数, 符型描述...)])]
#.        #增量:[起始总层数:=0]
#.
#.    [分区表页纟首双节 :: [分区表纟单胞]]
#.    [分区表页纟首双节 == 分区表页纟前导节++分区表页纟循环节]
#.
#.    规模纟头胞
#.    规模纟体胞
#.    首双节址引讠位元冃深入指示符
#.    首双节址引讠终末总层数#立即深入
#.    首双节址引讠区号讠偏移量纟位元#bisect
#.
#.    ]]]'''#'''
#.    def __init__(sf, 规模纟体胞, 分区表纟前导节, 后手处理器丨分区表页纟循环节, /):
#.        check_int_ge(0, 规模纟体胞)
#.        check_type_is(tuple, 分区表纟前导节)
#.        检查冫分区表页扌(分区表页纟前导节, 欤允空=True)
#.        match 后手处理器丨分区表页纟循环节:
#.            case 魖自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置(后手处理器):
#.                欤循环节 = False
#.                分区表页纟首双节 = 分区表页纟前导节
#.                长度纟尾循环节 = 0
#.            case tuple(分区表页纟循环节):
#.                check_type_is(tuple, 分区表页纟循环节)
#.                if not 分区表页纟循环节:raise TypeError
#.                检查冫分区表页扌(分区表页纟循环节, 欤允空=False)
#.                欤循环节 = True
#.                分区表页纟首双节 = 分区表页纟前导节 + 分区表页纟循环节
#.                长度纟尾循环节 = len(分区表页纟循环节)
#.            case _:
#.                raise TypeError(type(后手处理器丨分区表页纟循环节), (魖自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置, tuple))
#.            #case
#.
#.        #sf._x = (欤循环节, 后手处理器丨分区表页纟循环节)
#.        assert 欤循环节 is bool(长度纟尾循环节)
#.        #sf._x = (长度纟尾循环节, 后手处理器丨分区表页纟循环节)
#.        sf._b = 规模纟体胞
#.        sf._r = 长度纟尾循环节
#.        sf._m = None if 长度纟尾循环节 else 后手处理器丨分区表页纟循环节)
#.        sf._w = 分区表页纟首双节
#.        检查冫分区表页扌(分区表页纟首双节, 欤允空=False)
#.
#.    @property
#.    def 规模纟体胞(sf, /):
#.        return sf._b
#.    @property
#.    def 长度纟尾循环节(sf, /):
#.        return sf._r
#.    @property
#.    def 鬽后手处理器(sf, /):
#.        return sf._m
#.    @property
#.    def 分区表页纟首双节(sf, /):
#.        return sf._w
#.
#.    @cached_property
#.    def 增量纟总层数纟前导节(sf, /):
#.    @cached_property
#.    def 增量纟总层数纟循环节(sf, /):
#.    @cached_property
#.    def 首双节址引讠位元冃深入指示符(sf, /):
#.    @cached_property
#.    def 首双节址引讠终末总层数(sf, /):
#.        首双节址引讠终末总层数 = []
#.        首双节址引讠区号讠总层数 = []
#.        起始偏移量纟总层数 = 0
#.        for 分区表纟单胞 in sf.分区表页纟首双节:
#.            列表纟偏移量纟总层数 = tuple(accumulate((增量纟总层数 for (规模纟占位, 体胞数纟首层, 增量纟总层数) in 分区表纟单胞), initial=起始偏移量纟总层数))
#.            #区号讠偏移量纟总层数 = 列表纟偏移量纟总层数[:-1]
#.            区号讠总层数 = 列表纟偏移量纟总层数[1:]
#.            终末总层数 = 列表纟偏移量纟总层数[-1]
#.            首双节址引讠区号讠总层数.append(区号讠总层数)
#.            首双节址引讠终末总层数.append(终末总层数)
#.            起始偏移量纟总层数 = 终末总层数
#.    @cached_property
#.    def 首双节址引讠区号讠偏移量纟位元(sf, /):
#.        首双节址引讠区号讠偏移量纟位元 = []
#.        首双节址引讠位元冃深入指示符 = []
#.        for 分区表纟单胞 in sf.分区表页纟首双节:
#.            列表纟偏移量纟位元 = tuple(accumulate(map(fst, 分区表纟单胞), initial=0))
#.            区号讠偏移量纟位元 = 列表纟偏移量纟位元[:-1]
#.            位元冃深入指示符 = 列表纟偏移量纟位元[-1]
#.            首双节址引讠区号讠偏移量纟位元.append(区号讠偏移量纟位元)
#.            首双节址引讠位元冃深入指示符.append(位元冃深入指示符)
#.    def 趃编码冫自然数扌(sf, 自然数, /):
#.        '自然数/uint -> (头胞, 趃体胞串串/(Iter 位元串牜体胞))'
#.    def 趃解码冫自然数扌(sf, 头胞, 符型牜体胞, 定型定长前取器, /):
#.        '头胞 -> 符型牜体胞 -> 乸定型定长前取器 -> Iter [(总长度纟深入指示符串,有效头胞); (区号, 偏移量纟位元, 规模纟占位, 头位元牜分区, 体胞数纟首层, 总层数{>=1}); 前置长度...{len=总层数-1};自然数/uint]'
#.        #'(头胞, 趃体胞串/(Iter 位元牜体胞)) -> Iter [前置长度...;自然数/uint]'
#.def 检查冫分区表页扌(分区表页, /, *, 欤允空):
class 魖分区方案纟扩增自然数编码(ABC):
    '分区方案'
    __slots__ = ()
    @property
    @abstractmethod
    def 总层数(sf, /):
        '-> uint{>=1}'
    @property
    @abstractmethod
    def 规模纟占位(sf, /):
        '-> uint{>=1}'
    @property
    @abstractmethod
    def 体胞数纟首层(sf, /):
        '-> uint{>=0}'
    @property
    @abstractmethod
    def 符型牜首层体胞(sf, /):
        '-> uint{>=0}'
    @property
    @abstractmethod
    def 分区编解码器(sf, /):
        '-> 断头编解码器牜分区自然数/魖自然数分区断头编解码器'
        乸自然数分区断头编解码器牜体胞符型唯一牜带偏移
    @property
    #@abstractmethod
    def 自由编码器(sf, /):
        #用于:替代:兼容型纟编码
        '-> 魖自由编码器/hashable'
        return sf.分区编解码器.自由编码器
        #.@property
        #.@abstractmethod
        #.def 兼容型纟编码(sf, /):
        #.    '-> hashable'
    def 编码牜分区扌(sf, 缓存纟自由编码器, 自然数, /):
        '只读:缓存纟自由编码器 -> 自然数 -> 层号讠带符型位元串/[(符型,位元串)] | ^乸异常牜出界'
        层号讠带符型位元串 = sf.分区编解码器.转自由编码扌(缓存纟自由编码器, 自然数)
            # ^乸异常牜出界
        #检查:总层数、规模纟占位、体胞数纟首层...
        匴全局参数设置 = 缓存纟自由编码器.匴全局参数设置
        分区方案 = sf
        总层数 = 分区方案.总层数
        层号讠带符型位元串 = _限制为总层数扌(匴全局参数设置, 总层数, 层号讠带符型位元串)
        长度纟首层 = 1+分区方案.体胞数纟首层
        层号讠带符型位元串 = _限制为长度纟首层扌(匴全局参数设置, 长度纟首层, 层号讠带符型位元串)
            #^乸异常牜出界
        位元串纟首层 = 层号讠带符型位元串[0][1]
        首胞牜分区 = 位元串纟首层[0]
        if not (len(层号讠带符型位元串) == 分区方案.总层数 and 首胞牜分区 < 分区方案.规模纟占位 and len(位元串纟首层) == 1+分区方案.体胞数纟首层):raise 乸异常牜出界#TypeError
        return 层号讠带符型位元串
def _限制为总层数扌(匴全局参数设置, 总层数, 层号讠带符型位元串, /):
    saved = 层号讠带符型位元串
    (符型纟首层, 位元串纟首层) = 层号讠带符型位元串[0]
    if len(层号讠带符型位元串) > 总层数:
        层号讠带符型位元串 = 层号讠带符型位元串[len(层号讠带符型位元串) - 总层数:]
        assert len(层号讠带符型位元串) == 总层数
    elif len(层号讠带符型位元串) < 总层数:
        #raise 乸异常牜出界(sf, 总层数, len(层号讠带符型位元串), 层号讠带符型位元串)
        (符型纟首层, 位元串纟首层) = 层号讠带符型位元串[0]
        assert len(位元串纟首层) == 1, (层号讠带符型位元串)
        串一牜子表 = 匴全局参数设置.位元串巛趃位元串牜子表扌(符型纟首层, [1])
        层号讠带符型位元串 = ((符型纟首层, 串一牜子表),)*(总层数 -len(层号讠带符型位元串)) + 层号讠带符型位元串
        (符型纟首层, 位元串纟首层) = 层号讠带符型位元串[0]
    层号讠带符型位元串

    if not len(层号讠带符型位元串) == 总层数:raise 000
    if not len(层号讠带符型位元串) >= 1:raise TypeError

    try:
        (符型纟首层, 位元串纟首层) = 层号讠带符型位元串[0]
    except ValueError:
        raise ValueError(总层数, saved, 层号讠带符型位元串)
    if not len(位元串纟首层) >= 1:raise TypeError
    首胞牜分区 = 位元串纟首层[0]
    check_int_ge(0, 首胞牜分区)
    return 层号讠带符型位元串
class 乸异常牜出界(Exception):pass
class 魖扩增自然数编码器(ABC):
    '编码器牜扩增自然数'
    __slots__ = ()
    @property
    @abstractmethod
    def 自由编码器(sf, /):
        '-> 魖自由编码器'
    def 转自由编码扌(sf, 缓存纟自由编码器, 扩增自然数, /):
        #用于:替代:编码扌
        '只读:缓存纟自由编码器 -> 扩增自然数 -> 层号讠带符型位元串/[(符型,位元串)] | ^乸异常牜出界'
        return sf.自由编码器.自由编码扌(缓存纟自由编码器, 扩增自然数)
            # ^乸异常牜出界

        #.层号讠带符型位元串 = 缓存纟自由编码器.扩增自然数讠自由编码器讠层号讠带符型位元串扌(扩增自然数, sf.自由编码器)
            # ^乸异常牜出界
        #.return 层号讠带符型位元串
    #.@abstractmethod
    #.def 编码扌(sf, 兼容型讠层号讠带符型位元串, 扩增自然数, /):
    #.    '兼容型讠层号讠带符型位元串/{兼容型:层号讠带符型位元串} -> 扩增自然数 -> 层号讠带符型位元串/[(符型,位元串)]'
    #.#.@abstractmethod
    #.#.def 解码牜鬽首胞扌(sf, 鬽首胞牜子表, 定型定长前取器, /):
    #.#.    '鬽首胞牜子表 -> 定型定长前取器 -> 扩增自然数'
class 魖自然数后手编解码器(魖扩增自然数编码器):
    '后手编解码器牜自然数'
    __slots__ = ()
    @abstractmethod
    def 解码牜未必有首胞扌(sf, 匴全局参数设置, 定型定长前取器, /):
        '匴全局参数设置 -> 定型定长前取器 -> 自然数'
#.class 魖扩增自然数断头编解码器(魖扩增自然数编码器):
#.    '断头编解码器牜扩增自然数 #越界编解码器、分区编解码器'
#.    __slots__ = ()
#.    #.@property
#.    #.@abstractmethod
#.    #.def 符型牜首胞(sf, /):
#.    #.    '-> uint{>=0}'
#.    #.@property
#.    #.@abstractmethod
#.    #.def 偏移量纟首胞(sf, /):
#.    #.    '-> uint{>=0}'
#.
#.    @abstractmethod
#.    def 解码牜分离首胞扌(sf, 首胞牜子表, 定型定长前取器, /):
#.        '首胞牜子表/uint -> 定型定长前取器 -> 扩增自然数'
class 魖越界断头编解码器(魖扩增自然数编码器):
    __slots__ = ()
    @abstractmethod
    def 解码牜分离首胞牜越界扌(sf, 匴全局参数设置, 首胞牜子表, 定型定长前取器, /):
        '匴全局参数设置 -> 首胞牜子表/uint -> 定型定长前取器 -> 扩增自然数'
class 魖自然数分区断头编解码器(魖扩增自然数编码器):
    #class 魖分区自然数断头编解码器(魖扩增自然数断头编解码器:):
    '断头编解码器牜分区自然数 #分区编解码器'
    __slots__ = ()
    @abstractmethod
    def 解码牜分离首胞牜分区扌(sf, 匴全局参数设置, 首胞牜子表, 定型定长前取器, /):
        '匴全局参数设置 -> 首胞牜子表/uint -> 定型定长前取器 -> 扩增自然数'

class 魖缓存纟自由编码器(ABC):
    '缓存纟自由编码器'
    __slots__ = ()
    @property
    @abstractmethod
    def 匴全局参数设置(sf, /):
        '-> 魖匴全局参数设置纟自然数编解码器'
    @property
    @abstractmethod
    def 罓扩增自然数讠自由编码器讠层号讠带符型位元串(sf, /):
        '-> 扩增自然数讠自由编码器讠层号讠带符型位元串/{扩增自然数:{自由编码器:层号讠带符型位元串}}'
    @property
    @abstractmethod
    def 罓体胞规模讠自然数讠位元串(sf, /):
        '-> 体胞规模讠自然数讠位元串/{规模纟体胞:{自然数:位元串}}'
    #########
    #########
    #########
    @property
    #@abstractmethod
    def 罓符型讠规模纟体胞(sf, /):
        '-> 符型讠规模纟体胞/{符型:规模纟体胞}'
        return sf.匴全局参数设置.符型讠规模纟字母表
    #@abstractmethod
    def 罓体胞规模讠自然数讠位元串扌(sf, 规模纟体胞, 自然数, /):
        '规模纟体胞 -> 自然数 -> 位元串'
        if 自然数 == 0:
            return sf.匴全局参数设置.位元串巛趃位元串乊规模纟字母表扌(规模纟体胞, [0])
        return sf.匴全局参数设置.自然数讠位元串乊规模纟字母表扌(规模纟体胞, 自然数)
        #.#@abstractmethod
        #.def 罓体胞规模讠趃位元串讠位元串扌(sf, 规模纟体胞, 趃位元串, /):
        #.    '规模纟体胞 -> 趃位元串/(Iter 位元) -> 位元串'
        #.    return sf.匴全局参数设置.位元串巛趃位元串乊规模纟字母表扌(规模纟体胞, 趃位元串)
        #.@abstractmethod
        #.def 罓体胞规模讠自然数讠趃位元串扌(sf, 规模纟体胞, 自然数, /):
        #.    '规模纟体胞 -> 自然数 -> 趃位元串/(Iter 位元)'
    #########
    #########
    #主要方法:
    #:def 符型讠自然数讠带符型位元串扌(sf, 符型, 自然数, /):
    #:def 扩增自然数讠自由编码器讠层号讠带符型位元串扌(sf, 扩增自然数, 自由编码器, /):
    #########
    def 符型讠自然数讠带符型位元串扌(sf, 符型, 自然数, /):
        '符型 -> 自然数 -> 带符型位元串/(符型,位元串)'
        规模纟体胞 = sf.罓符型讠规模纟体胞[符型]
        自然数讠位元串 = sf.罓体胞规模讠自然数讠位元串.setdefault(规模纟体胞, {})
        if not None is (位元串:=自然数讠位元串.get(自然数)):
            带符型位元串 = (符型, 位元串)
            return 带符型位元串
        #.趃位元串 = sf.罓体胞规模讠自然数讠趃位元串扌(规模纟体胞, 自然数)
        #.位元串 = sf.罓体胞规模讠趃位元串讠位元串扌(规模纟体胞, 趃位元串)
        位元串 = sf.罓体胞规模讠自然数讠位元串扌(规模纟体胞, 自然数)
        if not 位元串:raise 000
        自然数讠位元串[自然数] = 位元串
        带符型位元串 = (符型, 位元串)
        return 带符型位元串

    def 扩增自然数讠自由编码器讠层号讠带符型位元串扌(sf, 扩增自然数, 自由编码器, /):
        '扩增自然数 -> 自由编码器 -> 层号讠带符型位元串/[(符型,位元串)] | ^乸异常牜出界'
        自由编码器讠层号讠带符型位元串 = sf.罓扩增自然数讠自由编码器讠层号讠带符型位元串.setdefault(扩增自然数, {})
        if not None is (层号讠带符型位元串:=自由编码器讠层号讠带符型位元串.get(自由编码器)):
            return 层号讠带符型位元串
        层号讠带符型位元串 = 自由编码器.罓自由编码扌(sf, 扩增自然数)
            # ^乸异常牜出界
        check_type_is(tuple, 层号讠带符型位元串)
        if not 层号讠带符型位元串:raise 000
        check_type_is(tuple, 层号讠带符型位元串[0])
        (符型, 位元串) = 层号讠带符型位元串[0]
        if not 层号讠带符型位元串[0][1]:raise 000
        自由编码器讠层号讠带符型位元串[自由编码器] = 层号讠带符型位元串
        return 层号讠带符型位元串
    #########
    #########
class 魖自由编码器(ABC):
    '自由编码器:总层数 不受控制#兼容型纟编码#hashable'
    __slots__ = ()
    @abstractmethod
    def 罓自由编码扌(sf, 缓存纟自由编码器, 扩增自然数, /):
        '只读:缓存纟自由编码器 -> 扩增自然数 -> 层号讠带符型位元串/[(符型,位元串)] | ^乸异常牜出界'
    @property
    @abstractmethod
    def _args4hash_(sf, /):
        raise NotImplementedError
    def __hash__(sf, /):
        return hash((type(sf), sf._args4hash_))
    def __eq__(sf, ot, /):
        return ot is sf or (type(ot) is type(sf) and ot._args4hash_ == sf._args4hash_)
    def 自由编码扌(sf, 缓存纟自由编码器, 扩增自然数, /):
        #用于:替代:编码扌
        '只读:缓存纟自由编码器 -> 扩增自然数 -> 层号讠带符型位元串/[(符型,位元串)] | ^乸异常牜出界'
        层号讠带符型位元串 = 缓存纟自由编码器.扩增自然数讠自由编码器讠层号讠带符型位元串扌(扩增自然数, sf)
            # ^乸异常牜出界
        return 层号讠带符型位元串
class 魖分区表配置纟扩增自然数编码方案(ABC):
    '分区表配置纟扩增自然数编码方案'
    __slots__ = ()
    #乸分区表配置纟扩增自然数编码方案
    #'-> ([(符型, [分区方案], 越界断头编解码器牜扩增自然数)], 后手编解码器)'
    @property
    @abstractmethod
    def 后手编解码器(sf, /):
        '-> 后手编解码器牜自然数/魖自然数后手编解码器'
    @abstractmethod
    def 枚举冫符型辻深入指示符扌(sf, /):
        '-> Iter (符型牜首胞, 深入指示符)'
    @abstractmethod
    def 查询冫长度纟深入指示符串讠分区表扌(sf, 长度纟深入指示符串, /):
        '长度纟深入指示符串 -> 分区表/(区号讠偏移量纟位元, 位元冃深入指示符) | ^LookupError'
    @abstractmethod
    def 查询冫分区定位讠分区方案扌(sf, 长度纟深入指示符串, 区号, /):
        '长度纟深入指示符串 -> 区号 -> 分区方案'
    @abstractmethod
    def 查询冫长度纟深入指示符串讠越界编解码器扌(sf, 长度纟深入指示符串, /):
        '长度纟深入指示符串 -> 越界断头编解码器牜扩增自然数/魖越界断头编解码器'
        #def 构造冫越界编解码器辻首胞牜分区巛语境扌(sf, 长度纟深入指示符串, 首胞, /):
        #    '长度纟深入指示符串 -> 首胞 -> (断头编解码器牜扩增自然数/魖越界断头编解码器, 首胞牜分区)'


class 魖自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置(魖自然数位元串表达牜词典序牜前置长度):
    'see:魖分区表配置纟扩增自然数编码方案'
    #'see:乸分区表配置纟自然数编码方案'
    __slots__ = ()
    r'''[[[
解码:
    越界编解码器:超过 深入指示符 #但 小于 规模纟首胞{符型牜首胞}
        #xxx:构造冫越界编解码器巛语境扌
        #xxx:构造冫越界编解码器辻首胞牜分区巛语境扌
        查询冫长度纟深入指示符串讠越界编解码器扌
    后手编解码器:长度纟深入指示符串 达到最大值
    枚举冫符型辻深入指示符扌
        -> Iter (符型牜首胞, 深入指示符)
        ^ => 越界编解码器
    #=>长度纟深入指示符串
    查询冫长度纟深入指示符串讠分区表扌
        长度纟深入指示符串 -> 分区表
        [分区表==(区号讠偏移量纟位元, 位元冃深入指示符)]
        ... => 后手编解码器
    #=>区号
    #=>分区定位
    查询冫分区定位讠分区方案扌
    #=>分区方案
    #=>分区编解码器
编码:
    提前探测冫鬽分区越界定位巛扩增自然数扌
        扩增自然数 -> 鬽 分区定位
        [分区越界定位 :: 鬽(长度纟深入指示符串, 鬽区号)]
        [分区定位 :: (长度纟深入指示符串, 区号)]
            用于:小型整数 或 某些有特色偏移的分区编码方案{自然数偏移、前置长度偏移}
    #=>分区定位
    查询冫分区定位讠分区方案扌
        长度纟深入指示符串 -> 区号 -> 分区方案
        [分区方案 :: (规模纟占位, 偏移量纟首胞, 符型牜首层体胞, 体胞数纟首层, 总层数{>=1}, 兼容型纟编码{分区编解码器{各层偏移量,各层符型}}, ...)]
            兼容型纟编码-固定某种编码方案(偏移+符型...)，只有 总层数 未确定，编码后才知道
            兼容型纟编码-->自由编码器#缓存纟自由编码器
    #=>分区方案

    枚举冫符型辻深入指示符扌
    查询冫长度纟深入指示符串讠分区表扌
    查询冫分区定位讠分区方案扌
    #=>编码串串{兼容型纟编码}:总层数{兼容型纟编码}
    #=>分区方案:首个总层数匹配
    #=>分区编解码器
]]]'''#'''

    @property
    @abstractmethod
    def 匴全局参数设置(sf, /):
        '-> 魖匴全局参数设置纟自然数编解码器'
    @abstractmethod
    def 构造冫缓存纟自由编码器扌(sf, /):
        '-> 缓存纟自由编码器'
    @abstractmethod
    def 提前探测冫鬽分区越界定位巛扩增自然数扌(sf, 扩增自然数, /):
        '扩增自然数 -> 鬽分区越界定位/(鬽 分区越界定位/(长度纟深入指示符串, 鬽区号))'
    @property
    @abstractmethod
    def 分区表配置纟扩增自然数编码方案(sf, /):
        '-> 魖分区表配置纟扩增自然数编码方案'
    @cached_property
    def 深度纟后手(sf, /):
        '-> 长度纟深入指示符串{后手编解码器}'
        return len([*sf.分区表配置纟扩增自然数编码方案.枚举冫符型辻深入指示符扌()])
    def 趃序列纟带符型位元串冃深入指示符串巛长度扌(sf, 长度纟深入指示符串, /):
        '长度纟深入指示符串 -> 趃序列纟带符型位元串{深入指示符串}'
        it = sf.分区表配置纟扩增自然数编码方案.枚举冫符型辻深入指示符扌()
        it = islice(it, 0, 长度纟深入指示符串)
        sz = 0
        for sz, (符型牜首胞, 深入指示符) in enumerate(it, 1):
            位元串牜子表 = sf.位元串巛趃位元串牜子表扌(符型牜首胞, [深入指示符])
            yield (符型牜首胞, 位元串牜子表)
        if not sz == 长度纟深入指示符串:raise Exception(sf, 长度纟深入指示符串, sz)
    @override
    def 罓解读冫数据巛定型定长前取器扌(sf, 定型定长前取器, /):
        '乸定型定长前取器{位元{符型}} -> 数据'
        长度纟深入指示符串 = 0
        for (符型牜首胞, 深入指示符) in sf.分区表配置纟扩增自然数编码方案.枚举冫符型辻深入指示符扌():
            [首胞] = 定型定长前取器.读取冫位元串牜子表扌(符型牜首胞, 数目:=1)
            if not 首胞 == 深入指示符:
                break
            长度纟深入指示符串 += 1
        else:
            数据 = 自然数 = sf.分区表配置纟扩增自然数编码方案.后手编解码器.解码牜未必有首胞扌(sf.匴全局参数设置, 定型定长前取器)
            return 数据

        长度纟深入指示符串, 首胞
        if not 0 <= 首胞 < 深入指示符:
            首胞牜越界 = 首胞 -深入指示符 -1
            #(越界编解码器, 首胞牜分区) = sf.构造冫越界编解码器辻首胞牜分区巛语境扌(长度纟深入指示符串, 首胞牜越界)
            越界编解码器 = sf.分区表配置纟扩增自然数编码方案.查询冫长度纟深入指示符串讠越界编解码器扌(长度纟深入指示符串)
            数据 = 扩增自然数 = 越界编解码器.解码牜分离首胞牜越界扌(sf.匴全局参数设置, 首胞牜越界, 定型定长前取器)
            return 数据

        长度纟深入指示符串, 首胞
        分区表 = sf.分区表配置纟扩增自然数编码方案.查询冫长度纟深入指示符串讠分区表扌(长度纟深入指示符串)
            # !! 前面 枚举 得来的 长度纟深入指示符串...
        (区号讠偏移量纟位元, 位元冃深入指示符) = 分区表
        if not 位元冃深入指示符 == 深入指示符:raise TypeError
        区号 = -1+bisect_right(区号讠偏移量纟位元, 首胞)
        assert 0 <= 区号 < len(区号讠偏移量纟位元)
        偏移量纟首胞牜分区 = 区号讠偏移量纟位元[区号]
        首胞牜分区 = 首胞 -偏移量纟首胞牜分区
        分区方案 = sf.分区表配置纟扩增自然数编码方案.查询冫分区定位讠分区方案扌(长度纟深入指示符串, 区号)
        数据 = 自然数 = 分区方案.分区编解码器.解码牜分离首胞牜分区扌(sf.匴全局参数设置, 首胞牜分区, 定型定长前取器)
        return 数据



    @override
    def 罓表述冫数据讠趃序列纟带符型位元串扌(sf, 数据, /):
        '数据 -> 趃序列纟带符型位元串/(Iter 带符型位元串/(符型/uint%len(符型讠规模纟字母表), 位元串牜子表/[位元{符型}]/(tuple|bytes|WordSeq)))'
        扩增自然数 = 数据
        (鬽分区越界定位, 缓存纟自由编码器) = sf.扩增自然数讠丮鬽分区越界定位丶缓存纟自由编码器厈扌(扩增自然数)
        if 鬽分区越界定位 is None:
            # !! 非自然数分区 必然 越界
            自然数 = 扩增自然数
            层号讠带符型位元串 = sf.分区表配置纟扩增自然数编码方案.后手编解码器.转自由编码扌(缓存纟自由编码器, 自然数)
            if not len(层号讠带符型位元串) >= 1:raise TypeError
            if not len(位元串纟首层:=层号讠带符型位元串[0][1]) >= 1:raise TypeError
            位元串纟首层 = 层号讠带符型位元串[0][1]
            首胞 = 位元串纟首层[0]
            check_int_ge(0, 首胞)
            长度纟深入指示符串 = sf.深度纟后手
        else:
            (长度纟深入指示符串, 鬽区号) = 分区越界定位= 鬽分区越界定位
            分区表 = sf.分区表配置纟扩增自然数编码方案.查询冫长度纟深入指示符串讠分区表扌(长度纟深入指示符串)
                # !! 前面 枚举 得来的 长度纟深入指示符串...
            (区号讠偏移量纟位元, 位元冃深入指示符) = 分区表
            if 鬽区号 is None:
                越界编解码器 = sf.分区表配置纟扩增自然数编码方案.查询冫长度纟深入指示符串讠越界编解码器扌(长度纟深入指示符串)
                层号讠带符型位元串 = 越界编解码器.转自由编码扌(缓存纟自由编码器, 扩增自然数)
                if not len(层号讠带符型位元串) >= 1:raise TypeError
                if not len(位元串纟首层:=层号讠带符型位元串[0][1]) >= 1:raise TypeError
                位元串纟首层 = 层号讠带符型位元串[0][1]
                首胞牜越界 = 位元串纟首层[0]
                check_int_ge(0, 首胞牜越界)
                偏移量纟首胞牜越界 = 1+位元冃深入指示符
                首胞 = 首胞牜越界 +偏移量纟首胞牜越界
                check_int_ge(偏移量纟首胞牜越界, 首胞)
            else:
                区号 = 鬽区号
                自然数 = 扩增自然数

                分区方案 = sf.分区表配置纟扩增自然数编码方案.查询冫分区定位讠分区方案扌(长度纟深入指示符串, 区号)
                #.层号讠带符型位元串 = 分区方案.分区编解码器.转自由编码扌(缓存纟自由编码器, 自然数)
                try:
                    层号讠带符型位元串 = 分区方案.编码牜分区扌(缓存纟自由编码器, 自然数)
                        # ^乸异常牜出界
                except 乸异常牜出界 as exc:
                    raise 乸异常牜出界(sf, 自然数, 分区越界定位, exc)
                if not len(层号讠带符型位元串) >= 1:raise TypeError
                if not len(位元串纟首层:=层号讠带符型位元串[0][1]) >= 1:raise TypeError
                位元串纟首层 = 层号讠带符型位元串[0][1]
                首胞牜分区 = 位元串纟首层[0]
                check_int_ge(0, 首胞牜分区)
                总层数 = len(层号讠带符型位元串)
                if not (总层数 == 分区方案.总层数 and 首胞牜分区 < 分区方案.规模纟占位 and len(位元串纟首层) == 1+分区方案.体胞数纟首层):raise TypeError


                区号
                assert 0 <= 区号 < len(区号讠偏移量纟位元)
                偏移量纟首胞牜分区 = 区号讠偏移量纟位元[区号]
                首胞 = 首胞牜分区 +偏移量纟首胞牜分区
                check_uint_lt(位元冃深入指示符, 首胞)
            层号讠带符型位元串, 首胞
            #窜改/替换:层号讠带符型位元串:首胞牜分区or首胞牜越界-->首胞
            if not 0 == 偏移量纟首胞牜分区:
                符型牜首胞 = 层号讠带符型位元串[0][0]
                位元串纟首层 = sf.位元串巛趃位元串牜子表扌(符型牜首胞, chain([首胞], 位元串纟首层[1:]))
                层号讠带符型位元串 = ((符型牜首胞, 位元串纟首层), *层号讠带符型位元串[1:])
            层号讠带符型位元串

        层号讠带符型位元串
        长度纟深入指示符串
        yield from sf.趃序列纟带符型位元串冃深入指示符串巛长度扌(长度纟深入指示符串)
        yield from iter(层号讠带符型位元串)
        return

    def 扩增自然数讠丮鬽分区越界定位丶缓存纟自由编码器厈扌(sf, 扩增自然数, /):
        鬽分区越界定位 = sf.提前探测冫鬽分区越界定位巛扩增自然数扌(扩增自然数)
        if 鬽分区越界定位 is None:
            # !! 非自然数分区 必然 越界
            自然数 = 扩增自然数
            (鬽分区定位, 缓存纟自由编码器) = sf.自然数讠丮鬽分区定位丶缓存纟自由编码器厈牜未短路版扌(自然数)
            鬽分区越界定位 = 鬽分区定位
        else:
            #.兼容型讠层号讠带符型位元串 = {}
            缓存纟自由编码器 = sf.构造冫缓存纟自由编码器扌()
        #分区定位 = (长度纟深入指示符串, 区号)
        return (鬽分区越界定位, 缓存纟自由编码器)
    def 枚举冫分区定位扌(sf, /):
        长度纟深入指示符串 = -1
        for 长度纟深入指示符串, (符型牜首胞, 深入指示符) in enumerate(sf.分区表配置纟扩增自然数编码方案.枚举冫符型辻深入指示符扌()):
            分区表 = sf.分区表配置纟扩增自然数编码方案.查询冫长度纟深入指示符串讠分区表扌(长度纟深入指示符串)
                # !! 前面 枚举 得来的 长度纟深入指示符串...
            (区号讠偏移量纟位元, 位元冃深入指示符) = 分区表
            if not 位元冃深入指示符 == 深入指示符:raise TypeError(sf, 长度纟深入指示符串, (符型牜首胞, 深入指示符), 分区表)
            for 区号 in range(len(区号讠偏移量纟位元)):
                分区定位 = (长度纟深入指示符串, 区号)
                yield 分区定位
    def 自然数讠丮鬽分区定位丶缓存纟自由编码器厈牜未短路版扌(sf, 自然数, /):
        #.兼容型讠层号讠带符型位元串 = {}
        缓存纟自由编码器 = sf.构造冫缓存纟自由编码器扌()
        for (长度纟深入指示符串, 区号) in sf.枚举冫分区定位扌():
            分区方案 = sf.分区表配置纟扩增自然数编码方案.查询冫分区定位讠分区方案扌(长度纟深入指示符串, 区号)
            #.层号讠带符型位元串 = _兼容型讠层号讠带符型位元串扌(缓存纟自由编码器, 分区方案, 自然数)
            #.层号讠带符型位元串 = 分区方案.分区编解码器.转自由编码扌(缓存纟自由编码器, 自然数)
            try:
                层号讠带符型位元串 = 分区方案.编码牜分区扌(缓存纟自由编码器, 自然数)
                    # ^乸异常牜出界
            except 乸异常牜出界:
                continue
            位元串纟首层 = 层号讠带符型位元串[0][1]
            首胞牜分区 = 位元串纟首层[0]
            check_int_ge(0, 首胞牜分区)
            总层数 = len(层号讠带符型位元串)
            if 总层数 == 分区方案.总层数 and 首胞牜分区 < 分区方案.规模纟占位 and len(位元串纟首层) == 1+分区方案.体胞数纟首层:
                分区定位 = (长度纟深入指示符串, 区号)
                鬽分区定位 = 分区定位
                break
        else:
            长度纟深入指示符串 += 1
            鬽分区定位 = None
        鬽分区定位
        return (鬽分区定位, 缓存纟自由编码器)


def _兼容型讠层号讠带符型位元串扌(缓存纟自由编码器, 分区方案, 自然数, /):
    层号讠带符型位元串 = 分区方案.编码牜分区扌(缓存纟自由编码器, 自然数)
        # ^乸异常牜出界
    return 层号讠带符型位元串
    #.return 分区方案.分区编解码器.转自由编码扌(缓存纟自由编码器, 自然数)

    #.兼容型 = 分区方案.兼容型纟编码
    #.match 兼容型讠层号讠带符型位元串.get(兼容型):
    #.    cas None:
    #.        层号讠带符型位元串 = 分区方案.分区编解码器.转自由编码扌(缓存纟自由编码器, 自然数)
    #.        if not len(层号讠带符型位元串) >= 1:raise TypeError
    #.        if not len(位元串纟首层:=层号讠带符型位元串[0][1]) >= 1:raise TypeError
    #.        #if not all(map(len, 层号讠带符型位元串)):raise TypeError
    #.        兼容型讠层号讠带符型位元串[兼容型] = 层号讠带符型位元串
    #.    case 层号讠带符型位元串:
    #.        pass
    #.return 层号讠带符型位元串



class Error__TODO(NotImplementedError):pass
class 乸自然数后手编解码器牜无效(魖自然数后手编解码器):
    '无效后手编解码器牜自然数'
    __slots__ = ()
    #.@override
    #.def 转自由编码扌(sf, 缓存纟自由编码器, 扩增自然数, /):
    #.    raise Error__TODO
    @property
    @override
    def 自由编码器(sf, /):
        raise Error__TODO(sf)
    @override
    def 解码牜未必有首胞扌(sf, 匴全局参数设置, 定型定长前取器, /):
        raise Error__TODO(sf)
无效后手编解码器牜自然数 = 乸自然数后手编解码器牜无效()


class 乸越界断头编解码器牜无效(魖越界断头编解码器):
    '无效越界断头编解码器{扩增自然数}'
    __slots__ = ()
    #.@override
    #.def 转自由编码扌(sf, 缓存纟自由编码器, 扩增自然数, /):
    #.    raise Error__TODO
    @property
    @override
    def 自由编码器(sf, /):
        raise Error__TODO(sf)
    @override
    def 解码牜分离首胞牜越界扌(sf, 匴全局参数设置, 首胞牜子表, 定型定长前取器, /):
        raise Error__TODO(sf)
无效越界断头编解码器 = 乸越界断头编解码器牜无效()


class 乸自然数分区断头编解码器牜体胞符型唯一牜带偏移(魖自然数分区断头编解码器):
    '分区断头编解码器牜分区自然数 #体胞符型唯一:受限于:真*自由编码器'
    ___no_slots_ok___ = True
    def __init__(sf, 总层数, 体胞数纟首层, 符型纟体胞, 末层偏移量, 首胞偏移量, /):
        #check_type_le(魖匴全局参数设置纟自然数编解码器, 匴全局参数设置)
        check_int_ge(1, 总层数)
        check_int_ge(0, 体胞数纟首层)
        check_int_ge(0, 符型纟体胞)
        check_int_ge(0, 末层偏移量)
        check_int_ge(0, 首胞偏移量)
        #.if not 末层偏移量 == 0 == 首胞偏移量:raise NotImplementedError
        #.自由编码器 = 乸自然数自由编码器牜体胞符型唯一牜零偏移(符型纟体胞)
        自由编码器 = 乸自然数自由编码器牜体胞符型唯一牜带偏移(总层数, 体胞数纟首层, 符型纟体胞, 末层偏移量, 首胞偏移量)
        #sf._匴全局参数设置 = 匴全局参数设置
        sf._总层数 = 总层数
        #sf._体胞数纟首层 = 体胞数纟首层
        sf._自由编码器 = 自由编码器
    @property
    def 总层数(sf, /):
        return sf._总层数
    @property
    def 体胞数纟首层(sf, /):
        return sf.自由编码器.体胞数纟首层
    @property
    def 符型纟体胞(sf, /):
        return sf.自由编码器.符型纟体胞
    @property
    def 末层偏移量(sf, /):
        return sf.自由编码器.末层偏移量
    @property
    def 首胞偏移量(sf, /):
        return sf.自由编码器.首胞偏移量
    @property
    @override
    def 自由编码器(sf, /):
        return sf._自由编码器
    @override
    def 解码牜分离首胞牜分区扌(sf, 匴全局参数设置, 首胞牜子表, 定型定长前取器, /):
        #.匴全局参数设置 = sf.匴全局参数设置
        符型纟体胞 = sf.符型纟体胞 #分区方案.符型牜首层体胞
            # !! 体胞符型唯一
        规模纟体胞 = 匴全局参数设置.符型讠规模纟字母表[符型纟体胞]
        首胞偏移量 = sf.首胞偏移量
        总层数 = sf.总层数
        体胞数纟首层 = sf.体胞数纟首层

        u0 = 首胞牜子表 + 首胞偏移量
        us1 = 定型定长前取器.读取冫位元串牜子表扌(符型纟体胞, 体胞数纟首层)
        radix = 规模纟体胞
        u = 匴全局参数设置.自然数巛位元串牜分离首胞乊规模纟字母表扌(radix, u0, us1)
        for _ in range(-1+sf.总层数):
            us = 定型定长前取器.读取冫位元串牜子表扌(符型纟体胞, u)
            u = 匴全局参数设置.自然数巛位元串牜分离首胞乊规模纟字母表扌(radix, 0, us)
        #.digits = chain([u0], us1)
        #.u = uint5digits_(radix, us)
        #.for _ in range(-1+sf.总层数):
        #.    us = 定型定长前取器.读取冫位元串牜子表扌(sf.符型纟体胞, u)
        #.    u = uint5digits_(radix, us)
        u
        u += sf.末层偏移量
        return u

#.def uint5digits_(radix, us, /):
#.    TODO
#.    return u
#.def uint2digits_(radix, u, /):
#.    TODO
#.    return us


class _repr魖自由编码器(魖自由编码器):
    __slots__ = ()
    def __repr__(sf, /):
        args = sf._args4hash_
        nm = type(sf).__name__
        return f'{nm!s}{args}'
class 乸自然数自由编码器牜体胞符型唯一牜零偏移(_repr魖自由编码器):
    ___no_slots_ok___ = True
    def __init__(sf, 符型纟体胞, /):
        sf._j = 符型纟体胞
    @property
    def 符型纟体胞(sf, /):
        return sf._j
    @property
    @override
    def _args4hash_(sf, /):
        return (sf.符型纟体胞,)
    @override
    def 罓自由编码扌(sf, 缓存纟自由编码器, 自然数, /):
        符型纟体胞 = sf.符型纟体胞
            # !! 体胞符型唯一
        ls = []
        u = 自然数
        while 1:
            带符型位元串 = 缓存纟自由编码器.符型讠自然数讠带符型位元串扌(符型纟体胞, u)
            ls.append(带符型位元串)
            (_, us) = 带符型位元串
            u = len(us)
            if u < 2:
                break
        层号讠带符型位元串 = tuple(reversed(ls))
        return 层号讠带符型位元串
class 乸自然数自由编码器牜体胞符型唯一牜带偏移(_repr魖自由编码器):
    ___no_slots_ok___ = True
    def __init__(sf, 总层数, 体胞数纟首层, 符型纟体胞, 末层偏移量, 首胞偏移量, /):
        check_int_ge(1, 总层数)
        check_int_ge(0, 体胞数纟首层)
        check_int_ge(0, 符型纟体胞)
        check_int_ge(0, 末层偏移量)
        check_int_ge(0, 首胞偏移量)
        sf._m = 总层数
        sf._n = 体胞数纟首层
        sf._t = 符型纟体胞
        sf._z = 末层偏移量
        sf._a = 首胞偏移量
    @property
    def 总层数(sf, /):
        return sf._m
    @property
    def 体胞数纟首层(sf, /):
        return sf._n
    @property
    def 符型纟体胞(sf, /):
        return sf._t
    @property
    def 末层偏移量(sf, /):
        return sf._z
    @property
    def 首胞偏移量(sf, /):
        return sf._a
    @cached_property
    @override
    def _args4hash_(sf, /):
        return (sf.总层数, sf.体胞数纟首层, sf.符型纟体胞, sf.末层偏移量, sf.首胞偏移量)
    @override
    def 罓自由编码扌(sf, 缓存纟自由编码器, 自然数, /):
        匴全局参数设置 = 缓存纟自由编码器.匴全局参数设置
        总层数 = sf.总层数
        体胞数纟首层 = sf.体胞数纟首层
        符型纟体胞 = sf.符型纟体胞
            # !! 体胞符型唯一
        末层偏移量 = sf.末层偏移量
        首胞偏移量 = sf.首胞偏移量

        #check_int_ge(末层偏移量, 自然数)
        u = 自然数 -末层偏移量
        check_int_ge(0, u)

        自由编码器牜零偏移 = 乸自然数自由编码器牜体胞符型唯一牜零偏移(符型纟体胞)
        层号讠带符型位元串 = 缓存纟自由编码器.扩增自然数讠自由编码器讠层号讠带符型位元串扌(u, 自由编码器牜零偏移)
            # ^乸异常牜出界
        层号讠带符型位元串 = _限制为总层数扌(匴全局参数设置, 总层数, 层号讠带符型位元串)
        长度纟首层 = 1+体胞数纟首层
        层号讠带符型位元串 = _限制为长度纟首层扌(匴全局参数设置, 长度纟首层, 层号讠带符型位元串)
            #^乸异常牜出界
        #.for 层号, (_, 位元串) in enumerate(层号讠带符型位元串):
        #.    if len(位元串) >= 长度纟首层:
        #.        break
        #.else:
        #.    #raise 乸异常牜出界(sf, 自然数, 长度纟首层, 层号讠带符型位元串)
        #.    # 填充零:
        #.    (符型, 位元串) = 层号讠带符型位元串[-1]
        #.    位元串 = 匴全局参数设置.位元串巛趃位元串牜子表扌(符型, chain([0]*(长度纟首层-len(位元串)), 位元串))
        #.    层号讠带符型位元串 = ((符型, 位元串),)
        #.    层号 = 0
        #.if 层号:
        #.    层号讠带符型位元串 = 层号讠带符型位元串[层号:]

        位元串纟首层 = 层号讠带符型位元串[0][1]
        if not len(位元串纟首层) == 1+体胞数纟首层:raise 乸异常牜出界(sf, 自然数) #ValueError(sf, 自然数)
        #窜改/替换:层号讠带符型位元串:首胞
        if (首胞:=位元串纟首层[0] -首胞偏移量) < 0: raise 乸异常牜出界(sf, 自然数) #raise ValueError(sf, 自然数)
        if 首胞偏移量:
            符型牜首胞 = 层号讠带符型位元串[0][0]
            位元串纟首层 = 匴全局参数设置.位元串巛趃位元串牜子表扌(符型牜首胞, chain([首胞], 位元串纟首层[1:]))
            层号讠带符型位元串 = ((符型牜首胞, 位元串纟首层), *层号讠带符型位元串[1:])
        层号讠带符型位元串
        return 层号讠带符型位元串


def _填充零冫位元串扌(匴全局参数设置, 符型, 长度纟填充, 位元串, /):
    check_int_ge(0, 长度纟填充)
    长度纟预期 = 长度纟填充+len(位元串)
    if 长度纟填充 > 0:
        位元串 = 匴全局参数设置.位元串巛趃位元串牜子表扌(符型, chain([0]*长度纟填充, 位元串))
    if not len(位元串) == 长度纟预期:raise 000
    return 位元串
def _限制为长度纟首层扌(匴全局参数设置, 长度纟首层, 层号讠带符型位元串, /):
    '-> 层号讠带符型位元串 | ^乸异常牜出界'
    (符型纟首层, 位元串纟首层) = 层号讠带符型位元串[0]
    if len(位元串纟首层) > 长度纟首层:raise 乸异常牜出界#(sf, 自然数) #ValueError(sf, 自然数)
    if len(位元串纟首层) < 长度纟首层:
        位元串纟首层 = _填充零冫位元串扌(匴全局参数设置, 符型纟首层, 长度纟首层 -len(位元串纟首层), 位元串纟首层)
        层号讠带符型位元串 = ((符型纟首层, 位元串纟首层), *层号讠带符型位元串[1:])
    (符型纟首层, 位元串纟首层) = 层号讠带符型位元串[0]
    if not len(位元串纟首层) == 长度纟首层:raise 000
    return 层号讠带符型位元串
#.class 乸兼容型纟编码:
#.    '兼容型纟编码{分区断头编解码器牜扩增自然数}'
#.    def __new__(sf, 末层偏移量, 符型纟体胞, 规模纟体胞, /):
#.    def __hash__(sf, /):
#.    def __eq__(sf, ot, /):
#.    #.def __new__(sf, 总层数, 层号讠偏移量, 层号讠符型纟体胞, 层号讠规模纟体胞, 规模纟占位, 体胞数纟首层, /):
#.    #.@property
#.    #.def 总层数(sf, /):
#.    #.    '-> uint{>=1}'
#.    #.@property
#.    #.def 层号讠偏移量(sf, /):
#.    #.    '-> [uint]{len=总层数}'
#.    #.@property
#.    #.def 层号讠符型纟体胞(sf, /):
#.    #.    '-> [uint]{len=总层数} #不含:首层首胞{uint%规模纟占位}'
#.    #.@property
#.    #.def 层号讠规模纟体胞(sf, /):
#.    #.    '-> [uint]{len=总层数} #不含:首层首胞{uint%规模纟占位}'
#.    #.@property
#.    #.def 规模纟占位(sf, /):
#.    #.    '-> uint{>=1} #首层首胞'
#.    #.@property
#.    #.def 体胞数纟首层(sf, /):
#.    #.    '-> uint{>=0} #首层体胞'
#.    #.@property
#.    #.def 符型牜首层体胞(sf, /):
#.    #.    '-> uint{>=0}'
#.    #.    return sf.层号讠符型[0]




class 乸匴全局参数设置纟自然数编解码器(魖匴全局参数设置纟自然数编解码器):
    ___no_slots_ok___ = True
    def __init__(sf, ops, /):
        check_type_le((_魖共通, 魖数据位元串表达牜词典序牜前置长度), ops)
        sf._ops = ops
    @cached_property
    @override
    def 符型讠规模纟字母表(sf, /):
        return sf._ops.符型讠规模纟字母表
    @cached_property
    @override
    def 位元串巛趃位元串乊规模纟字母表扌(sf, /):
        return sf._ops.位元串巛趃位元串乊规模纟字母表扌
        #def 位元串巛趃位元串乊规模纟字母表扌(sf, 规模纟字母表, 趃位元串, /):
        '规模纟字母表 -> 趃位元串 -> 位元串'
        #return 位元串巛趃位元串乊规模牜基准版扌(规模纟字母表, 趃位元串)
    @override
    def 自然数巛位元串牜分离首胞乊规模纟字母表扌(sf, 规模纟字母表, 首胞, 位元串, /):
        return 自然数巛位元串牜分离首胞乊规模纟字母表牜基准版扌(规模纟字母表, 首胞, 位元串)
    @override
    def 自然数讠位元串乊规模纟字母表扌(sf, 规模纟字母表, 自然数, /):
        return 自然数讠位元串乊规模纟字母表牜基准版扌(sf.位元串巛趃位元串乊规模纟字母表扌, 规模纟字母表, 自然数)

_乸分区方案纟扩增自然数编码 = mk_named_pseudo_tuple_(__name__, '_乸分区方案纟扩增自然数编码', '总层数 规模纟占位 体胞数纟首层 符型牜首层体胞 分区编解码器')
class 乸分区方案纟扩增自然数编码(_乸分区方案纟扩增自然数编码, 魖分区方案纟扩增自然数编码):
    ___no_slots_ok___ = True
    def _check6make_(sf, /):
        总层数 = sf.总层数
        规模纟占位 = sf.规模纟占位
        体胞数纟首层 = sf.体胞数纟首层
        符型牜首层体胞 = sf.符型牜首层体胞
        分区编解码器 = sf.分区编解码器
        check_int_ge(1, 总层数)
        check_int_ge(1, 规模纟占位)
        check_int_ge(0, 体胞数纟首层)
        check_int_ge(0, 符型牜首层体胞)
        check_type_le(魖自然数分区断头编解码器, 分区编解码器)


_乸缓存纟自由编码器 = mk_named_pseudo_tuple_(__name__, '_乸缓存纟自由编码器', '匴全局参数设置    罓扩增自然数讠自由编码器讠层号讠带符型位元串    罓体胞规模讠自然数讠位元串')

class 乸缓存纟自由编码器(_乸缓存纟自由编码器, 魖缓存纟自由编码器):
    ___no_slots_ok___ = True
    def _check6make_(sf, /):
        匴全局参数设置 = sf.匴全局参数设置
        罓扩增自然数讠自由编码器讠层号讠带符型位元串 = sf.罓扩增自然数讠自由编码器讠层号讠带符型位元串
        罓体胞规模讠自然数讠位元串 = sf.罓体胞规模讠自然数讠位元串

        check_type_le(魖匴全局参数设置纟自然数编解码器, 匴全局参数设置)
        check_type_is(dict, 罓扩增自然数讠自由编码器讠层号讠带符型位元串)
        check_type_is(dict, 罓体胞规模讠自然数讠位元串)


def 检查冫深度讠配置扌(深度讠配置, /):
    check_type_is(tuple, 深度讠配置)
    for 配置乊深度 in 深度讠配置:
        check_type_is(tuple, 配置乊深度)
        if not len(配置乊深度) == 3:raise TypeError

    for (符型, 区号讠分区方案, 越界断头编解码器) in 深度讠配置:
        check_int_ge(0, 符型)
        check_type_le(魖越界断头编解码器, 越界断头编解码器)
        check_type_is(tuple, 区号讠分区方案)
        for 分区方案 in 区号讠分区方案:
            check_type_le(魖分区方案纟扩增自然数编码, 分区方案)

def 分区表巛区号讠分区方案扌(区号讠分区方案, /):
    区号讠偏移量辻深入指示符 = tuple(accumulate(chain([0], (分区方案.规模纟占位 for 分区方案 in 区号讠分区方案))))
    区号讠偏移量纟位元 = 区号讠偏移量辻深入指示符[:-1]
    位元冃深入指示符 = 区号讠偏移量辻深入指示符[-1]
    分区表 = (区号讠偏移量纟位元, 位元冃深入指示符)
    return 分区表
class 乸分区表配置纟扩增自然数编码方案(魖分区表配置纟扩增自然数编码方案):
    ___no_slots_ok___ = True
    #
    '-> ([(符型, [分区方案], 越界断头编解码器牜扩增自然数)], 后手编解码器)'
    def __init__(sf, 深度讠配置, 后手编解码器, /):
        check_type_le(魖自然数后手编解码器, 后手编解码器)
        深度讠配置 = tuple((符型, tuple(区号讠分区方案), 越界断头编解码器) for (符型, 区号讠分区方案, 越界断头编解码器) in 深度讠配置)
        检查冫深度讠配置扌(深度讠配置)
        深度讠分区表 = tuple(分区表巛区号讠分区方案扌(区号讠分区方案) for (符型, 区号讠分区方案, 越界断头编解码器) in 深度讠配置)
        sf._fb = 后手编解码器
        sf._ts = 深度讠配置
        sf._off = 深度讠分区表
        sf._tss = (深度讠配置, 深度讠分区表)
    @property
    @override
    def 后手编解码器(sf, /):
        return sf._fb
    @override
    def 枚举冫符型辻深入指示符扌(sf, /):
        '-> Iter (符型牜首胞, 深入指示符)'
        (深度讠配置, 深度讠分区表) = sf._tss
        for ((符型牜首胞, _, _), (_, 深入指示符)) in zip(深度讠配置, 深度讠分区表):
            yield (符型牜首胞, 深入指示符)
    @override
    def 查询冫长度纟深入指示符串讠分区表扌(sf, 长度纟深入指示符串, /):
        '长度纟深入指示符串 -> 分区表/(区号讠偏移量纟位元, 位元冃深入指示符) | ^LookupError'
        深度讠分区表 = sf._off
        return 深度讠分区表[长度纟深入指示符串]
    @override
    def 查询冫分区定位讠分区方案扌(sf, 长度纟深入指示符串, 区号, /):
        '长度纟深入指示符串 -> 区号 -> 分区方案'
        深度讠配置 = sf._ts
        (符型, 区号讠分区方案, _) = 深度讠配置[长度纟深入指示符串]
        return 区号讠分区方案[区号]
    @override
    def 查询冫长度纟深入指示符串讠越界编解码器扌(sf, 长度纟深入指示符串, /):
        '长度纟深入指示符串 -> 越界断头编解码器牜扩增自然数/魖越界断头编解码器'
        深度讠配置 = sf._ts
        (符型, 区号讠分区方案, 越界断头编解码器) = 深度讠配置[长度纟深入指示符串]
        return 越界断头编解码器


_乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置 = mk_named_pseudo_tuple_(__name__, '_乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置', '欤编码无需头胞  符型讠规模纟字母表  分区表配置纟扩增自然数编码方案  越界值讠深度  升列纟自然数范围辻分区定位')
class 乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置(_乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置, 魖自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置):
    ___no_slots_ok___ = True
    #def __init__(sf, 欤编码无需头胞, 符型讠规模纟字母表, 分区表配置纟扩增自然数编码方案, 越界值讠深度, 升列纟自然数范围辻分区定位, /):
    def _check6make_(sf, /):
        (欤编码无需头胞, 符型讠规模纟字母表, 分区表配置纟扩增自然数编码方案, 越界值讠深度, 升列纟自然数范围辻分区定位) = sf
        match sf:
            case 乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置(欤编码无需头胞=欤编码无需头胞, 符型讠规模纟字母表=符型讠规模纟字母表, 分区表配置纟扩增自然数编码方案=分区表配置纟扩增自然数编码方案, 越界值讠深度=越界值讠深度, 升列纟自然数范围辻分区定位=升列纟自然数范围辻分区定位):
                pass
            case _:
                raise 000
            #case
        check_type_is(bool, 欤编码无需头胞)

        check_type_is(tuple, 符型讠规模纟字母表)
        check_all_([check_int_ge, 1], 符型讠规模纟字母表)

        check_type_le(魖分区表配置纟扩增自然数编码方案, 分区表配置纟扩增自然数编码方案)

        check_type_is(type(mk_FrozenDict()), 越界值讠深度)
        check_type_is(tuple, 升列纟自然数范围辻分区定位)
        前讫点 = 0
        for 自然数范围辻分区定位 in 升列纟自然数范围辻分区定位:
            check_pair(自然数范围辻分区定位)
            (自然数范围, 分区定位) = 自然数范围辻分区定位
            check_pair(自然数范围)
            check_pair(分区定位)

            (起点, 讫点) = 自然数范围
            (深度, 区号) = 分区定位

            check_int_ge(0, 深度)
            check_int_ge(0, 区号)

            check_int_ge(前讫点, 起点)
            check_int_ge(1+起点, 讫点)
            前讫点 = 讫点

    #########

    @override
    def 提前探测冫鬽分区越界定位巛扩增自然数扌(sf, 扩增自然数, /):
        '扩增自然数 -> 鬽分区越界定位/(鬽 分区越界定位/(长度纟深入指示符串, 鬽区号))'
        if type(扩增自然数) is int:
            自然数 = 扩增自然数
            check_int_ge(0, 自然数)
            升列纟自然数范围辻分区定位 = sf.升列纟自然数范围辻分区定位
            j = bisect_right(升列纟自然数范围辻分区定位, 自然数, key=lambda xy_z:xy_z[0][1])
            if j == len(升列纟自然数范围辻分区定位):
                return None
            ((起点, 讫点), 分区定位) = 升列纟自然数范围辻分区定位[j]
            if not (起点 <= 自然数 < 讫点):
                return None
            return 分区定位
        越界值 = 扩增自然数
        if not None is (深度 := sf.越界值讠深度.get(越界值)):
            check_int_ge(0, 深度)
            分区越界定位 = (深度, 鬽区号:=None)
            return 分区越界定位
        return None
    #########
    #########

    @property
    @override
    def 匴全局参数设置(sf, /):
        return 乸匴全局参数设置纟自然数编解码器(sf)
    @override
    def 构造冫缓存纟自由编码器扌(sf, /):
        '-> 缓存纟自由编码器'
        return 乸缓存纟自由编码器(sf.匴全局参数设置, {}, {})



check_non_ABC(乸自然数分区断头编解码器牜体胞符型唯一牜带偏移)
check_non_ABC(乸自然数自由编码器牜体胞符型唯一牜零偏移)
check_non_ABC(乸自然数自由编码器牜体胞符型唯一牜带偏移)
check_non_ABC(乸匴全局参数设置纟自然数编解码器)
check_non_ABC(乸分区方案纟扩增自然数编码)
check_non_ABC(乸缓存纟自由编码器)
check_non_ABC(乸分区表配置纟扩增自然数编码方案)
check_non_ABC(乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置)


__all__
from seed.int_tools.int_repr7lex_order7base__part2 import 魖自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置, 乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置
from seed.int_tools.int_repr7lex_order7base__part2 import 乸匴全局参数设置纟自然数编解码器, 乸分区方案纟扩增自然数编码, 乸缓存纟自由编码器, 乸分区表配置纟扩增自然数编码方案
from seed.int_tools.int_repr7lex_order7base__part2 import 乸自然数分区断头编解码器牜体胞符型唯一牜带偏移, 无效后手编解码器牜自然数, 无效越界断头编解码器


from seed.int_tools.int_repr7lex_order7base__part2 import 乸异常牜出界

from seed.int_tools.int_repr7lex_order7base__part2 import 乸自然数自由编码器牜体胞符型唯一牜零偏移, 乸自然数自由编码器牜体胞符型唯一牜带偏移



def _API():
    from seed.int_tools.int_repr7lex_order7base import 魖数据字符串表达牜词典序牜前置长度牜使用匴数据位元串表达, 乸数据字符串表达牜词典序牜前置长度牜使用匴数据位元串表达
        #乸数据字符串表达牜词典序牜前置长度牜使用匴数据位元串表达(匴数据位元串表达, 列表纟字母表牜头胞辻多种体胞)

    from seed.int_tools.int_repr7lex_order7base import 乸整数位元串表达牜词典序牜前置长度牜整数零编码为单胞牜使用自然数编码器
        #乸整数位元串表达牜词典序牜前置长度牜整数零编码为单胞牜使用自然数编码器(欤深一, 规模纟头胞, 匴自然数位元串表达牜词典序牜前置长度)
    from seed.int_tools.int_repr7lex_order7base__part2 import 乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置
        #乸自然数位元串表达牜词典序牜前置长度牜无颈胞牜分区表配置(欤编码无需头胞, 符型讠规模纟字母表, 分区表配置纟扩增自然数编码方案, 越界值讠深度, 升列纟自然数范围辻分区定位)
    from seed.int_tools.int_repr7lex_order7base__part2 import 乸匴全局参数设置纟自然数编解码器, 乸分区方案纟扩增自然数编码, 乸缓存纟自由编码器, 乸分区表配置纟扩增自然数编码方案
        #乸分区表配置纟扩增自然数编码方案(深度讠配置, 后手编解码器)
        #乸分区方案纟扩增自然数编码(总层数, 规模纟占位, 体胞数纟首层, 符型牜首层体胞, 分区编解码器)
        #乸匴全局参数设置纟自然数编解码器(ops:(_魖共通, 魖数据位元串表达牜词典序牜前置长度))
        #乸缓存纟自由编码器(匴全局参数设置, 罓扩增自然数讠自由编码器讠层号讠带符型位元串, 罓体胞规模讠自然数讠位元串)
    from seed.int_tools.int_repr7lex_order7base__part2 import 乸自然数分区断头编解码器牜体胞符型唯一牜带偏移, 无效后手编解码器牜自然数, 无效越界断头编解码器
        #乸自然数分区断头编解码器牜体胞符型唯一牜带偏移(总层数, 体胞数纟首层, 符型纟体胞, 末层偏移量, 首胞偏移量)




from seed.int_tools.int_repr7lex_order7base__part2 import *
