

r"""
e ../../python3_src/nn_ns/CJK/CJK_data/raw/parse_繁简.py
$ py nn_ns/CJK/CJK_data/raw/parse_繁简.py
py nn_ns/CJK/CJK_data/raw/parse_繁简.py >nn_ns/CJK/CJK_data/output/parse_繁简.py.out/简繁.txt 2>nn_ns/CJK/CJK_data/output/parse_繁简.py.out/简繁.err.txt

#"""

##section##
r"""
异体字
???
#"""

##section##
r"""
变体 #如：兑字头是八还是倒八
e /storage/emulated/0/0my_files/unzip/e_book/简繁对比/others/简繁对比/from_opencc/HKVariants.txt
HKVariants.txt
JPVariants.txt
STCharacters.txt
TSCharacters.txt
TWVariants.txt
#"""


##section##
r"""
非对称简繁字对集 #一繁多简，一简多繁
e /storage/emulated/0/0my_files/unzip/e_book/简繁对比/others/简繁对比/一简对多繁.txt
e /storage/emulated/0/0my_files/unzip/e_book/简繁对比/others/简繁对比/一繁对多简.txt
e /storage/emulated/0/0my_files/unzip/e_book/简繁对比/others/简繁对比/“繁一對簡多”的探討.html

e /storage/emulated/0/0my_files/unzip/e_book/简繁对比/others/简繁对比/“非对称繁简字”形音义简析表.txt
    empty!!!
    即：非对称繁简字.txt
e /storage/emulated/0/0my_files/unzip/e_book/简繁对比/others/简繁对比/非对称繁简字.txt
e /storage/emulated/0/0my_files/unzip/e_book/简繁对比/others/简繁对比/非对应简繁汉字.txt
e /storage/emulated/0/0my_files/unzip/e_book/简繁对比/others/简繁对比/古今繁简字异体字使用对照表.u8
#"""

##section##
r"""
繁简对照表

e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/funNLP-master/fanjian_suoyin.txt
僿	僿
儀	仪

e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-converter-master/ConverterMaps/00.Default.xml
<Config>
  <Converters>
    <Converter Id="0" Name="简转繁" SourceMapId="简体字符" DestMapId="繁体字符" />
  </Converters>
  <Maps>
    <!-- 字符对照表元素 Id：字符对照表ID(可为数字或字符串) Value：字符列表(部分符号请使用HTML转义字符) -->
    <Map Id="简体字符">锕皑</Map>
    <Map Id="繁体字符">錒皚</Map>
  </Maps>
</Config>
e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-converter-master/ConverterMaps/01.Wikipedia.xml



e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-utils-master/resources/simp.txt
仩
仪
e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-utils-master/resources/trad.txt
仩
儀
e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-utils-master/resources/traditional.txt
##### 简繁分歧词表 #####

# 计算机
打印机=印表機
内存=記憶體
e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-utils-master/resources/simplified.txt
##### 繁简分歧词表 #####

# 计算机
印表機=打印机
記憶體=内存



e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/nstools-master/zhtools/chconv.py
    Simp2Trad_Table
    Trad2Simp_Table
    Kanji2Trad_Table
    Kanji2Simp_Table
    Chinese2Kanji_Table
    # {int:int}

e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/nstools-master/zhtools/zh_wiki.py
    zh2Hant
'帮助文件': '說明檔案',
"画": "畫",
    zh2Hans
'說明檔案': '帮助文件',
"瀋": "沈",
    zh2TW
"缺省": "預設",
    zh2HK
"字节": "位元組",
"字節": "位元組",
    zh2CN
"預設": "默认",
    zh2SG
"方便面": "快速面",
"速食麵": "快速面",
"即食麵": "快速面",


e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-converter-master/ConverterMaps/02.HuoXingWen.xml
e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/nstools-master/zhtools/Mandarin.dat
347F	TIAO2 ZHAO4
e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-utils-master/resources/pinyin.txt
与=yu3,yu4,yu2
e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-utils-master/resources/unknown.txt
亇=
e /storage/emulated/0/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/繁简转换\[20200913]/chinese-utils-master/resources/polyphone.txt
#中=zhong1,zhong4
#中=zhong1
命中注定=ming4 zhong1 zhu4 ding4

#中=zhong4
中奖=zhong4 jiang3

#"""





















##section##
#365=322+32+9+2
一简对多繁 = r'''
http://www.qqxiuzi.cn/wz/jiantizi-fantizi/226.htm
简繁转换一简对多繁列表，最少两个最多五个
**一简对二繁
!:启→啓啟
!:板→板闆
!:杯→杯盃
!:辟→辟闢
!:表→表錶
!:别→別彆
!:卜→卜蔔
!:布→布佈
!:才→才纔
!:彩→彩綵
!:参→參蔘
!:冲→沖衝
!:虫→虫蟲
!:丑→丑醜
!:仇→仇讎
!:出→出齣
!:村→村邨
!:粗→粗麤
!:酬→酬醻
!:当→當噹
!:党→黨党
!:淀→澱淀
!:吊→弔吊
!:冬→冬鼕
!:发→發髮
!:范→范範
!:丰→豐丰
!:谷→谷穀
!:雇→雇僱
!:刮→刮颳
!:广→廣广
!:哄→哄鬨
!:后→後后
!:伙→夥伙
!:获→獲穫
!:几→幾几
!:饥→飢饑
!:迹→跡蹟
!:奸→奸姦
!:姜→姜薑
!:借→借藉
!:尽→盡儘
!:据→據据
!:卷→捲卷
!:克→克剋
!:困→困睏
!:夸→夸誇
!:罗→羅囉
!:累→累纍
!:厘→厘釐
!:漓→漓灕
!:梁→梁樑
!:了→了瞭
!:霉→霉黴
!:弥→彌瀰
!:蔑→蔑衊
!:么→么麼
!:麽→麽麼
!:苹→蘋苹
!:仆→僕仆
!:铺→鋪舖
!:朴→朴樸
!:签→簽籤
!:确→確确
!:舍→舍捨
!:沈→沈瀋
!:胜→勝胜
!:术→術朮
!:松→松鬆
!:它→它牠
!:他→他祂
!:叹→嘆歎
!:坛→壇罈
!:体→體体
!:同→同衕
!:涂→涂塗
!:团→團糰
!:喂→喂餵
!:为→為爲
!:纤→纖縴
!:咸→鹹咸
!:弦→弦絃
!:绣→綉繡
!:须→須鬚
!:熏→熏燻
!:腌→醃腌
!:叶→葉叶
!:佣→傭佣
!:涌→湧涌
!:游→游遊
!:于→於于
!:余→余餘
!:吁→籲吁
!:郁→郁鬱
!:欲→欲慾
!:御→御禦
!:愿→願愿
!:岳→岳嶽
!:云→雲云
!:赞→贊讚
!:脏→臟髒
!:扎→扎紮
!:占→占佔
!:折→折摺
!:征→征徵
!:证→證証
!:志→志誌
!:制→制製
!:致→致緻
!:钟→鍾鐘
!:种→種种
!:周→周週
!:注→註注
!:准→準准
!:冢→塚冢
!:庄→庄莊
!:涩→澀澁
!:蚕→蠶蚕
!:忏→懺忏
!:吨→噸吨
!:赶→趕赶
!:构→構构
!:柜→櫃柜
!:怀→懷怀
!:坏→壞坏
!:极→極极
!:茧→繭茧
!:家→家傢
!:价→價价
!:洁→潔洁
!:惊→驚惊
!:腊→臘腊
!:蜡→蠟蜡
!:帘→簾帘
!:怜→憐怜
!:岭→嶺岭
!:扑→撲扑
!:秋→秋鞦
!:千→千韆
!:确→確确
!:扰→擾扰
!:洒→灑洒
!:晒→曬晒
!:适→適适
!:听→聽听
!:洼→窪洼
!:网→網网
!:旋→旋鏇
!:踊→踴踊
!:优→優优
!:症→症癥
!:朱→朱硃
!:荐→薦荐
!:离→離离
!:卤→鹵滷
!:气→氣气
!:圣→聖圣
!:万→萬万
!:与→與与
!:摆→擺襬
!:虮→蟣虮
!:篱→籬篱
!:泞→濘泞
!:恶→惡噁
!:托→托託
!:杰→杰傑
!:昆→昆崑
!:戚→戚慼
!:仑→侖崙
!:夭→夭殀
!:毋→毋毌
!:奶→奶嬭
!:圬→圬杇
!:床→床牀
!:儿→兒儿
!:拈→拈撚
!:硅→矽硅
!:虬→虯虬
!:咱→咱偺
!:炫→炫衒
!:个→個箇
!:娘→娘孃
!:殷→殷慇
!:啖→啖啗
!:执→執执
!:庵→庵菴
!:强→強彊
!:彗→彗篲
!:挂→掛挂
!:栖→棲栖
!:答→答荅
!:闲→閒閑
!:坞→塢隖
!:盏→盞醆
!:碰→碰踫
!:绦→絛縚
!:埙→塤壎
!:宁→寧甯
!:枪→槍鎗
!:衔→銜啣
!:铣→銑鐉
!:驳→駁駮
!:札→劄札
!:僵→僵殭
!:嘻→嘻譆
!:幢→幢橦
!:幡→幡旛
!:盘→盤槃
!:锉→銼剉
!:鸩→鴆酖
!:噪→噪譟
!:担→擔担
!:筑→築筑
!:恹→懨懕
!:鲧→鯀鮌
!:懒→懶嬾
!:檐→簷檐
!:膻→羶膻
!:藤→藤籐
!:铲→鏟剷
!:韵→韻韵
!:垆→壚罏
!:鳅→鰍鰌
!:馈→饋餽
!:鳀→鯷鮷
!:铁→鐵銕
!:坝→壩垻
!:钥→鑰鈅
!:钻→鑽鉆
!:乃→乃迺
!:寸→寸吋
!:凶→凶兇
!:夫→夫伕
!:尺→尺呎
!:仿→仿倣
!:合→合閤
!:吃→吃喫
!:圭→圭珪
!:扣→扣釦
!:助→助耡
!:呆→呆獃
!:杠→杠槓
!:灶→灶竈
!:沄→沄澐
!:匡→劻匡
!:幸→幸倖
!:念→念唸
!:抬→抬擡
!:泄→泄洩
!:肴→肴餚
!:芸→芸蕓
!:虱→虱蝨
!:剃→剃薙
!:咽→咽嚥
!:咯→咯詻
!:尸→屍尸
!:背→背揹
!:啕→咷啕
!:凌→凌淩
!:唉→唉欸
!:唇→唇脣
!:席→席蓆
!:捂→捂摀
!:挽→挽輓
!:效→效傚
!:核→核覈
!:栗→栗慄
!:浩→浩澔
!:疱→皰疱
!:秘→秘祕
!:胁→脅脇
!:针→針鍼
!:纴→紝絍
!:匾→匾楄
!:从→從从
!:凄→淒悽
!:焊→焊銲
!:琅→琅瑯
!:瓶→瓶缾
!:众→眾衆
!:眯→眯瞇
!:剩→剩賸
!:勋→勛勳
!:喧→喧諠
!:棹→棹櫂
!:勤→勤懃
!:愈→愈癒
!:搜→搜蒐
!:暗→暗闇
!:溪→溪谿
!:烟→煙菸
!:炼→煉鍊
!:痴→痴癡
!:逾→逾踰
!:愧→媿愧
!:棰→棰箠
!:药→葯藥
!:演→演縯
!:蓑→蓑簑
!:酸→酸痠
!:剑→劍劒
!:哗→嘩譁
!:璇→璇璿
!:瘘→瘺瘻
!:谥→諡謚
!:荡→盪蕩
!:糟→糟蹧
!:檩→檁檩
!:宁→寧宁
!:苧→薴苧
!:蝎→蠍蝎
!:棂→櫺欞
!:鉴→鑑鑒
!:罐→罐鑵
!:玱→玱瑲
!:疴→疴痾
!:缰→繮韁
!:莼→蒓蓴
!:鹚→鷀鶿
!:凭→憑凭
!:缽→缽鉢
!:象→象像

**一简对三繁
!:曲→曲麯麴
!:升→升昇陞
!:苏→蘇囌甦
!:系→系係繫
!:尝→嘗甞嚐
!:胡→胡鬍衚
!:划→畫劃划
!:回→回迴囘
!:汇→匯彙滙
!:里→里裡裏
!:历→歷曆厤
!:袅→裊嫋嬝
!:线→缐線綫
!:向→向嚮曏
!:只→只隻衹
!:刨→刨鉋鑤
!:抵→抵牴觝
!:崎→崎埼碕
!:麻→麻痲蔴
!:攒→攢儹欑
!:岩→岩巖嵒
!:炮→炮砲礮
!:棱→棱稜崚
!:呼→呼虖謼
!:泛→泛氾汎
!:宴→宴讌醼
!:捆→捆綑梱
!:毁→毀燬譭
!:鼗→鞀鞉鼗
!:橹→櫓艣艪
!:鹇→鷴鷳鷼
!:欢→歡懽讙

**一简对四繁
!:并→并並併竝
!:采→采埰寀採
!:厂→厂庵厰廠
!:干→乾干幹榦
!:蒙→蒙懞濛矇
!:面→面麵麪麫
!:复→復複覆复
!:局→局侷挶跼
!:雕→雕鵰彫琱

**一简对五繁
!:斗→鬥斗鬪鬦鬭
!:台→臺台檯枱颱
#''' #一简对多繁


##section##
#16
一繁对多简 = r'''
http://www.qqxiuzi.cn/wz/jiantizi-fantizi/227.htm
繁简转换一繁对多简列表，共十余组
!:著→著着
!:兒→兒儿
!:乾→乾干
!:夥→夥伙
!:藉→藉借
!:瞭→瞭了
!:餘→馀余
!:摺→摺折
!:徵→徵征
!:畫→画划
!:鯰→鲶鲇
!:瀋→沈渖
!:鹼→碱硷
!:蘋→苹蘋
!:麼→麽么
!:剋→克剋
#''' #一繁对多简


##section##
#16
繁一對簡多的探討 = r'''
“繁一對簡多”的探討
http://www.qqxiuzi.cn/wz/jiantizi-fantizi/1608.htm
“繁一對簡多”的探討
作者 李牧
来源 《汉字书同文研究》第８辑
发布时间 2014-12-17

#16
!:阪/阪坂
!:怵/怵憷
!:槁/槁藁
!:滾/滚磙
!:呵/呵嗬
!:糊/糊煳
!:強/强犟
!:溜/溜熘
!:壟/垄垅
!:猛/猛勐
!:劈/劈噼
!:退/退煺
!:原/原塬
!:靦/䩄腼
!:鯰/鲶鲇
!:杴/杴锨
#''' #繁一對簡多的探討








##section##
# 一繁多简 12-1
# !!@:餘/余（馀）
# !!@:摺（折）/折（摺）
# ?? !!@:鑪/炉
# 一简多繁 280=43+64+46+43+84
# !!:庵/庵菴（厂广）
# !!:仿佛/仿佛、彷彿、髣髴
# !!:干（乾）/干乾幹榦
# !!:夹（挟）/夾（夹）挾
# !!:菱/菱X
非对应简繁汉字 = r"""
http://www.qqxiuzi.cn/wz/jiantizi-fantizi/1650.htm
“非对应简繁汉字”关係表——内含各相关汉字的特徵比较（2010.4修订）

作者 香港《语文建设通讯》 来源 《汉字书同文研究》第９辑（2011年） 发布时间 2014-12-21
　　X表示“该位置应有一个异体字、但整理时未能按该特定字形输入该字”；

xxxx
1. 一简多繁，计280组，NOTE:x X
1.1 依音序从A到E共收43组
!!:庵/庵菴（厂广）
!!:肮/骯腌
!!:坝/埧壩
!!:摆/擺（摆）襬
!!:板/板闆
!!:刨/刨鉋鑤
!!:杯/杯盃
!!:背/背揹
!!:表/表錶
!!:别/别彆
!!:并/并併並
!!:卜/卜蔔
!!:布/布佈
!!:才/才纔
!!:采/采採
!!:彩/彩綵
!!:铲/鏟剷
!!:尝/嘗嚐
!!:厂/廠（厰）庵
!!:嗔/嗔瞋
!!:吃/吃喫
!!:痴/痴癡
!!:冲/沖衝
!!:虫/虫蟲
!!:丑/丑醜
!!:出/出齣
!!:锤/錘鎚
!!:捶/捶搥
!!:唇/唇脣
!!:村/村邨
!!:啖/啖啗
!!:当/當噹
!!:党/党黨
!!:荡/蕩盪
!!:堤/堤隄
!!:抵/抵牴
!!:淀/淀澱
!!:雕/雕彫
!!:吊/吊弔
!!:冬/冬咚鼕
!!:斗/斗鬥
!!:炖/炖燉
!!:恶/惡噁

1.2 依音序从F到K共收64组
!!:发/發髮
!!:翻/翻繙X
!!:范/范範
!!:泛/泛氾汎
!!:仿/仿倣
!!:仿佛/仿佛、彷彿、髣髴
!!:丰/丰豐（酆）
!!:夫/夫伕
!!:复/復複（覆）
!!:杆/杆桿
!!:干（乾）/干乾幹榦
!!:杠/杠槓
!!:个/个個箇
!!:构/構搆
!!:谷/谷榖
!!:雇/雇僱
!!:刮/刮颳
!!:挂/挂掛
!!:拐/拐枴
!!:广/广廣
!!:圭/圭珪
!!:柜/柜櫃
!!:焊/銲釬
!!:合/合閤
!!:哄/哄鬨
!!:后/后後
!!:胡/胡鬍
!!:划/划劃
!!:哗/嘩譁
!!:坏/坏壞
!!:回/回迴
!!:毁/毁燬
!!:汇/匯彙
!!:获/獲穫
!!:饥/飢饑
!!:几/几幾
!!:绩/績勣
!!:迹/迹跡蹟
!!:家/家傢
!!:夹（挟）/夾（夹）挾
!!:价/价價
!!:奸/奸姦
!!:荐/荐薦
!!:鉴/鍳鑑
!!:姜/姜薑
!!:剿/剿勦
!!:杰/杰傑
!!:借/借藉
!!:筋/筋觔
!!:尽/盡儘
!!:径/徑逕
!!:局/局侷跼
!!:巨/巨鉅
!!:据/据據
!!:卷/卷捲
!!:浚/浚濬
!!:克/克剋
!!:坑/坑阬
!!:扣/扣釦
!!:夸/夸誇
!!:馈/饋餽
!!:昆/昆崑
!!:捆/捆綑
!!:困/困睏
[“彷”见1.3 ]

1.3 依音序从L到P共收46组
!!:蜡/蜡蠟
!!:腊/腊臘
!!:琅/琅瑯
!!:累/累纍
!!:狸/狸貍
!!:璃/璃瓈
!!:漓/漓灕
!!:里/里裏（裡）
!!:栗/栗慄
!!:历/歷曆
!!:帘/帘簾
!!:怜/怜憐
!!:炼/煉鍊
!!:梁/梁樑
!!:淋/淋痳
!!:磷/磷燐
!!:菱/菱X
!!:炉/爐鑪
!!:卤/鹵滷
!!:仑/侖崙
!!:麻/麻蔴痲
!!:霉/霉黴
!!:蒙/蒙濛懞矇
!!:弥/彌瀰
!!:秘/秘祕
!!:面/面麵
!!:蔑/蔑衊
!!:悯/憫愍
!!:模/模糢
!!:乃/乃迺
!!:拈/拈捻
!!:念/念唸
!!:娘/娘孃
!!:啮/嚙齧
!!:宁/寧甯
!!:暖/暖煖
!!:盘/盤槃
!!:彷/彷徬
!!:炮/炮砲
!!:碰/碰踫
!!:匹/匹疋
!!:辟/辟闢
!!:苹（蘋）/苹蘋
!!:扑/扑撲
!!:仆/仆僕
!!:朴/朴樸
[“么/么麽”见.]

1.4 依音序从Q到T共收43组
!!:凄/淒悽
!!:戚/戚慼
!!:千/千韆
!!:签/簽籤
!!:钳/鉗箝拑
!!:纤/纖縴
!!:枪/槍鎗
!!:强/強（强）彊
!!:秋/秋鞦
!!:球/球毬
!!:曲/曲麯
!!:蜷/蜷踡
!!:确/确確
!!:箬/箬篛
!!:晒/晒曬
!!:膻/膻羶
!!:舍/舍捨
!!:沈/沈瀋沉
!!:升/升陞昇
!!:剩/剩賸
!!:尸/尸屍
!!:虱/虱蝨
!!:湿/濕溼
!!:适/适適
!!:薯/薯藷
!!:术/朮術
!!:松/松鬆
!!:嵩/嵩崧
!!:搜/搜蒐
!!:苏/蘇甦囌
!!:酸/酸痠
!!:蓑/蓑簑
!!:它/它牠祂
!!:台/台臺檯颱
!!:坛/壇罈罎
!!:叹/嘆歎
!!:藤/藤籐
!!:体/体體
!!:眺/眺X
!!:听/听聽
!!:涂/涂塗
!!:团/團糰
!!:托/托託

1.5 依音序从W到Z共收84组
!!:挽/挽輓
!!:袜/袜襪
!!:万/万萬
!!:喂/喂餵
!!:污/汙汚污
!!:溪/溪谿
!!:嘻/嘻譆
!!:席/席蓆
!!:系/系係繫
!!:吓/吓嚇
!!:咸/咸鹹
!!:衔/銜啣
!!:弦/弦絃
!!:闲/閑閒
!!:镶/鑲瓖
!!:向/向嚮
!!:筱/筱篠
!!:效/效傚
!!:泄/泄洩
!!:幸/幸倖
!!:凶/凶兇
!!:修/修脩
!!:吁/吁籲
!!:须/須鬚
!!:恤/恤卹
!!:旋/旋鏇
!!:勋/勛勳
!!:熏/熏燻
!!:腌/腌醃
!!:檐/檐簷
!!:岩/岩巖
!!:焰/焰燄
!!:艳/艷豔
!!:扬/揚颺
!!:么/么麽
    [但,么=幺]
!!:肴/肴餚
!!:药/葯藥
!!:烟/烟菸煙
!!:咽/咽嚥
!!:叶/叶葉
!!:移/移迻
!!:迤/迤迆
!!:殷/殷慇
!!:佣/佣傭
!!:涌/涌湧
!!:游/游遊
!!:余（馀）/余餘
!!:郁/郁鬱
!!:欲/欲慾
!!:御/御禦
!!:愈/愈瘉癒
!!:愿/愿願
!!:岳/岳嶽
!!:云/云雲
!!:芸/芸蕓
!!:沄/沄澐
!!:咱/咱偺
!!:赞/贊讚
!!:脏/髒臟
!!:噪/噪譟
!!:扎/扎札
!!:榨/榨搾
!!:沾/沾霑
!!:占/占佔
!!:照/照炤
!!:棹/棹櫂
!!:征（徵）/征徵
!!:症/症癥
!!:证/証證
!!:只/只隻祇
!!:致/致緻
!!:制/制製
!!:志/志誌
!!:钟/鍾鐘
!!:冢/冢塚
!!:种/种種
!!:周/周週
!!:胄/胄冑
!!:朱/朱硃
!!:筑/筑築
!!:注/注註
!!:专（耑）/專耑
!!:准/准準
!!:咨（谘）/咨諮

2.一繁多简，计12组
!!@:兒/儿兒
!!@:乾（干）/干乾
!!@:夥（伙）/伙夥
!!@:藉/借藉
!!@:瞭（了）/了瞭
?? !!@:鑪/炉
!!@:麽（麼）/么麽嗎
    么麽（读“魔”）嗎（读“麻”）
!!@:蘋（苹）/苹蘋
!!@:餘/余（馀）
!!@:摺（折）/折（摺）
!!@:徵（征）/征徵
!!@:著（着）/著着


xxxx

#""" # 非对应简繁汉字




##section##
# ￥—替换为 常见繁体字
# 95
# !!!:11、当（!當噹）
# !!!:16、恶（~噁）
# !!!:21、干（~幹乾）
# 30
# !!!@:（110）、罗（!羅囉）
# 39
# !!!&:1、呆（￥獃）
# !!!&:15、泪（~淚）#
# 28
# !!!$:16、凄（￥淒悽）
# !!!$:26、伫（~佇竚）#?
# 21?25?24
# !!!$:2、雕（!鵰凋彫）
非对称繁简字 = r"""
http://www.qqxiuzi.cn/wz/jiantizi-fantizi/1651.htm
“非对称繁简字”形音义简析表说明

作者 周胜鸿整理 来源 《汉字书同文研究》第９辑（2011年） 发布时间 2014-12-21
《通用规範汉字表》（征求意见稿）中《简繁汉字对照表》裏的“非对称繁简字”形音义简析表说明

　　2009年8月，教育部公布了《通用规范汉字表》（征求意见稿），共有8300个字。其中又列出《简繁汉字对照表》，共有2451个字，它不收《简化字总表》中的49个简化字，却增加了265个新类推出的简化字。在2451个简化字中又确定打“*”的95个是“对应多个繁体字的简化字”。其实，依照我的研究，应该还有30来个“对应多个繁体字的简化字”，即学術界称之谓“非对称繁简字”。两者相加，可以得出125对“非对称繁简字”。

我要说明如下：

一、1986年重新公布的《简化字总表》有2235个简化字（一说是2236个），是国家标準的规範用字。其中大部分简化字是与它的繁（正）体字“一一对称”的（例：肮—骯）；另外有一部分所谓“非对称繁简字”，就是一个简化字替代二个（板—板、闆）或二个以上（台—臺、檯、颱）的繁（正）体字。“非对称繁简字”往往会造成用字混乱，也会在电脑进行繁简转换的文字处理时造成错乱。所以许多学者建议要作调整，但是，2009年8月，教育部公布了《通用规范汉字表》（征求意见稿）只调整了其中的6个（克剋、钟锺、苹蘋、恶噁、朦濛、朱硃）。

另外，我又列出1955年公布的《第一批异体字整理表》中的“非对称正异字”，供大家参考。
二、在分析中参考了台湾《国语日报辞典》（1991年8月第48版）和台湾旺文出版社1997年9月出版的“简繁体对照、国语注音和汉语拼音并列”的《新编汉字字典》所列的词条和解释。

xxxxx
（一）、《简繁汉字对照表》里的“非对称繁简字”：

!!!:1、坝（!壩垻）
 bà埧：jǜ堤塘（台湾《国语日报辞典》）

埧子（云、贵、川称水中的陆地）

水坝（壩简化）

!!!:2、罢（~摆襬）
 bǎi 作罢

摆布

衣襬

!!!:3、板（~闆）
bǎn：木板、竹板、死板

　　　　　　　 商店老闆、戏班子老闆

!!!:4、表（~錶）
biǎo ：表示、仪表、表叔、表率、报表

鐘錶 錶盘 体温錶

!!!:5、别（~彆）
：特别（bié）、差别、区别、类别

彆（biè）扭彆不过 彆彆扭扭

!!!:6、卜（~蔔）
：占卜（bǔ）、卜卦、前途未卜

萝蔔（bo）

!!!:7、才（~纔）
cái：才干、天才

　　　 刚纔、纔好（副词）

!!!:8、冲（~衝）
：冲（chōnɡ）田 冲波冲茶冲击属相相冲

　　　　 　衝（chōnɡ）锋、要衝、衝撞、

　　　　 　衝压（chònɡ）、衝床、衝压、衝头、酒味很衝

又：冲衝都是多义字。二字在水流灌注、水力冲刷、或冲克（相对或相反）的意义上相通。冲的本义是动摇，还有用水调治、空虚、谦虚、淡泊、向上等意义。衝的本义是大路、交叉路口，还有朝着、冒着、突擊、衝撞、突破、猛烈等多种意义。这些意义，冲衝并不通用。

!!!:9、丑（~醜）
9、丑（醜）chǒu：小丑（丑角）、子丑寅之丑时

出醜、醜陋、小醜（醜恶之人）

又：二字意义完全不同，且不通用。以丑代醜，使醜消失了表意性，且给古代汉语的阅读造成较大的麻烦。

!!!:10、出（~齣）
chū：出去、外出、出纳

一齣戏（量词）

!!!:11、当（!當噹）
：當（dānɡ）面、充當、应當 瓦當

　　　　　　　噹（dānɡ）噹噹响

　　　　　　　當（dànɡ）恰當、借當、當时、以一當十

!!!:12、党（~黨）
：党（dǎnɡ）姓名、党项羌（古民族名）

　　　　　　黨（dǎnɡ）同黨、黨员

　　　　　　黨（zhǎnɡ）姓名（今改读dǎnɡ）

　　　　　　黨（tǎnɡ）倘若

!!!:13、淀（~澱）
diàn：沉澱、澱粉

白洋淀、荷花淀

!!!:14、冬（~鼕）
dōnɡ：冬天

鼕鼕响

!!!:15、斗（~鬥）
：一斗（dǒu）米 五斗米道

　　　　　　烟斗、斗胆、斗角、斗室、泰斗、漏斗、北斗星、斗筲之人

　　　　　　鬥（dòu）争、打鬥、鬥智

!!!:16、恶（~噁）
：恶（è）劣, 恶作剧

可恶（wù），好恶、厌恶

噁（ě）心

!!!:17、发（!發髮）
：fā發财、發展、周武王姬發 影星周润發

　　　　　　 　fà头髮 毫髮 髮妻 生髮油 红颜白髮 令人髮指 千钧一髮

!!!:18、范（~範）
fàn：范（姓氏）、范仲淹、范冰冰

　　　　　　　　铁範、模範、规範 範围 就範、鸿文垂範

!!!:19、丰（~豐）
fēng：豐富、豐碑

丰采、丰標、丰度、丰仪、丰容（美好的）

!!!:20、复（!復複覆）
fù：復习、重複、反復、答復、恢復、报復、复復

　　　　　　　 　繁複、複杂、複本、複方、複核、複印、複姓

　　　　　　　　 答覆、回覆

又：国家“覆”亡，不是“復”亡。

!!!:21、干（~幹乾）
：干（ɡān）戈、干犯、干涉、干支、天干地支

　　　　　 幹（ɡàn）部、才幹、单幹、公幹、幹群关系

　 乾（ɡān）燥、乾杯、乾冰、乾枯、乾妹子、阴乾、晒乾、乾柴烈火

　　　　　　　乾（ qián）坤、乾隆皇帝

　　又：干与幹都是多音多义字，干本读（gān），本义是盾牌，引申为冒犯、求取、干预、关涉等义，还有一些别的读音和字义。幹本读（gàn），本义是築墙板，常用义有草木的茎、事物的主体、才能、做事、谋求等等。二字音义不同，是两个不同的字，简化字把它们的音义并入“干”了。

!!!:22、谷（~榖）
：山谷（ɡǔ）、进退维谷

榖子百榖 佈榖 榖梁（姓氏）榖神 榖雨 榖风（东风）

吐谷（yù）浑：（我国古代少数民族）

又：谷穀基本上不通用，以谷代穀破坏了它们的表意性，给人们的掌握造成了很大困难。且谷穀都是多义字，归并后负担过重。

!!!:23、刮（~颳）
 ɡuā：刮脸、搜刮

颳风下雨

!!!:24、合（~閤）
：合hé作、合拢

又读ɡě：一合米（容量单位）

閤（hé）家团圆 閤第 閤阜山（地名）

!!!:25、后（~後）
 hòu：皇后后稷后土后羿棋后影后歌后 先后（已故皇后）

後来、前後 先後

!!!:26、胡（~鬍）
hú：胡说、胡人、胡琴

鬍子、八字鬍

!!!:27、划（~劃畫）
：划（huá）船、划算、划拳、划不来、划水；

　　　　　　劃（huà）归、劃时代、劃分、计劃

　　　　　　劃（huá）了一条痕

　　　　　　又：“计划”的正体字写作“計畫”。

!!!:28、回（~迴）
huí：回家、回报

廻旋低廻廻肠廻廊廻翔廻音壁（曲折环绕）

!!!:29、汇（!彙匯）
huì：彙聚、总彙、词彙、彙刊、彙印

匯合、匯款、匯总

!!!:30、伙（~夥）
huǒ：伙食、伙房、包伙、入伙、家伙

　　　　　　　 　夥计、团夥（表示多）

!!!:31、获（!獲穫）
huò：捕獲、獲得

收穫庄稼

!!!:32、饥（!飢饑）
jī飢（饑）jī：飢寒、飢不择食、充飢

饑餓 饑饉饑民 饑荒

!!!:33、几（~幾）
：茶几（jī）几案几席窗明几凈

几江（地名）、几遽（人名）

幾（Jǐ）个人、

幾（Jī）乎

!!!:34、家（~傢）
：家jiā庭、家乡

　　　　　　傢具、傢什

　　　　　　姑娘家jia

!!!:35、姜（~薑）
jiānɡ：姓氏

　　　　　　　　　生薑 畺虫 畺斋诗话

!!!:36、借（~藉）
jiè：借东西

　　　　　 （假托、凭借）死亡枕藉、藉口、藉重、天子藉田千亩（《春秋》）

!!!:37、尽（!盡儘）
：盡jìn头、盡力、盡忠

儘jǐn管、儘够、儘其所有、儘量

!!!:38、据（~據）
：拮据（jù）

　　　　　　據（jù）点、據说、凭據

!!!:39、卷（~捲）
：画卷（juàn）、考卷、书卷

　　　　　　捲（juǎn ）走、翻捲、花捲、捲烟、捲心菜

!!!:40、克（~剋）
kè：克服、克勤克俭、以柔克刚

千克（数量词）

剋期、剋食、挨剋、剋薄、剋星

!!!:41、夸（~誇）
kuā：夸父追月、夸娥、夸特（译名）

誇奖、誇口

!!!:42、困（~睏）
kùn：困难、困苦

　　　　　　　　睏倦、乏睏、睏惫、睏倦

!!!:43、累（~纍）
：连累（lěi）、累次、连篇纍牍

　　　　　　劳累（lèi）、累人

　　　　　　纍贅（léi）、纍臣、纍囚

　　　　　　纍（作大索解）：斫纍、纍囚

!!!:44、漓（~灕）
 lí桂林灕江

淋漓尽致

!!!:45、篱（~籬）
 lí：樊籬笊籬

篱笆

!!!:46、里（~裏裡）
lǐ：公里、乡里（邻里）、故里、里正（古代官名）

居里、里根（译名）、里麻（土司名）

裏（裡）外、裏（裡）面、我们乡裏（裡）（裡面）

!!!:47、历（!歷曆）
 lì：歷史、经歷

日曆、挂曆、旧曆

!!!:48、帘（~簾）
lián：酒帘、帘帜

窗簾、垂簾

!!!:49、了（~瞭）
：了（liǎo）却、了解

　　　　　　瞭（liào）望、瞭亮、瞭然

!!!:50、么（~麽）
：ma 助词

　　　　　　么（yāo）（今写作“幺”）

　　　　　　这麽（me）办（用于“幺麽”和姓氏人名等）

　　　　　　读mó不简化：幺麽小丑、幺二三

!!!:51、蒙（~濛懞矇）
：蒙（měnɡ）古

濛（ménɡ）濛雨、濛鸿、迷濛（用于人名、地名）

　　　　　　　　矇（mēnɡ）骗、矇眬、矇聩、矇头转向

　　　　　　　　懞（ménɡ）眬（朴实敦厚）、懞汉

!!!:52、弥（!彌瀰）
mí：弥（彌）补、欲盖弥彰（尔的类推简化）

瀰漫、瀰迤

　　　　　　 名闻遐迩（边旁类推简化）

!!!:53、面（~麵）
miàn：面孔、冷面孔

麵粉、拉麵、冷麵

!!!:54、蔑（~衊）
miè：轻蔑、侮蔑、蔑视

诬衊、污衊（原指血污，比喻毁谤）

!!!:55、辟（~闢）
：复辟（bì）辟除、辟谷、大辟

開闢（pì）、精闢透闢闢谣

辟（pī）头

!!!:56、扑（~撲）
:pū扑（名词：刑杖，戒尺）

撲打、撲空

bǔ扑桃（古西域地名）

!!!:57、仆（~僕）
：前仆pū后继、颠仆、偃仆

僕pú人、公僕

!!!:58、朴（~樸）
：朴（piáo ）姓名（抱朴子）、

　　　　　　朴（pō）刀、朴树（乔木）

　　　　　　樸素（pǔ）、樸纯、樸拙

!!!:59、千（~韆）
qiān：千年、千秋万代

鞦韆

!!!:60、签（!簽籤）
qiān：簽名、簽到、簽署

　　　　　　 拜神求籤

!!!:61、秋（~鞦）
qiū：秋天、千秋

　　　　　　　　鞦韆

!!!:62、曲（~麯）
：曲qū折

　　　　　　酒麯qū

　　　　　　元曲qǔ 歌曲

!!!:63、舍（~捨）
：宿舍（ shè）、寒舍、舍弟

捨（ shě）施、捨得、捨本求末

!!!:64、沈（~瀋）
shěn：沈（姓名）

　　　　　　 瀋陽市

!!!:65、术（~術）
：白术（zhú）、苍术

　　　　　　技術（ shù）、手術、学術

!!!:66、松（~鬆）
sōng：松树、松仁、武松打虎

　　　　　　　　　轻鬆、肉鬆、鬆了一口气

!!!:67、苏（!蘇囌）
sū：苏联、苏州

啰囌

!!!:68、台（~臺檯颱）
：兄台（tái）台端台启台照一台机器两台马达

　　　　　　　　天台（tāi）山、台州　　　　　　　　

　　　　　　　　臺tái湾、高臺、倒臺、楼臺、炮臺、臺阁、阳臺

　　　　　　　　写字檯tái 檯灯、镜檯

　　　　　　　　颱风tái

　　又；台是多音多义字。读（yí）时作第一人称代词，又有别的意义；读（tái）时，与臺檯颱读音相同，但意义各不相同。台，组成三台一词，星名，还可作敬词、量词、地名、鱼名等。臺，樓臺。檯（後起字），桌子。颱，颱風。台还有另外一些音义。這四個字的意義各不相同，简化字归并作台。

!!!:69、坛（!壇罎）
tán：天壇、文壇、论壇、花壇

酒罎子、醋罎

!!!:70、涂（~塗）
：涂（tú）（姓名：明人涂谦、涂祯）、

涂（xu2）吾（水名）

塗改、路塗

塗谦（元人名）

!!!:71、团（!團糰）
tuán ：团结

米糰、汤糰

!!!:72、万（~萬）
：万（mò）俟（姓）

一萬（wàn）元、千千萬萬

!!!:73、系（~係繫）
：系（xì）统、中文系

　　　　　　　关係、联係

　　　　　　　繫（jì）带子、捕繫、拘繫、繫囚

!!!:74、纤（!縴纖）
：縴（qiàn）夫、拉縴

　　　　　 纖（xiān ）维、纖尘不染

!!!:75、咸（~鹹）
xián：咸宜、咸亨酒店、老少皆宜

鹹味、鹹鱼

!!!:76、向（~嚮）
xiànɡ：方向、向前走

　　　　　　　 　嚮导

!!!:77、须（~鬚）
xū：必须

鬍鬚

!!!:78、旋（~镟）
：盘旋xuán、旋即离去

旋xuàn风、旋即离去

镟xuàn子（工具）、鏇床

!!!:79、叶（~葉）
：叶（xié）韵

　　　　　　树葉（yè）

!!!:80、余（~餘）
yú：余（我本人） 余之馀钱余之馀年

　　　　　　　 多馀、业馀

!!!:81、吁（~籲）
：吁（ xū）长吁短叹

呼籲（yù）

!!!:82、郁（~鬰）
yù: 鬰（姓氏）

鬰闷、鬰鬰葱葱

香气馥郁、郁郁乎文也、郁金香

郁（姓名）

!!!:83、御（~禦）
yù：御花园、御笔、御史大夫

抵禦、禦敌

　　又：御禦是多义字，御的本义是駕御馬車，引申有驾驶马车的人、乘坐、治理、与女子同居、与帝王有关的事物、侍奉、进献、观望、凭借、陈列等多种义项。禦，本义是祭祀，引申有禁止、抗拒、匹敌、护卫、强暴、大臣、车前挂的竹帘等多种意义。二字只是在阻擋、防禦、进献的义项上可以通假，其它义项都不相通。

!!!:84、云（~雲）
yún：人云亦云 诗曰子云

天高雲淡

!!!:85、芸（~蕓）
yún：芸香（云的类推简化字）

蕓薹（植物名）

!!!:86、脏（!髒臟）
：肮髒（zānɡ）

心臟（ zànɡ）

!!!:87、折（~摺）
: 折（shé）本、腿折了

　　　　　　　折（zhē）跟头

奏摺（zhé）、摺叠

!!!:88、征（~徵）
：征服（zhēng ）、征税

徵（zhēnɡ）求、徵稿、徵召

　　　　　　徵（zhǐ）古音：宫商角徵羽

!!!:89、症（~癥）
：症（zhènɡ）候

　　　　　　癥（zhēnɡ）结（腹中结块之病）

!!!:90、只（~隻祗）
：船只（zhī）、形单影只，片言只语

一隻（zhī）鸟、两隻手

祗（zhǐ）要（只要·副词）

祗（又音qí）祗衼（袈裟）（义为地神）

!!!:91、制（~製）
zhì：节制、制度英制（英国的度量衡单位）

製造、製艺 英製（英国製造）

!!!:92、致（~緻）
zhì：致力、以致、标致、导致、极致、淋漓尽致

细緻、緻密

!!!:93、钟（!鐘鍾）
zhōng：鐘錶、警鐘

　　　　　　　　 　鍾情

　　　　　　　　 　鍾（用于姓名）

!!!:94、筑（~築）
zhù：筑（古乐器）

　　　　　　　　建築、築坝

!!!:95、准（~凖）
zhǔn：准许、获准

準则、瞄準

　　以上为《通用规范汉字表》（征求意见稿）中《简繁汉字对照表》 2451个简化字里打“*”的95个“对应多个繁体字的简化字”。

（二）、以下是我认为应该还有30来个“对应多个繁体字的简化字”，即学術界称之谓“非对称繁简字”。

两者相加，我得出125对“非对称繁简字”。这些字可以在以后再分析、辨别和选用。

!!!@:（96）、价（~價）
：价（jiè）（古指被派遣之人）

價（jià）格、

成天價（jie ）忙

!!!@:（97）、腊（~臘）
：腊（xī）（肉干）

臘（là）臘月、臘肉、臘祭

!!!@:（98）、蜡（~蠟）
：古代年祭zhà：蜡宾、蜡社、蜡享

蠟（là）烛

!!!@:（99）、霉（~黴）
méi：霉天、倒霉、霉头

　　　　　　　 　黴黑、黴菌、黴变

!!!@:（100）、广（~廣）
：同“庵”（ān ）

　　　　　 　广（guǎnɡ）濶

!!!@:（101）、虫（~蟲）
：虫（huǐ）“虺”的本字

　　　　　 　昆蟲（chónɡ）

!!!@:（102）、个（~個箇）
 ɡè：个别（個别）

　　　　　　 地名“个旧”应是“箇舊”

!!!@:（103）、厂（~廠）
：厂（ān）同庵，用于人名

　　　　　 工厰（chǎnɡ）厰房

!!!@:（104）、儿（~兒）
ér：古文奇字“人”、又，旧注音字母

“兒”又读ní，不简化

!!!@:（105）、凭（~憑）
pínɡ：凭几、凭栏；

文憑、憑证

!!!@:（106）、柜（~櫃）
：柜（jǔ）柳（树名）

櫃（ɡuì）子、大掌櫃

!!!@:（107）、坏（~壞）
：壞huài人

又读作pī，宜写作“坯”

!!!@:（108）、构（~構）
gou4：构造、结构

　　　 表示“牵”义时，作搆：搆兵、搆陷、搆怨

!!!@:（109）、卤（!鹵滷）
lǔ：滷水、滷味

　　　　　　　 　化学鹵元素

!!!@:（110）、罗（!羅囉）
luó：羅（姓名）

囉嗦

!!!@:（111）、苹（~蘋）
：蘋（pín）草，《诗经》“于以采蘋”；宋玉《风赋》“起于青蘋之末”

蘋（ pínɡ）果、

苹（pínɡ）（草类），《诗经》“呦呦鸣鹿，食野之苹”

　 又：苹，本读（pínɡ），草名，指艾蒿、蒲白；又同萍；还有别的读音和字义。蘋，本读（pín,），草名，指大蘋（一名田字草），又作蘋果的蘋。二字不通用。

!!!@:（112）、担（~擔）
：担（dǎn）同掸、

　　　　　　 担（jie1）担轿

擔（dān）擔子

　　　　　 擔（shan3）主擔（假借）

!!!@:（113）、确（~確）
què：本义山多大石之状，商确、确瘠

確（坚定义）认、確信

!!!@:（114）、胜（~勝）
：胜（shēnɡ）肽（肉类）、腥的本字（《说文》）

　　　　　　 勝（ shènɡ）利

　　　又：胜，本读（xīnɡ），是腥的本字，还有别的读音和字义；勝，音（shēng）,本义是能承担，后又有胜利、超过、克制、美好等多种意义。简化字以胜代勝，胜的本音本义消失。

!!!@:（115）、适（~適）
：适（kuò）古人名，可恢复古字

　　　　　 適（shì）合

適（dí）（匹敌）、

　　　　　 適（zhé）（惩罚）

又：适，適古不同字，简化字以适代適，适的本音消失，可是，现代人却要经常遇到南宫适、洪适这些人名，无字可用，只好起用适的本字来代表它。这样递相代替，不仅给古籍阅读造成极大麻烦，而且代替本身事倍功半，得不偿失，不如恢复其旧。

!!!@:（116）、体（~體）
：体（dèn ）体夫（抬死人者）

身體（tǐ）

體（tī）己

!!!@:（117）、宁（~寕）
：宁（zhù）“貯”的古字，今作“贮”

寕（nínɡ）波、安寕

!!!@:（118）、药（~藥）
yào：药草（白芷）

　　　　　　　　 藥丸

!!!@:（119）、佣（~傭）
：佣（yònɡ）金

傭（yōnɡ）人、帮傭

!!!@:（120）、与（~與）
：赐与（yǔ）

　　　　　　 参與（yù）

!!!@:（121）、愿（~願）
yuàn：乡愿、诚愿

願意

!!!@:（122）、种（~種）
：种（chónɡ）（姓名）

種（zhòng）田

!!!@:（123）、朱（~硃）
zhū：红色

　　　　　　　　 姓氏

　　　　　　　　 硃（朱砂）、皇上硃批

!!!@:（124）、沄（~澐）
：yún 大江沄沄（云的类推简化）

澐：指大波浪

!!!@:（125）、象（~像）
: 大象

人像

（三）、《简化字总表》所附录的《第一批异体字整理表》中习惯被当作简化字的39个选用字（多可作“非对称繁简字”看待）

!!!&:1、呆（~獃）
呆（呆板；獃子）
!!!&:2、布（~佈）
布（棉布；佈告）
!!!&:3、痴（~癡）
痴（癡）
!!!&:4、床（~牀）
床（牀）
!!!&:5、唇（~脣）
唇（脣）
!!!&:6、雇（~僱）
雇（僱）
!!!&:7、挂（~罣褂）
挂（挂衣服；罣碍、罣虑、罣误；褂 ）
!!!&:8、哄（~閧鬨）
哄（哄小孩；閧堂大笑 一閧而起、一閧之市---同“巷”、鬨）
!!!&:9、迹（~蹟跡）
迹（蹟跡）
!!!&:10、秸（~稭）#?
秸（稭）
!!!&:11、杰（~傑）
杰（杰出；许傑—人名）
!!!&:12、巨（~鉅）
巨（钜鹿、钜野—地名、钜富、钜子；巨大）
!!!&:13、昆（~崐）
昆（昆仲；崐山）
!!!&:14、捆（~綑）
捆（綑）
!!!&:15、泪（~淚）#?
泪（淚）
!!!&:16、厘（~釐）
厘（厘米；釐定釐妇釐革釐正）
!!!&:17、麻（~蔴）
麻（麻烦；蔴绳）
!!!&:18、脉（~脈）#?
脉（脈）
!!!&:19、猫（~貓）#?
猫（貓）
!!!&:20、栖（~棲）
栖（棲）
!!!&:21、弃（~棄）#?
弃（棄）
!!!&:22、升（~陞昇）
升（升级；提陞、陞官；日昇、昇华、歌舞昇平、毕昇）
!!!&:23、笋（~筍）#?
笋（筍）
!!!&:24、它（~牠）
它（它；牠—指动物）
!!!&:25、席（~蓆）
席（主席；草蓆 ）
!!!&:26、凶（~兇）
凶（兇）
!!!&:27、绣（~繡）
绣（繡）
!!!&:28、锈（~鏽）#?
锈（鏽）
!!!&:29、岩（~巖）
岩（岩石；山巖 ）
!!!&:30、异（~異）#?
异（異）
!!!&:31、涌（~湧）
涌（湧）
!!!&:32、岳（~嶽）
岳（岳飞；东嶽）
!!!&:33、韵（~韻）
韵（韻）
!!!&:34、灾（!災葘）#?
灾（災葘）
!!!&:35、札（~劄）
札（劄）
!!!&:36、扎（~紮）
扎（书紮；扎堆）
!!!&:37、占（~佔）
占（占卜；佔领）
!!!&:38、周（~週）
周（周围；每週一）
!!!&:39、注（~註）
注（注水；註解 ）

（四）、《第一批异体字整理表》中另外习惯当作简化字的28个选用字（北京学者李乐毅先生称为广义简化字，多数可作“非对称繁简字”看待）

!!!$:1、暗（~闇）
暗（闇）：天暗；（闇：闇蔼闇昧闇弱闇室昏闇偏听则闇）
!!!$:2、背（~揹）
背（后背；揹东西揹带揹债揹枪）
!!!$:3、并（~併並竝）
并（合併；並〈竝〉且）
!!!$:4、采（~採寀）
采（精采；採花、寀）
!!!$:5、秆（~稈）#?
秆（稈）
!!!$:6、杆（~桿）
杆（桿）
!!!$:7、杠（~槓）
杠（槓）
!!!$:8、棱（~稜）
棱（稜）
!!!$:9、果（~菓）#?
果（果然；水菓开花结菓菓珍）
!!!$:10、狸（~貍）
狸（貍）
!!!$:11、梁（~樑）
梁（姓名；棟樑）
!!!$:12、昵（~暱）#?
昵（暱）
!!!$:13、念（~唸）
念（纪念；唸书）
!!!$:14、拈（~撚）
拈（撚）
!!!$:15、娘（~孃）
娘（娘亲；丹孃）
!!!$:16、凄（!淒悽）
凄（淒悽）
!!!$:17、妊（~姙）#?
妊（姙）
!!!$:18、虱（~蝨）
虱（蝨）
!!!$:19、拓（~搨）#?
拓（开拓；搨碑）
!!!$:20、喂（~餵）
喂（呼声“喂”；餵饭）
!!!$:21、幸（~倖）
幸（幸福；侥倖）
!!!$:22、殷（~慇）
殷（富殷；慇勤）
!!!$:23、游（~遊）
游（游泳；遊行）
!!!$:24、欲（~慾）
欲（欲要；慾望）
!!!$:25、志（~誌）
志（志气；日誌）
!!!$:26、伫（~佇竚）#?
伫（佇竚）
!!!$:27、踪（~蹤）#?
踪（蹤）
!!!$:28、藤（~籐）
藤（籐）

（五）、《第一批异体字整理表》中还有21个选用字，多数也可作“非对称繁简字”看待。
!!!$:1、奔（~犇）#?
奔（奔跑；牛犇—人名）
!!!$:2、雕（~鵰凋彫）
雕（大鵰；雕刻；凋零；彫残）
!!!$:3、豆（~荳）#?
豆（如豆之火；毛荳）
!!!$:4、和（~龢）#?
和（和平；翁同龢—人名）
!!!$:5、斤（~觔）#?
斤（斤两；翻觔斗）
!!!$:6、乃（~廼）
乃（乃是；廼---人名）
!!!$:7、局（~跼）
局（局部；跼躅、跼蹙、跼足）
!!!$:8、坤（~堃）#?
坤（乾坤；家堃---人名）
!!!$:9、苏（!蘇甦囌）
蘇（蘇联；甦醒；噜囌）
xxx see below19、托（託） !!!$:10、托（讬）
托（托起；拜讬）
!!!$:11、晰（~皙）#?
晰（清晰；皙—人名）
!!!$:12、仙（~僊）#?
仙（仙；僊—人名）
!!!$:13、修（~脩）
修（修理；束脩）
!!!$:14、夭（~殀）
夭（逃之夭夭；殀折）
!!!$:15、于（~於）
于（于飞、于归；在于；於乎、於戏、於是乎）
!!!$:16、哲（~喆）#?
哲（哲学；喆—人名）
!!!$:17、尸（~屍）
尸（尸鸠—鸟名；尸祝—人名、尸位；屍体）
!!!$:18、搜（~蒐）
搜（蒐乘补卒，秣马厉兵；蒐阅）
!!!$:19、托（~託）
托（託：拜託、寄託、託词、嘱託；托：托起）
!!!$:20、挽（~輓）
挽（輓：輓词、輓车、輓联；挽救、挽回）
!!!$:21、吊（~弔）
吊（吊东西；弔词弔孝弔唁弔民伐罪形影相弔）
!!!$:22、欢（!歡驩）
欢（驩）huān：欢喜、欢迎；驩附、驩合、驩州---古地名）
!!!$:23、毁（~燬）
毁（毁燬）huǐ：毁灭、毁坏；王室如燬《诗经》、燬炎莫俪《柳宗元·天对》
!!!$:24、奸（~姦）
姦（奸）jiān：通姦、姦情；奸人、奸细
!!!$:25、荡（!蕩盪）
荡（蕩、盪）dànɡ动蕩、芦花蕩；倾家盪产、盪秋千

（全文完）

xxxxx
【注】

[1]“非对称简繁字”是陈明然的提法；“非对称繁简字”是周胜鸿、冯寿忠等人士的提法；“不对称汉字”是王敏東博士的提法（参见《民间汉字书同文研究十周年纪念文集》香港鹭达文化公司2007年出版）。

[2]本文和谐体所用的繁体字及词例如下：

转换後、学術、标準、规範 关係、築墙板；计6字。
#""" # 非对称繁简字




##section##
#一简多繁 *为-為爲
#一繁多简 *沈沉/沈
古今繁简字异体字使用对照表 = r"""
古今繁简字异体字使用对照表
http://blog.sina.com.cn/s/blog_5e2ffb490102v0tz.html

网络搜集整理的古代繁体字在现代的使用方法。异体字，繁体字在不同的语言环境和词义下是如何使用的。了解学习可增加自己的古文字知识，提高自己的文字修养水平，对于抄写古代诗词的书法爱好者来说，将简化字转换成繁体字，书写书法作品是非常实用的。（古文字知识，书法繁简字使用，如何写好繁体字）

 ●“为”统一替换为“爲”
*为-為爲
 ● 並，并，併 ——古代完全不通用。
*并-并併並
   并，併是同义词，“兼并”的意义写作并、併，不写作並
   “一起”的意义写作並，很少写并、併
   “依傍”的意义只写作並
   “抛弃”的意义只写作并、併
●  才，纔
*才-才纔
   “才能”之意，用才
   “刚刚”“方才”“仅仅”之意，用纔
● 采，綵，採，寀，埰，棌
*采-采埰寀採綵棌
   “摘取”的意义写作採
   “彩色丝织品”的意义写作綵
   “卿大夫受封土地”的意义写作寀，埰    【例词：寀地，寀邑】
   “栎树”，又叫“柞树”的意义写作棌     【例词：棌椽】
● 彩，綵 ——古代是两个字
*彩-彩綵
    綵仅用于彩色丝织品
   “彩色”，“光彩”用彩
● 抄，钞，杪
*抄-抄杪鈔
*抄钞/鈔
   “掠夺”，“抄写”之意用抄
   “末尾”“最后”之意用钞（杪），读miao3声   【例词：教行于钞】
● 沈，沉
*沈-沉沈
*沈沉/沈
   沉古代写作沈，但沈没一般写作沉没
● 冲，衝 ——古代是两个字
*冲-沖衝
  空虚、谦虚、年幼之意用冲（沖）
 【例词：大盈若冲；谦冲节  俭；方年冲貌……】
  交通要道、冲击、向着、对着之意用衝
 【例词：天下之衝；衝撞；首衝南方……】
● 丑，醜
*丑-丑醜
  “地支”用丑
  美丑、厌恶、丑角等时用醜
● 仇、讎
*仇-仇讎
  地名、姓氏用仇
  仇恨、仇敵可用讎
● 斗，鬥（鬦，鬭）
*斗-斗鬥鬦鬭
  古代盛酒器、容量單位、星宿名用斗
 【例字：北斗星、車載斗量、斗膽、漏斗】
  争斗、战斗用鬥（鬦，鬭）
● 厄，阨 ——古代是两个字
*厄-厄阨
  阻塞、险要地势、狭隘等一般写作阨
● 范，範 ——古代是两个字，作姓时只能用范
*范-范範
● 丰，豐 ——古代是两个字
*丰-豐丰
 丰一般只用于形容容貌和神态，豐可以用于形容各种事物
【例词：丰采、丰姿、丰韵、丰儀】
【例詞：豐年；豐茂】
● 復，複，覆
*复-復複覆
     複，有“夹衣”，“繁复”，“重复”之意
     復，有“回来，回去”，“报复”，“再，又”，“回答”，“免除赋税”之意
     覆，有“遮盖”，“翻转过来”，“颠覆”之意
     複的“夹层的”，“重复的”意思，覆的“翻过来”的意思，可以写作復
     復的义项不能写作複
● 干，乾，幹，榦
*干-干乾幹榦
    “天干地支”用干
    “冒犯”“干预”用干   【例词：干戈】
    “干湿”用乾    【例词：乾杯、乾旱】
    “树干”用榦    【例词：樹幹、骨幹、幹流】
    “才干”用幹    【例词：才幹、幹活、幹練、幹部、骨幹】
● 谷，穀
*谷-谷穀
   “山谷”用谷
   “粮食”“俸禄”用穀
● 館，舘
*馆-館舘
  “宾馆，客舍”“图书馆”用舘
  “饭馆”用館
● 盡，儘
*尽-盡儘
 “尽头”“顶点”“全部”，用盡   【例字：盡可能，盡善盡美，滿城盡帶黃金甲】
 “任凭”之意用儘
● 歷、曆
*历-歷曆
   【例字：曆法、曆書、日曆、曆象】
   【例字：歷史、經歷、閱歷、歷代、歷年、歷歷在目】
● 志、誌
*志-志誌
   1.表意向。“志氣”“志愿”“志趣”“志士”“志学”之意時用志；
   2.记，记在心里，祝贺：新婚誌禧。誌哀。永誌不忘。用誌
   3.记号和记载的文字：“标誌”“雜誌”、誌怪、“墓誌”等用誌
● 凭、憑
*凭-憑凭
   “靠着”义项时用凭，其余义项用憑   【例字：怒发冲冠，凭栏处。】
● 仆、僕
*仆-僕仆
   “向前倒下”之意用仆，仆倒，前仆后继。“僕人、奴僕”之意用僕
● 升、昇、陞
*升-升昇陞
   “量名”用升；
   “太阳升起”用昇、升；
   “升官、提拔升迁”在唐以前用昇、升，唐以后用陞
● 台、臺
*台-臺台
   台：第一人称代词、星宿名。    【 例：三台、兄台、台甫】
   臺：土质的高台，古代官署名。
● 涂、塗
*涂-涂塗
   道路的意义一般用涂
   涂抹，涂饰用塗
● 万、萬
*万-萬万
  复姓“万俟”（mo qi）写作万
● 系、係、繫
*系-系係繫
   在“栓绑”、“连接”和“带子”的意义上，这三个字可以通用。
   但“世系”、“系统”的意义一般写作系
   在“关联”的意义上，一般写作係、繫
   係在古白话中还可以用作“是”，如“实係此人”
● 游、遊
*游-游遊
   凡有关水中的活动，一般只能用游，而有关陆地上活动的，游、游可以通用。
● 于、於
*于-於于
   《诗经》《尚书》《周易》多用作于，其他书多用作於。动词词头用于，叹词用於，不能相混。
   【例词：關于、屬于、青出于藍、樂于助人、輕于鴻毛、易于了解】
   【例：三台、兄台、台甫】
● 余、餘
*余-余餘
   表示第一人称用余，表示剩下的、业余等，用餘
● 郁、鬱
*郁-郁鬱
   郁，有文采的样子/ 云、汽浓盛的样子
   鬱，树木丛生、茂盛 / 忧愁，愁闷
   人名時，如李郁周，用郁而不用鬱。
●札、劄
*札-劄札
   札，书信、书写的小木片
   劄，奏札、宋朝中央机构发布指令的文书
 ●征、徵
*征-征徵
   征，出征、远行、征伐、征税
   徵，追究、证明、应验、迹象预兆
●制、製
*制-制製
   制：制作、制造；禁止、遏制；规定、制定；规章、制度；帝王命令；规模
   製：制作、制造；裁制衣服；写作
●鍾、鐘
*钟-鍾鐘
   鍾：酒器；量器；积聚
   鐘：一种乐器，通鍾
   注意人名中的用法：鍾繇、鍾子期、錢鍾書、張鍾麟
●后、後
*后-後后
   皇后、博士后用“后”，后来、以后用“後”
●發、髮
*发-發髮
   發展、頭髮
●跡、蹟
*迹-跡蹟
   异体字，杂志中統一用“跡”
● 里、裏、裡
*里-里裡裏
   邻里、公里、里程、国外人名地名译音中用“里”
  “裏”和“裡”是异体字，杂志中统一用“裏”
●咸、鹹
*咸-鹹咸
   少长咸集、年号（咸亨、咸丰）、地名（咸宁）中用“咸”；咸淡用“鹹”
●獲、穫
*获-獲穫
  獲，捕(獲），(獲)得
  穫，本义收割庄稼，收穫，秋穫冬藏

  干：對應三個繁體字：(干)涉，(乾)燥，(幹)部;
  后：對應兩個繁體字：(後)面，皇(后)；
  系：對應三個繁體字：唔(系)，關(係)，聯(繫)；
  历：對應兩個繁體字：(歷)史，日(曆)；
  钟：對應兩個繁體字：時(鐘)，(鍾)意；
  板：對應兩個繁體字：老（闆），木（板）；
*板-板闆
  表：對應兩個繁體字：手（錶），外（表）；
*表-表錶
  丑：對應兩個繁體字：（醜）怪，子（丑）寅卯；
  范：對應兩個繁體字：模（範），（范）仲淹[注：姓氏]；
  丰：對應兩個繁體字：（豐）富，（丰）采；
  刮：對應兩個繁體字：（颳）風，搜（刮）；
*刮-刮颳
  胡：對應兩個繁體字：(鬍)須，（胡）闹,（胡）亂；
*胡-胡鬍
  回：對應兩個繁體字：（迴）旋，(回)頭,(回)報,(回)族；
*回-回迴
  伙：對應兩個繁體字：(夥)計,團(夥)，(伙)食，(伙)房；
*伙-夥伙
  姜：對應兩個繁體字：生(薑)，(姜)子牙[注：姓氏]；
*姜-姜薑
  借：對應兩個繁體字：(藉)口,(藉)題發挥，(借)錢；
*借-借藉
  克：對應兩個繁體字：攻(剋),(剋)期，(克)勤(克)儉，千(克)；
*克-克剋
  困：對應兩個繁體字：(睏)倦，(睏)覺，(困)苦，圍(困)；
*困-困睏
  漓：對應兩個繁體字：(灕)江，淋(漓)；
*漓-漓灕
  里：對應兩個繁體字：表(裏)不一，這(裏)，(里)程，鄰(里)關係；
  帘：對應兩個繁體字：窗(簾)，垂(簾)聽政，酒(帘)[注：旗子狀嘅標誌]；
*帘-簾帘
  面：對應兩個繁體字：(麵)粉，(麵)條，當(面)，表(面)，反(面)；
*面-面麵
  蔑：對應兩個繁體字：污(衊)，(蔑)視；
*蔑-蔑衊
  千：對應兩個繁體字：鞦(韆)[注：簡體:秋千]，一(千)，(千)秋基业；
*千-千韆
  秋：對應兩個繁體字：(鞦)韆，(秋)季；
*秋-秋鞦
  松：對應兩個繁體字：(鬆)散，(松)樹；
*松-松鬆
  咸：對應兩個繁體字：(鹹)菜，老少(咸)宜；
  向：對應兩個繁體字：(向)前走，方(嚮)；
*向-向嚮
  余：對應兩個繁體字：業(餘)愛好，(余)[注：第一人稱代詞，我]；
  御：對應兩個繁體字：抵(禦)，(御)驾親征；
*御-御禦
  云：對應兩個繁體字：(雲)彩，(雲)南省，子曰詩云；
*云-雲云
  芸：對應兩個繁體字：(蕓)薹，(芸)香；
*芸-芸蕓
  沄：對應兩個繁體字：(澐)[注：大波浪]，大江(沄)(沄)；
*沄-沄澐
  致：對應兩個繁體字：細(緻)，(致)敬，(致)力；
*致-致緻
  制：對應兩個繁體字：節(制)，(制)度，(製)造；
  朱：對應兩個繁體字：(硃)[注：名詞：朱砂]，(朱)紅色;
*朱-朱硃
  筑：對應兩個繁體字：建(築)，(筑)[注：古代樂器]；
*筑-築筑
  准：對應兩個繁體字：(準)則，瞄(準)，(准)許；
*准-準准
  辟：對應兩個繁體字：复(辟)，開(闢)，精(闢)；
*辟-辟闢
  别：對應兩個繁體字：告(別)，(別)人，差(別)，(彆)扭；
*别-別彆
  卜：對應兩個繁體字：占(卜)，前程未(卜)，蘿(蔔);
*卜-卜蔔
  种：對應兩個繁體字：(种)[注：姓]，物(種)起源，(種)田；
*种-種种
  虫：對應兩個繁體字：昆(蟲)，毛(蟲)，長(虫)[注：“虺”的本字，毒蛇]
*虫-虫蟲
*虫虺/虫
  党：對應兩個繁體字：(党)項[注：姓氏]，(黨)員；
*党-黨党
  斗：對應兩個繁體字：車載(斗)量，煙(斗)，北(斗)星，(鬥)牛士，(鬥)智(鬥)勇；
  谷：對應兩個繁體字：五 (穀)雜糧，稻(穀)，山(谷)，進退維(谷)；
  划：對應兩個繁體字：(划)船，(划)得来，刻(劃)；
*划-劃划
  几：對應兩個繁體字：茶(几)，(幾)乎，(幾)個；
*几-幾几
  家：對應兩個繁體字：(傢)具，(傢)什，(家)庭，(家)乡，科学(家)；
*家-家傢
  据：對應兩個繁體字：占(據)，(據)點，凭(據)，拮(据)；
*据-據据
  卷：對應兩個繁體字：風(捲)殘雲，讀書破萬(卷)，試(卷)；
*卷-捲卷
  蜡：對應兩個繁體字：(蠟)燭，(蜡)[注：古代嘅一種年終祭祀]；
*蜡-蠟蜡
  了：對應兩個繁體字：(了)卻，受不(了)，(瞭)解、一目(瞭)然、不甚(瞭)(瞭)；
*了-了瞭
  累：對應兩個繁體字：(纍)贅，罪行(纍)(纍)，(纍)计，連(累)；勞（累）;
*累-累纍
  朴：對應兩個繁體字：(朴)刀，(樸)素；
*朴-朴樸
  仆：對應兩個繁體字：前(仆)后繼，(僕)人，公(僕)；
  曲：對應兩個繁體字：彎(曲)，戲(曲)，(麯)酒；
*曲-曲麯
  舍：對應兩個繁體字：(捨)棄，施(捨)，宿(舍)；
*舍-舍捨
  胜：對應兩個繁體字： (勝)利，名(勝)，(勝)任；臊（胜）xing
*胜-勝胜
*胜腥/胜
  术：對應兩個繁體字：技(術)，苍(术)[注：中草藥]，白(术)[注：中草藥]；
*术-術朮
  台：對應四個繁體字：
*台-臺台檯颱
      1.天(台)[注：山名又地名]，兄(台)[注：稱呼]；
      2.亭(臺)樓閣，舞(臺)，
      3.寫字(檯)；
      4.(颱)風；
  体：對應兩個繁體字：身(體)，(体)夫[注：抬靈柩嘅人）；
*体-體体
  涂：對應兩個繁體字：
      1.(涂)[注：水名；姓]，(涂)月[注：農曆十二月]，(涂)吾[注：水名(見《山海經?北山經》)];
      2. 生靈(塗)炭，(塗)改；
  吁：對應兩個繁體字： 長(吁)短歎，呼(籲)；
*吁-籲吁
  佣：對應兩個繁體字：雇(傭)，(傭)人，(佣)金；
*佣-傭佣
  折：對應兩個繁體字：奏(摺) ，(摺)叠，曲(摺)，(折)本，(折)斷；
*折-折摺
*折摺/摺
  征：對應兩個繁體字：遠(征)， (徵)召，象(徵)；
*征-征徵
*征徵/徵
  症：對應兩個繁體字：(症)候，(癥)[注：腹中結塊之病]結；
*症-症癥
　厂：對應兩個繁體字：(厂)[注：多用于人名］，工(廠)；
*厂-厂廠
  广：對應兩個繁體字：(广)[注：多用于人名］，(廣)阔、(廣)東省；
*广-廣广
  发：對應兩個繁體字：（發）達，頭（髮）；
*发-發髮
  复：對應兩個繁體字：重(複)，繁(複)，(複)雜，(復)查，(復)習；
  汇：對應兩個繁體字：(匯)合，(匯)款，(彙)聚，詞(彙);
*汇-匯彙
  获：對應兩個繁體字：捕(獲)，(獲)得，收(穫);
  尽：對應兩個繁體字：(儘)管，(盡)力，前功(盡)弃；
  苏：對應兩個繁體字：紫(蘇)，江(蘇)，(蘇)维埃，(甦)醒；
*苏-蘇甦
  坛：對應兩個繁體字：天(壇)，花(壇)，設(壇)，論(壇)，體(壇)，(罎)(罎)罐罐，(罎)子；
*坛-壇罎
  团：對應兩個繁體字：(團)结，(團)體，師(團)，(團)員, 湯(糰)，飯(糰)。
*团-團糰


#""" #古今繁简字异体字使用对照表




##section##
#克剋、钟锺、苹蘋、恶噁、朦濛、朱硃
my_collects = r"""
*巨-巨鉅
*巨钜/鉅
*么-么麽麼
*幺么/么
*么麽嗎/麽
*么麽嗎/麼
*苹蘋/蘋
*夹挟/挾
*托讬/託
*征徵/徵
*折摺/摺
*胜腥/胜
*抄钞/鈔
*沈沉/沈
*虫虺/虫
#"""



##section##
一简对多繁
一繁对多简
繁一對簡多的探討
非对应简繁汉字
非对称繁简字
古今繁简字异体字使用对照表



##section##
import io
import re
from seed.tiny import print_err

def _iter_line_tails(head, txt):
    fin = io.StringIO(txt)
    L = len(head)
    for line in fin:
        if line.startswith(head):
            tail = line[L:].strip()
            yield tail
def _parse_一简对多繁(一简对多繁):
    txt = 一简对多繁
    head = "!:"
    pattern = r"^(?P<一简>\w)→(?P<多繁>\w{2,})$"

    it = _iter_line_tails(head, txt)
    rex = re.compile(pattern)
    pairs = []
    for tail in it:
        m = rex.fullmatch(tail)
        assert m is not None
        p = m["一简"], m["多繁"]
        pairs.append(p)
    assert len(pairs) == 365

    s = set() # {(简,繁)}
    for 简, 多繁 in pairs:
        for 繁 in 多繁:
            s.add((简,繁))
    return s

def _parse_一繁对多简(一繁对多简):
    txt = 一繁对多简
    head = "!:"
    pattern = r"^(?P<一繁>\w)→(?P<多简>\w{2,})$"

    it = _iter_line_tails(head, txt)
    rex = re.compile(pattern)
    pairs = []
    for tail in it:
        m = rex.fullmatch(tail)
        assert m is not None
        p = m["一繁"], m["多简"]
        pairs.append(p)
    assert len(pairs) == 16

    s = set() # {(简,繁)}
    for 繁, 多简 in pairs:
        for 简 in 多简:
            s.add((简,繁))
    return s


def _parse_繁一對簡多的探討(繁一對簡多的探討):
    txt = 繁一對簡多的探討
    head = "!:"
    pattern = r"^(?P<一繁>\w)/(?P<多简>\w{2,})$"

    it = _iter_line_tails(head, txt)
    rex = re.compile(pattern)
    pairs = []
    for tail in it:
        m = rex.fullmatch(tail)
        assert m is not None
        p = m["一繁"], m["多简"]
        pairs.append(p)
    assert len(pairs) == 16

    s = set() # {(简,繁)}
    for 繁, 多简 in pairs:
        for 简 in 多简:
            s.add((简,繁))
    return s

def _remove_p(s):
    return re.sub(r"[（）]", '', s)

def _parse_非对应简繁汉字(非对应简繁汉字):
# 一繁多简 12-1
# !!@:餘/余（馀）
# !!@:摺（折）/折（摺）
# ?? !!@:鑪/炉
# 一简多繁 280=43+64+46+43+84
# !!:庵/庵菴（厂广）
# !!:仿佛/仿佛、彷彿、髣髴
# !!:干（乾）/干乾幹榦
# !!:夹（挟）/夾（夹）挾
# !!:菱/菱X
    非对应简繁汉字 = 非对应简繁汉字.replace('X', '※')
    非对应简繁汉字 = 非对应简繁汉字.replace('!!:仿佛/仿佛、彷彿、髣髴'
        ,r'''
!!:仿/仿彷髣
!!:佛/佛彿髴
        #'''
    ) #280 +1



    txt = 非对应简繁汉字
    s = set() # {(简,繁)}

    head = "!!@:"
    pattern = r"^(?P<一繁>[\w（）]+)/(?P<多简>[\w（）※]{2,})$"

    it = _iter_line_tails(head, txt)
    rex = re.compile(pattern)
    pairs = []
    for tail in it:
        m = rex.fullmatch(tail)
        assert m is not None
        p = m["一繁"], m["多简"]
        pairs.append(p)
    assert len(pairs) == 12 -1

    for 一繁, 多简 in pairs:
        for 繁 in _remove_p(一繁):
            for 简 in _remove_p(多简):
                s.add((简,繁))


    #=========
    head = "!!:"
    pattern = r"^(?P<一简>[\w（）]+)/(?P<多繁>[\w（）※]{2,})$"

    it = _iter_line_tails(head, txt)
    rex = re.compile(pattern)
    pairs = []
    for tail in it:
        m = rex.fullmatch(tail)
        assert m is not None
        p = m["一简"], m["多繁"]
        pairs.append(p)
    assert len(pairs) == 280 +1

    for 一简, 多繁 in pairs:
        for 简 in _remove_p(一简):
            for 繁 in _remove_p(多繁):
                if 繁 == "※":
                    print_err(f"{简}->{繁}")
                s.add((简,繁))

    return s


def _parse_非对称繁简字(非对称繁简字):
# ￥—替换为 常见繁体字
# 95
# !!!:11、当（!當噹）
# !!!:16、恶（~噁）
# !!!:21、干（~幹乾）
# 30
# !!!@:（110）、罗（!羅囉）
# 39
# !!!&:1、呆（￥獃）
# !!!&:15、泪（~淚）#
# 28
# !!!$:16、凄（￥淒悽）
# !!!$:26、伫（~佇竚）#?
# 21?25?24
# !!!$:2、雕（!鵰凋彫）
    非对称繁简字
    txt = 非对称繁简字
    pattern = r"^[^\s、]+、(?P<一简>\w)（(?P<多繁>[!~]\w+)）(?P<problem>(?:[#][?])?)$"
    head_count_pairs = [
            ("!!!:", 95)
            ,("!!!@:", 30)
            ,("!!!&:", 39)
            ,("!!!$:", 28+24)
            ]

    rex = re.compile(pattern)
    all_pairs = []
    for head, count in head_count_pairs:
        it = _iter_line_tails(head, txt)
        pairs = []
        for tail in it:
            m = rex.fullmatch(tail)
            assert m is not None
            if m["problem"]:
                print_err(tail)
            p = m["一简"], m["多繁"]
            pairs.append(p)
        assert len(pairs) == count
        all_pairs += pairs

    pairs = all_pairs
    s = set() # {(简,繁)}
    for 简, 多繁 in pairs:
        z = 简 if 多繁[0]=='~' else ''
        多繁 = z + 多繁[1:]
        assert len(多繁) >= 2
        for 繁 in 多繁:
            s.add((简,繁))
    return s


def _parse_古今繁简字异体字使用对照表(古今繁简字异体字使用对照表):
#一简多繁 *为-為爲
#一繁多简 *沈沉/沈
    txt = 古今繁简字异体字使用对照表
    head = "*"
    pattern0 = r"^(?P<一简>\w)-(?P<多繁>\w{2,})$"
    pattern1 = r"^(?P<多简>\w{2,})/(?P<一繁>\w)$"

    it = _iter_line_tails(head, txt)
    rex0 = re.compile(pattern0)
    rex1 = re.compile(pattern1)
    pairs0 = []
    pairs1 = []
    argss = [
            (rex0, pairs0, ("一简", "多繁"))
            ,(rex1, pairs1, ("一繁", "多简"))
            ]
    for tail in it:
        i = int("/" in tail)
        _i = int("-" in tail)
        assert i+_i == 1
        [rex, pairs, (k1, ks)] = argss[i]
        m = rex.fullmatch(tail)
        assert m is not None
        p = m[k1], m[ks]
        pairs.append(p)

    s = set() # {(简,繁)}

    for 简, 多繁 in pairs0:
        for 繁 in 多繁:
            s.add((简,繁))
    for 繁, 多简 in pairs1:
        for 简 in 多简:
            s.add((简,繁))
    return s





_parse_一简对多繁
_parse_一繁对多简
_parse_繁一對簡多的探討
_parse_非对应简繁汉字
_parse_非对称繁简字
_parse_古今繁简字异体字使用对照表
r"""
"""
if 0:
    s=_parse_一简对多繁(一简对多繁)
    s=_parse_一繁对多简(一繁对多简)
    s=_parse_繁一對簡多的探討(繁一對簡多的探討)
    s=_parse_非对应简繁汉字(非对应简繁汉字)
    s=_parse_非对称繁简字(非对称繁简字)
    s=_parse_古今繁简字异体字使用对照表(古今繁简字异体字使用对照表)
    print(s)

def _mk_非对称简繁字对集():
    ss = [
        _parse_一简对多繁(一简对多繁)
        ,_parse_一繁对多简(一繁对多简)
        ,_parse_繁一對簡多的探討(繁一對簡多的探討)
        ,_parse_非对应简繁汉字(非对应简繁汉字)
        ,_parse_非对称繁简字(非对称繁简字)
        ,_parse_古今繁简字异体字使用对照表(古今繁简字异体字使用对照表)
    ]

    s = set()
    s.update(*ss)
    return s

if 0:
    s=_mk_非对称简繁字对集()
    print(s)
    print(len(s))





##section##
class Globals:
    import nn_ns.CJK.CJK_data.raw as raw
    from pathlib import Path
    [raw_path] = raw.__path__
    繁简_path = Path(raw_path) / r"繁简转换[20200913]/"
    r"""
    chinese-converter-master
    chinese-utils-master
    funNLP-master
    nstools-master
    #"""
    # /sdcard/0my_files/git_repos/python3_src/nn_ns/CJK/CJK_data/raw/汉字笔顺表[20200913]/stroke-seq_MB-master[汉字笔顺表][20200827]/单字_笔顺码_29685个.txt

    ccm_path = 繁简_path / r"chinese-converter-master/ConverterMaps/"
    ccm_default_xml_path = ccm_path / r"00.Default.xml"
    ccm_wiki_xml_path = ccm_path / r"01.Wikipedia.xml"
    ccm_xml_example = r"""
<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<Config>
  <Converters>
    <Converter Id="0" Name="简转繁" SourceMapId="简体字符" DestMapId="繁体字符" />
  </Converters>
  <Maps>
    <!-- 字符对照表元素 Id：字符对照表ID(可为数字或字符串) Value：字符列表(部分符号请使用HTML转义字符) -->
    <Map Id="简体字符">锕皑</Map>
    <Map Id="繁体字符">錒皚</Map>
  </Maps>
</Config>
    """
    #"""

    ##
    cu_path = 繁简_path / r"chinese-utils-master/resources/"
    cu_simp_txt_path = cu_path / r"simp.txt"
    cu_trad_txt_path = cu_path / r"trad.txt"

    ##
    fnlp_path = 繁简_path / r"funNLP-master/"
    fnlp_map_txt_path = fnlp_path / r"fanjian_suoyin.txt"

    ##
    ns_zh_path = 繁简_path / r"nstools-master/zhtools/"
    ns_zh_chconv_py_path = ns_zh_path / r"chconv.py"
        #Simp2Trad_Table
        #Trad2Simp_Table
    ns_zh_wiki_py_path = ns_zh_path / r"zh_wiki.py"
        #zh2Hant
        #zh2Hans


def _parse_ccm(try_example=False, encoding='utf8', regex=True):

    if try_example:
        src_nm = "简体字符"
        dst_nm = "繁体字符"
        xml_fin = io.StringIO(Globals.ccm_xml_example)
        s = _parse_ccm_xml__file(xml_fin, src=src_nm, dst=dst_nm, regex=regex)
    else:
        xml_path_src_dst_ls = [
                (Globals.ccm_default_xml_path, "简体字符", "繁体字符")
                ,(Globals.ccm_wiki_xml_path, "0", "1")
                ]
        ls = []
        for xml_path, src_nm, dst_nm in xml_path_src_dst_ls:
            #print(xml_path)
            s = _parse_ccm_xml__path(xml_path, src=src_nm, dst=dst_nm, encoding=encoding, regex=regex)
            ls.append(s)

        if 0:
            a, b = ls
            #print(a^b)
            print("a-b", a-b)
            print("\n"*6)
            print("b-a", b-a)
        s = set()
        s.update(*ls)
    return s

def _read_path(path, encoding):
    with open(path, "rt", encoding=encoding) as fin:
        txt = fin.read()
    return txt
def _parse_ccm_xml__path(xml_path, *, src, dst, encoding, regex):
    txt = _read_path(xml_path, encoding)
    #print(txt)
    xml_fin = io.StringIO(txt)
    #xml_fin = txt
    return _parse_ccm_xml__file(xml_fin, src=src, dst=dst, regex=regex)

def _parse_ccm_xml__file(xml_fin, *, src, dst, regex:bool):
    if regex:
        f = _parse_ccm_xml__file__basic__regex
    else:
        f = _parse_ccm_xml__file__basic
    name2chars, _ = f(xml_fin)

    a = name2chars[src]
    b = name2chars[dst]
    assert len(a) == len(b)
    return set(zip(a, b))

def _xml_go(soup, *tags):
    for tag in tags:
        #print(tag)
        [soup] = soup.find_all(tag)
    return soup
def _parse_ccm_xml__file__basic__regex(xml_fin):
    xml_txt = xml_fin.read()
    return _parse_ccm_xml__txt__basic__regex(xml_txt)
def _parse_ccm_xml__txt__basic__regex(xml_txt):
    #<Map Id="简体字符">锕皑</Map>
    rex = re.compile(r'<Map Id="(?P<name>[^"]+)">(?P<chars>\w+)</Map>')
    name2chars = {}
    for m in rex.finditer(xml_txt):
        name2chars[m['name']] = m['chars']

    #<Converter Id="0" Name="简转繁" SourceMapId="简体字符" DestMapId="繁体字符" />
    rex = re.compile(r'<Converter Id="(?P<idx>[^"]+)"\s+Name="(?P<name>[^"]+)"\s+SourceMapId="(?P<src>[^"]+)"\s+DestMapId="(?P<dst>[^"]+)"\s+/>')
    ls = []
    for m in rex.finditer(xml_txt):
        ls.append((m['name'], (m['src'], m['dst'])))

    cvt_src_dst_ls = ls
    return name2chars, cvt_src_dst_ls
def _parse_ccm_xml__file__basic(xml_fin):
    import lxml
    import bs4
    from bs4 import BeautifulSoup
    #bug:xml = BeautifulSoup(xml_fin, 'lxml')
    #   treat as html add <html><body>!!
    #xml = BeautifulSoup(xml_fin, 'lxml')
    #xml = BeautifulSoup(xml_fin, 'xml')
    xml = BeautifulSoup(xml_fin, 'lxml-xml')
    #help(BeautifulSoup)
    #print(dir(xml))
    #print([*xml.children])
    #print(xml)
    #print(xml.get_text())

    it = xml.Config.Maps.find_all('Map')
    #it = _xml_go(xml, "Config", "Maps").find_all('Map')
    #it = _xml_go(xml, "Maps").find_all('Map')
    name2chars = {}
    for m in it:
        chars_name = m['Id']
        chars = m.get_text()
        name2chars[chars_name] = chars

    it = xml.Config.Converters.find_all('Converter')
    name2src_dst = {}
    ls = []
    for m in it:
        cvt_name = m['Name']
        cvt_src_nm = m['SourceMapId']
        cvt_dst_nm = m['DestMapId']
        name2src_dst[cvt_name] = cvt_src_nm, cvt_dst_nm
        ls.append((cvt_name, (cvt_src_nm, cvt_dst_nm)))

    for cvt_name, (cvt_src_nm, cvt_dst_nm) in ls:
        assert len(name2chars[cvt_dst_nm]) == len(name2chars[cvt_src_nm])

    cvt_src_dst_ls = ls
    return name2chars, cvt_src_dst_ls



def _remove_sp(s):
    return re.sub(r"\s+", '', s)
    return ''.join(s.split())
def _parse_cu(encoding='utf8'):
    return _parse_cu__path(Globals.cu_simp_txt_path, Globals.cu_trad_txt_path, encoding=encoding)
def _parse_cu__path(cu_simp_txt_path, cu_trad_txt_path, *, encoding):
    cu_simp_txt = _read_path(cu_simp_txt_path, encoding)
    cu_trad_txt = _read_path(cu_trad_txt_path, encoding)
    return _parse_cu__txt(cu_simp_txt, cu_trad_txt)
def _parse_cu__txt(cu_simp_txt, cu_trad_txt):
    cu_simp_txt = _remove_sp(cu_simp_txt)
    cu_trad_txt = _remove_sp(cu_trad_txt)
    assert len(cu_simp_txt) == len(cu_trad_txt)
    return set(zip(cu_simp_txt, cu_trad_txt))


def _parse_fnlp(encoding="utf8"):
    return set(_iter_parse_fnlp_map_txt_path(Globals.fnlp_map_txt_path, encoding=encoding))
def _iter_parse_fnlp_map_txt_path(fnlp_map_txt_path, *, encoding):
    with open(fnlp_map_txt_path, "rt", encoding=encoding) as fin:
        for line in fin:
            line = line.strip()
            繁, 简 = line.split("\t")
            yield 简, 繁

def _parse_ns_zh(encoding="utf8"):
    return _parse_ns_zh__path(Globals.ns_zh_chconv_py_path, encoding=encoding)
def _parse_ns_zh__path(ns_zh_chconv_py_path, *, encoding):
    ns_zh_chconv_py_txt = _read_path(ns_zh_chconv_py_path, encoding)
    return _parse_ns_zh__txt(ns_zh_chconv_py_txt)

def _parse_ns_zh__txt(ns_zh_chconv_py_txt):
    d = {}
    exec(ns_zh_chconv_py_txt, d, d)
    Simp2Trad_Table = d['Simp2Trad_Table']
    Trad2Simp_Table = d['Trad2Simp_Table']

    s = set()
    def _add(si, ti):
        s.add((chr(si), chr(ti)))
    for si, ti in Simp2Trad_Table.items():
        _add(si, ti)
    for ti, si in Trad2Simp_Table.items():
        _add(si, ti)
    return s

if 0:
    s=_parse_ccm()
    s=_parse_cu()
    s=_parse_fnlp()
    s=_parse_ns_zh()
    print(s)
    print(len(s))


def _mk_对称简繁字对集():
    ss = [
        _parse_ccm()
        ,_parse_cu()
        ,_parse_fnlp()
        ,_parse_ns_zh()
        ]

    s = set()
    s.update(*ss)
    return s

if 0:
    s=_mk_对称简繁字对集()
    print(s)
    print(len(s))






##section##
def _mk_简繁字对集_ex():
    ss = [
        _mk_非对称简繁字对集()
        ,_mk_对称简繁字对集()
        ]

    s = set()
    s.update(*ss)

    ls = []
    for 简, 繁 in s:
        assert len(简) == 1
        assert len(繁) == 1
        简繁 = 简+繁
        ls.append(简繁)
    ls.sort()
    return s, ls

if 0:
    s, ls = _mk_简繁字对集_ex()
    print(s)
    print(len(s))

if __name__ == "__main__":
    s, ls = _mk_简繁字对集_ex()
    for 简繁 in ls:
        print(简繁)


##section##
##section##
##section##
##section##











