#__all__:goto
r'''[[[
e ../../python3_src/nn_ns/CJK/CJK_data/raw/unicode_cjk_部件乊汉字区.py
源自:
view script/列表冫统合码大块汉字分区.py
流至:
view ../lots/NOTE/unicode/cjk/汉字区分区表.txt


nn_ns.CJK.CJK_data.raw.unicode_cjk_部件乊汉字区
py -m nn_ns.app.debug_cmd   nn_ns.CJK.CJK_data.raw.unicode_cjk_部件乊汉字区 -x # -off_defs
py -m nn_ns.app.doctest_cmd nn_ns.CJK.CJK_data.raw.unicode_cjk_部件乊汉字区:__doc__ -ht # -ff -df

[[
数据来源于:
view script/列表冫统合码大块汉字分区.py
    豈鶴区，很混乱，没有明显分区边界，而且是兼容区 => 排除冫豈鶴区
    发现:[一-龥]是根据『康熙字典部首{追加简体部首}』来分区的

#康熙字典部首:汉字区vs部首区:
    #汉字区:在排除了20个简体部首后:纟见讠贝车钅长门韦页风飞饣马鱼鸟齐齿龙龟
一丨丶丿乙亅二亠人儿入八冂冖冫几
⼀⼁⼂⼃⼄⼅⼆⼇⼈⼉⼊⼋⼌⼍⼎⼏

凵刀力勹匕匚匸十卜卩厂厶又口囗土
⼐⼑⼒⼓⼔⼕⼖⼗⼘⼙⼚⼛⼜⼝⼞⼟

士夂夊夕大女子宀寸小尢尸屮山巛工
⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩⼪⼫⼬⼭⼮⼯

己巾干幺广廴廾弋弓彐彡彳心戈戶手
⼰⼱⼲⼳⼴⼵⼶⼷⼸⼹⼺⼻⼼⼽⼾⼿

支攴文斗斤方无日曰月木欠止歹殳毋
⽀⽁⽂⽃⽄⽅⽆⽇⽈⽉⽊⽋⽌⽍⽎⽏

比毛氏气水火爪父爻爿片牙牛犬玄玉
⽐⽑⽒⽓⽔⽕⽖⽗⽘⽙⽚⽛⽜⽝⽞⽟

瓜瓦甘生用田疋疒癶白皮皿目矛矢石
⽠⽡⽢⽣⽤⽥⽦⽧⽨⽩⽪⽫⽬⽭⽮⽯

示禸禾穴立竹米糸缶网羊羽老而耒耳
⽰⽱⽲⽳⽴⽵⽶⽷⽸⽹⽺⽻⽼⽽⽾⽿

聿肉臣自至臼舌舛舟艮色艸虍虫血行
⾀⾁⾂⾃⾄⾅⾆⾇⾈⾉⾊⾋⾌⾍⾎⾏

衣襾見角言谷豆豕豸貝赤走足身車辛
⾐⾑⾒⾓⾔⾕⾖⾗⾘⾙⾚⾛⾜⾝⾞⾟

辰辵邑酉釆里金長門阜隶隹雨靑非面
⾠⾡⾢⾣⾤⾥⾦⾧⾨⾩⾪⾫⾬⾭⾮⾯

革韋韭音頁風飛食首香馬骨高髟鬥鬯
⾰⾱⾲⾳⾴⾵⾶⾷⾸⾹⾺⾻⾼⾽⾾⾿

鬲鬼魚鳥鹵鹿麥麻黃黍黑黹黽鼎鼓鼠
⿀⿁⿂⿃⿄⿅⿆⿇⿈⿉⿊⿋⿌⿍⿎⿏

鼻齊齒龍龜龠
⿐⿑⿒⿓⿔⿕



]]



一丧
丨丵
飞飞
龠龥
>>> 部首巛汉字乊一龥区扌('一')
'一'
>>> 部首巛汉字乊一龥区扌('丧')
'一'
>>> 部首巛汉字乊一龥区扌('丨')
'丨'
>>> 部首巛汉字乊一龥区扌('丵')
'丨'
>>> 部首巛汉字乊一龥区扌('飞')
'飞'
>>> 部首巛汉字乊一龥区扌('龠')
'龠'
>>> 部首巛汉字乊一龥区扌('龥')
'龠'


>>> 部首巛汉字乊一龥区扌('一', with_idx=True)
('一', 0)
>>> 部首巛汉字乊一龥区扌('龥', with_idx=True)
('龠', 233)




>>> (s:=''.join(部首巛汉字乊一龥区扌(hz, traditional_only=True) for hz in 康熙字典部首牜汉字区牜额外简体部首))
'糸見言貝車金長門韋頁風飛食馬魚鳥齊齒龍龜'
>>> s == 康熙字典部首牜汉字区牜额外简体部首转繁体
True


]]]'''#'''
__all__ = r'''
康熙字典部首牜部首区
康熙字典部首牜汉字区牜包含简体部首
    康熙字典部首牜汉字区牜原定繁体部首
    康熙字典部首牜汉字区牜额外简体部首
    康熙字典部首牜汉字区牜额外简体部首转繁体
列表纟统合码汉字分区纟基位面一龥区
    文本纟统合码汉字分区纟基位面一龥区
部首巛汉字乊一龥区扌
'''.split()#'''
__all__
___begin_mark_of_excluded_global_names__0___ = ...
from bisect import bisect_right
___end_mark_of_excluded_global_names__0___ = ...



康熙字典部首牜部首区 =                  '⼀⼁⼂⼃⼄⼅⼆⼇⼈⼉⼊⼋⼌⼍⼎⼏⼐⼑⼒⼓⼔⼕⼖⼗⼘⼙⼚⼛⼜⼝⼞⼟⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩⼪⼫⼬⼭⼮⼯⼰⼱⼲⼳⼴⼵⼶⼷⼸⼹⼺⼻⼼⼽⼾⼿⽀⽁⽂⽃⽄⽅⽆⽇⽈⽉⽊⽋⽌⽍⽎⽏⽐⽑⽒⽓⽔⽕⽖⽗⽘⽙⽚⽛⽜⽝⽞⽟⽠⽡⽢⽣⽤⽥⽦⽧⽨⽩⽪⽫⽬⽭⽮⽯⽰⽱⽲⽳⽴⽵⽶⽷⽸⽹⽺⽻⽼⽽⽾⽿⾀⾁⾂⾃⾄⾅⾆⾇⾈⾉⾊⾋⾌⾍⾎⾏⾐⾑⾒⾓⾔⾕⾖⾗⾘⾙⾚⾛⾜⾝⾞⾟⾠⾡⾢⾣⾤⾥⾦⾧⾨⾩⾪⾫⾬⾭⾮⾯⾰⾱⾲⾳⾴⾵⾶⾷⾸⾹⾺⾻⾼⾽⾾⾿⿀⿁⿂⿃⿄⿅⿆⿇⿈⿉⿊⿋⿌⿍⿎⿏⿐⿑⿒⿓⿔⿕'

康熙字典部首牜汉字区牜原定繁体部首 =    '一丨丶丿乙亅二亠人儿入八冂冖冫几凵刀力勹匕匚匸十卜卩厂厶又口囗土士夂夊夕大女子宀寸小尢尸屮山巛工己巾干幺广廴廾弋弓彐彡彳心戈戶手支攴文斗斤方无日曰月木欠止歹殳毋比毛氏气水火爪父爻爿片牙牛犬玄玉瓜瓦甘生用田疋疒癶白皮皿目矛矢石示禸禾穴立竹米糸缶网羊羽老而耒耳聿肉臣自至臼舌舛舟艮色艸虍虫血行衣襾見角言谷豆豕豸貝赤走足身車辛辰辵邑酉釆里金長門阜隶隹雨靑非面革韋韭音頁風飛食首香馬骨高髟鬥鬯鬲鬼魚鳥鹵鹿麥麻黃黍黑黹黽鼎鼓鼠鼻齊齒龍龜龠'

康熙字典部首牜汉字区牜包含简体部首 = '一丨丶丿乙亅二亠人儿入八冂冖冫几凵刀力勹匕匚匸十卜卩厂厶又口囗土士夂夊夕大女子宀寸小尢尸屮山巛工己巾干幺广廴廾弋弓彐彡彳心戈戶手支攴文斗斤方无日曰月木欠止歹殳毋比毛氏气水火爪父爻爿片牙牛犬玄玉瓜瓦甘生用田疋疒癶白皮皿目矛矢石示禸禾穴立竹米糸纟缶网羊羽老而耒耳聿肉臣自至臼舌舛舟艮色艸虍虫血行衣襾見见角言讠谷豆豕豸貝贝赤走足身車车辛辰辵邑酉釆里金钅長长門门阜隶隹雨靑非面革韋韦韭音頁页風风飛飞食饣首香馬马骨高髟鬥鬯鬲鬼魚鱼鳥鸟鹵鹿麥麻黃黍黑黹黽鼎鼓鼠鼻齊齐齒齿龍龙龜龟龠'

康熙字典部首牜汉字区牜额外简体部首 =        '纟见讠贝车钅长门韦页风飞饣马鱼鸟齐齿龙龟'
康熙字典部首牜汉字区牜额外简体部首转繁体 =  '糸見言貝車金長門韋頁風飛食馬魚鳥齊齒龍龜'

assert len(康熙字典部首牜部首区) == 214
assert len(康熙字典部首牜汉字区牜原定繁体部首) == 214
assert len(康熙字典部首牜汉字区牜包含简体部首) == 234 == 214+20
assert len(康熙字典部首牜汉字区牜额外简体部首) == 20
assert len(康熙字典部首牜汉字区牜额外简体部首转繁体) == 20



文本纟统合码汉字分区纟基位面一龥区 = r'''
000:0040:一丧
001:0014:丨丵
002:0009:丶举
003:0026:丿乘
004:0044:乙亄
005:0007:亅事
006:0020:二亟
007:0026:亠亹
008:0645:人儾
009:0038:儿兤
010:0006:入兪
011:0023:八冁
012:0020:冂冕
013:0021:冖冪
014:0053:冫凟
015:0021:几凴
016:0011:凵凿
017:0155:刀劚
018:0094:力勸
019:0028:勹匔
020:0005:匕匙
021:0030:匚匷
022:0009:匸區
023:0027:十卛
024:0013:卜卨
025:0025:卩厁
026:0052:厂厵
027:0018:厶叇
028:0027:又叢
029:0756:口囖
030:0072:囗圞
031:0460:土壪
032:0023:士夁
033:0008:夂変
034:0011:夊夔
035:0018:夕夦
036:0076:大奲
037:0477:女孏
038:0048:子孿
039:0120:宀寷
040:0023:寸導
041:0019:小尡
042:0022:尢尷
043:0054:尸屭
044:0003:屮屰
045:0362:山巚
046:0010:巛巤
047:0012:工巰
048:0013:己巽
049:0116:巾幱
050:0008:干幹
051:0005:幺幾
052:0117:广廳
053:0010:廴廽
054:0013:廾弊
055:0008:弋弒
056:0061:弓彏
057:0017:彐彠
058:0018:彡彲
059:0080:彳忂
060:0581:心戇
061:0046:戈戵
062:0021:戶扊
063:0740:手攮
064:0005:支攳
065:0083:攴斆
066:0016:文斖
067:0013:斗斣
068:0021:斤斸
069:0039:方旟
070:0005:无旤
071:0267:日曯
072:0024:曰朇
073:0032:月朧
074:1016:木欟
075:0066:欠歡
076:0023:止歸
077:0058:歹殲
078:0024:殳毊
079:0009:毋毓
080:0007:比毚
081:0052:毛氎
082:0005:氏氓
083:0032:气氳
084:1079:水灪
085:0447:火爩
086:0012:爪爵
087:0005:父爺
088:0004:爻爾
089:0008:爿牆
090:0018:片牘
091:0002:牙牚
092:0081:牛犫
093:0216:犬玃
094:0005:玄玈
095:0339:玉瓛
096:0010:瓜瓥
097:0050:瓦甗
098:0007:甘甞
099:0009:生甧
100:0008:用甯
101:0091:田疊
102:0007:疋疑
103:0228:疒癵
104:0007:癶發
105:0049:白皭
106:0017:皮皾
107:0047:皿盭
108:0237:目矚
109:0007:矛矡
110:0017:矢矲
111:0327:石礹
112:0126:示禷
113:0006:禸禽
114:0182:禾穳
115:0087:穴竊
116:0046:立竸
117:0378:竹籲
118:0133:米糷
119:0423:糸纞
120:0151:纟缵
121:0027:缶罐
122:0057:网羉
123:0051:羊羼
124:0068:羽耀
125:0011:老耋
126:0006:而耑
127:0033:耒耲
128:0076:耳聾
129:0010:聿肈
130:0346:肉臢
131:0007:臣臩
132:0009:自臲
133:0009:至臻
134:0016:臼舋
135:0015:舌舚
136:0004:舛舞
137:0079:舟艭
138:0004:艮艱
139:0006:色艷
140:0981:艸虌
141:0030:虍虪
142:0469:虫蠿
143:0012:血衋
144:0023:行衢
145:0283:衣襽
146:0013:襾覊
147:0054:見觀
148:0017:见觑
149:0046:角觿
150:0416:言讟
151:0151:讠谶
152:0015:谷豅
153:0015:豆豔
154:0035:豕豷
155:0037:豸貜
156:0128:貝贜
157:0071:贝赣
158:0012:赤赯
159:0067:走趲
160:0248:足躪
161:0031:身軉
162:0156:車轥
163:0053:车辚
164:0021:辛辯
165:0005:辰辴
166:0220:辵邐
167:0184:邑酈
168:0125:酉釅
169:0006:釆釋
170:0005:里釐
171:0692:金钄
172:0242:钅镶
173:0008:長镾
174:0001:长长
175:0104:門闧
176:0052:门阛
177:0154:阜隵
178:0003:隶隸
179:0047:隹雧
180:0105:雨靐
181:0013:靑靝
182:0004:非靡
183:0007:面靨
184:0098:革韊
185:0027:韋韥
186:0007:韦韬
187:0006:韭韲
188:0014:音頀
189:0116:頁顴
190:0051:页颧
191:0038:風飍
192:0013:风飚
193:0003:飛飝
194:0001:飞飞
195:0132:食饢
196:0051:饣馕
197:0003:首馘
198:0019:香馫
199:0192:馬驫
200:0060:马骧
201:0048:骨髗
202:0007:高髞
203:0070:髟鬤
204:0010:鬥鬮
205:0003:鬯鬱
206:0010:鬲鬻
207:0030:鬼魙
208:0290:魚鱻
209:0105:鱼鳤
210:0314:鳥鸞
211:0086:鸟鹴
212:0010:鹵鹾
213:0038:鹿麤
214:0022:麥麺
215:0008:麻黂
216:0010:黃黌
217:0004:黍黐
218:0040:黑黸
219:0004:黹黼
220:0017:黽鼍
221:0005:鼎鼒
222:0013:鼓鼟
223:0027:鼠鼺
224:0015:鼻齉
225:0006:齊齏
226:0002:齐齑
227:0045:齒齾
228:0014:齿龌
229:0012:龍龘
230:0003:龙龛
231:0003:龜龞
232:0001:龟龟
233:0006:龠龥
'''#'''
文本纟统合码汉字分区纟基位面一龥区

def _parse(txt, /):
    return tuple(s.split(':')[-1] for s in txt.split())
列表纟统合码汉字分区纟基位面一龥区 = _parse(文本纟统合码汉字分区纟基位面一龥区)
assert len(列表纟统合码汉字分区纟基位面一龥区) == 234
    # == ("一丧", ..., "龠龥")





def 部首巛汉字乊一龥区扌(hz, /, *, with_idx=False, traditional_only=False):
    assert '一' <= hz <= '龥'
    assert len(hz) == 1
    部首表 = 康熙字典部首牜汉字区牜包含简体部首 if not traditional_only else 康熙字典部首牜汉字区牜原定繁体部首
    #bug:j = bisect_right(hz, 部首表)
    j = bisect_right(部首表, hz)
    assert j, j
        # !! [hz >= '一']
    i = j-1
    部首 = 部首表[i]
    if with_idx:
        return (部首, i)
    return 部首

__all__
from nn_ns.CJK.CJK_data.raw.unicode_cjk_部件乊汉字区 import 康熙字典部首牜部首区,康熙字典部首牜汉字区牜包含简体部首,康熙字典部首牜汉字区牜原定繁体部首,康熙字典部首牜汉字区牜额外简体部首,康熙字典部首牜汉字区牜额外简体部首转繁体
from nn_ns.CJK.CJK_data.raw.unicode_cjk_部件乊汉字区 import 列表纟统合码汉字分区纟基位面一龥区, 文本纟统合码汉字分区纟基位面一龥区
from nn_ns.CJK.CJK_data.raw.unicode_cjk_部件乊汉字区 import 部首巛汉字乊一龥区扌
#def 部首巛汉字乊一龥区扌(hz, /, *, with_idx=False, traditional_only=False):
from nn_ns.CJK.CJK_data.raw.unicode_cjk_部件乊汉字区 import *
